[{"chapterName":"Adventuring","chapterNumber":8,"contentMarkdown":"# Chapter 8: Adventuring\r\n\r\nDiving through an asteroid field, docking in a space port, or simply exploring the wild blue yonder, are the things that *Star Wars* adventures are made of. Your character, with the aid of their ship, might explore wild space, undertake dangerous smuggling missions, or dispatch pirate ships. And if all goes well, your character will survive to claim rich rewards before embarking on a new adventure.\r\n\r\nThis chapter covers the basics of adventuring in space, from the mechanics of movement to the acquisition of the ship itself. The rules for repair are also in this chapter, along with a discussion of the activities your characters might pursue between adventures.\r\n\r\nWhether adventurers are exploring uncharted territories or a complicated relationship with a criminal organization, the game follows a natural rhythm, as outlined in the book's introduction:\r\n\r\n___\r\n\r\n**1. The GM describes the environment.**\r\n\r\n**2. The players describe what they want to do.**\r\n\r\n**3. The GM narrates the results of their actions.**\r\n\r\n___\r\n\r\nTypically, the GM uses a map as an outline of the adventure, tracking the characters' progress as they explore enclave corridors or wilderness regions.\r\n\r\nThe GM's notes, including a key to the map, describe what the adventurers find as they enter each new area. Sometimes, the passage of time and the adventurers' actions determine what happens, so the GM might use a timeline or a flowchart to track their progress instead of a map.\r\n\r\n## Ship Registration\r\nPilots are required to register their starships with the Bureau of Ships and Services (or BoSS). Additionally, at registration, the pilot must acquire an Operating License at the cost of 1,000 credits. To be eligible for this license they must pass a written piloting test, which requires a DC 15 Intelligence (Piloting) check.\r\n\r\n### Transponder Codes\r\nWhen ships are created, they are assigned a unique signal called a transponder code. Once registered with the BoSS, this signal can be used to identify that ship using the BoSS database. The transponder code can be used to identify a ship's owner, designation, make and model, as well as any registered modifications. Additionally, a transponder code can be used to access the ship's ownership history.\r\n\r\nThe transponder code is built into the ship's sublight engines, making any attempt to remove or alter it incredibly difficult; failing an attempt could damage or destroy a ship's engines.\r\n\r\n> ##### The Bureau of Ships and Services\r\n> The Bureau of Ships and Services (BoSS) is a long-standing, impartial, third-party galactic organization that manages all data related to the massive number of starships present in the galaxy. The BoSS has stood for thousands of years due to their ability to stay neutral in conflicts.\r\n> Information on a ship's ownership and its captains certifications are kept on file at the BoSS at all times. The data is distributed to spaceports upon request, but it is an expensive and slow process. As a result of this, smaller spaceports rarely update their registries more than once a year.\r\n> The security on BoSS computer systems is of the highest caliber money can buy, making it almost impossible to access without proper authorization codes.\r\n\r\n## Communications\r\nStarships are equipped with basic systems that allow for communication in realspace. Typically, starship communications systems are limited to contact ships and planets within the same system, although boosters and specialized radios can reach up to several light-years. Opening a channel to a willing recipient is simply a matter of pinging their ship. They will receive a notification and can respond, opening the lines of communication.\r\n\r\n### HoloNet\r\nThe Holonet is an instantaneous communication system that allows planets to stay in contact despite the vast distances between them. A HoloNet transceiver transmits and receives information through hyperspace, allowing information to travel millions of times faster than the speed of light. Hyperwave transceivers are embedded at strategic locations, constantly relaying information throughout the galaxy. This networks allows for instantaneous three-dimensional holographic communications at virtually any distance, making it one of the primary means of communication. Government agencies, such as the military, typically maintain their own encrypted circuits on the HoloNet. Some experienced slicers have been able to access these encrypted channels, though it required access to a government compound for the requisite codes.\r\n\r\n### METOSP (Message to Spacers)\r\nUpon arrival in a star system, most starships immediately connect to a specialized frequency responsible for communicating with incoming and outbound ships, called Message to Spacers, or METOSP. The METOSP message typically conveys a repeated greeting with information about flight hazards (such as blockades, weather, debris, or collisions) and relevant local regulations or customs (such as embargoes, tariffs, or landing procedures). All METOSPs are broadcast in Galactic Basic, though some worlds also broadcast in their native language. A METOSP provides pilots with contact information for spaceport control as well as information on landing patterns and traffic lanes. Most METOSPs are brief, repeating messages that refer listeners to other channels for specific information.\r\n\r\n### Planetary Information Channels\r\nMost planets also provide incoming space traffic with basic computer communication channels. These channels connect the ship to planetary information networks that provide everything from communications directory assistance to tourism information and planetary maps. Planetary information channels allow use of the Technology skill to access information relevant to the planet, and it possible for a slicer to access other functions.\r\n\r\n## Time\r\nIn situations where keeping track of the passage of time is important, the GM determines the time a task requires. The GM might use a different time scale depending on the context of the situation at hand. In an enclosed environment, the adventurers' movement happens on a scale of minutes. It takes them about a minute to navigate an asteroid field, a minute to dock in a space port, and a good 10 minutes to clear customs.\r\n\r\nWhile traveling in realspace, a scale of hours is often more appropriate. Adventurers eager to reach a pirate stronghold on the other side of the planet travel those 150 miles in just over an hour.\r\n\r\nIn hyerspace, however, a scale of days works best. Following the hyperlane from Tatooine to Kashyyyk, the adventurers spend four uneventful days before a pirate ambush interrupts their journey.\r\n\r\nIn combat and other fast-paced situations, the game relies on rounds, a 6-second span of time described in chapter 9.\r\n\r\n## Movement and Travel\r\nThere are two significant travel types: Realspace and Hyperspace. \r\n\r\n### Travel in Realspace\r\nAll starships have sublight engines that propel them through realspace, using them when taking off, landing, or flying within a gravity sphere. \r\n\r\nWhen traveling in realspace, the GM can summarize the adventurers' movement without calculating exact distances or travel times: \"You fly around the planet, reaching the stronghold late in the evening.\" \r\n\r\nSometimes it's important, though, to know how far, how fast, and how maneuverable your ship is in a short window of time. Starships come equipped with two speeds: **flying speed** and **turning speed**. \r\n\r\n#### Flying Speed\r\n**Flying speed** is how far your ship can travel in a single round. It is expressed in feet. For every foot your ship travels forward, it expends one foot from its speed.\r\n\r\nA ship's unmodified flying speed is determined in **Chapter 3: Starships** by the Role selected for the ship at construction.\r\n\r\n#### Turning Speed\r\n**Turning speed** determines how maneuverable your ship is. In order for your ship to rotate 90 degrees, you must spend an amount of your **flying speed** equal to your **turning speed**. For instance, if your ship has a **flying speed** of 350 feet, and a **turning speed** of 100 feet, you can travel 150 feet in a straight line, spending 150 feet of your **flying speed**, and then turn 90 degrees to starboard, spending 100 feet of your **flying speed**, leaving 100 feet of movement remaining.\r\n\r\nTypically games are played with turning limited to 90 degree increments, but, if your group has the desire and capability to track smaller angles, this is allowed.\r\n\r\nA ship can turn more (or less, if your group agrees) than 90 degrees on its turn, by spending a proportionate amount of movement.\r\n\r\nIf a ship's turning speed exceeds its flying speed, that ship cannot turn 90 degrees, in combat conditions, absent another effect modifiying the ship's turning speed and/or flying speed or the Hard Turn action.\r\n\r\nA ship's unmodified turning speed is determined in **Chapter 3: Starships** by the Role selected for the ship at construction.\r\n\r\n#### Travel Pace\r\nWhile traveling in realspace, a starship can move at a normal, fast, or slow pace. While traveling at a fast pace, your starship's flying speed is doubled, but your starship&mdash;and its crew&mdash;have disadvantage on Intelligence (Probe) and Wisdom (Scan) checks. While traveling at a slow pace, your flying speed is halved, but you can travel stealthily. A fast pace makes a ship less perceptive, while a slow pace makes it possible to sneak around and to search an area more carefully (see the \"Activity While Traveling\" section later in this chapter for more information).\r\n\r\nYou can use the following **Sample Realspace Travel Times** table to determine travel times in realspace for an average starship traveling at a normal pace.\r\n\r\n#### Sample Realspace Travel Times\r\n|Distance|Time Required|\r\n|:--|--:|\r\n|Surface of planet to orbit|1-5 minutes|\r\n|Orbit to safe hyperspace jump distance|1 minute|\r\n|Orbit to planet's moon|10-30 minutes|\r\n|Orbit to another planet in the same system|2-6 hours|\r\n|Orbit to outer edge of system|12-24 hours|\r\n\r\n#### Difficult Terrain\r\nThe travel speeds given in the **Sample Realspace Travel Times** table assume unobstructed terrain. But adventurers often face narrow canyons, tight formations, or other difficult terrain.\r\n\r\nYou move at half speed in difficult terrain&mdash;moving 10 feet in difficult terrain costs 20 feet of flying speed&mdash;so you can cover only half the normal distance in a minute, an hour, or a day.\r\n\r\n#### Fuel Usage\r\n\r\nA ship uses a unit's worth of fuel for one day of flight in realspace or hyperspace, after one hour of flight in atmosphere, or in a single jump to hyperspeed.\r\n \r\n#### Activity While Traveling\r\nAs adventurers travel on their starship, they need to remain alert for danger, and some characters might perform other tasks to help the group's journey.\r\n\r\n> A ship might encounter a hostile ship while some crewmembers are resting or relaxing instead of deployed. It is up to the GM to determine how long it takes each crewmember to deploy.\r\n\r\n#### Stealth\r\nWhile traveling at a slow pace, the starship can move stealthily. As long as they're not in the open, they can try to surprise or sneak by other starships they encounter. See the rules for hiding in chapter 7.\r\n\r\n#### Noticing Threats\r\nUse the passive Wisdom (Scan) score of the ship to determine whether anyone in the starship notices a hidden threat. The GM might decide that a threat can be noticed only by active characters. For example, as the characters are traveling through an asteroid field, the GM might decide that only those characters actively operating the ship (as opposed to remaining in their bunks) have a chance to spot a stealthy starship following the group. While traveling at a fast pace, the ship takes a -5 penalty to its passive Wisdom (Scan) score to notice hidden threats.\r\n\r\n***Encountering Starships.*** If the GM determines that the adventurers encounter another starship while they're traveling, it's up to both groups to decide what happens next. Either group might decide to attack, initiate a dialogue, run away, or wait to see what the other group does.\r\n\r\n***Surprising Foes.*** If the adventurers encounter a hostile creature or group, the GM determines whether the adventurers or their foes might be surprised when combat erupts. See **Chapter 9: Combat** for more about surprise.\r\n\r\n#### Other Activities\r\nCharacters who turn their attention to other tasks as the group travels are not focused on watching for danger. However, a character not watching for danger can do one of the following activities instead, or some other activity with the GM's permission.\r\n\r\n***Navigate.*** The character can try to prevent the group from becoming lost, making an Intelligence (Astrogation) check when the GM calls for it. (The *Dungeon Master's Guide* has rules to determine whether the group gets lost.)\r\n\r\n***Maintain a Map.*** The character can maintain a map that records the group's progress and helps the characters get back on course if they get lost. No ability check is required.\r\n\r\n***Track.*** A character can follow the tracks of another starship, making an Intelligence (Probe) check when the GM calls for it. (The *Dungeon Master's Guide* has rules for tracking.)\r\n\r\n> ##### Splitting Up the Party\r\n> Splitting up the party is more difficult when your party only has one ship. Should they acquire a fleet of their own, however, they can form multiple parties, each moving at a different speed. Each group has its own deployment order.\r\n> The drawback to this approach is that the party will be split into several smaller groups in the event of an attack. The advantage is that a small group of stealthy ships moving slowly might be able to sneak past enemies that clumsier ships would alert. A X-wing moving at a slow pace is much harder to detect than the Corellian Corvette they leave behind.\r\n\r\n### Landing Gear\r\nAll ships, regardless of size, come with integrated landing gear, complete with magnetic clamps. A ship can use its landing gear to bind itself another ship of a larger size. The landing gear can be engaged remotely from the cockpit, or manually in the event of primary system failure.\r\n\r\n### Movement in Zero Gravity\r\nIn some circumstances, such as prolonged power failure, or movement in space outside of the ship, a character might find themselves moving in zero gravity.\r\n\r\nWhile in zero gravity, a character has a flying speed equal to their walking speed, and zero gravity is treated as difficult terrain.\r\n\r\nIf a character already had a flying speed, they instead do not treat zero gravity as difficult terrain.\r\n\r\n#### Base Hyperspace Travel Times (Hours)   \r\n######  ***Region Traveling to*** \r\n|***Region Traveling from***|**Deep Core**|**Core**|**Colonies**|**Inner Rim**|**Expansion Region**|**Mid Rim**|**Outer Rim**|**Wild Space**|**Unknown Regions**|\r\n|:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|\r\n|**Deep Core**       | 12| 18| 24| 48| 72| 96|120|144|168|\r\n|**Core**            | 24|  6| 24| 36| 60| 84| 96|120|144|\r\n|**Colonies**        | 48| 24| 12| 24| 48| 72| 96|120| 96|\r\n|**Inner Rim**       | 72| 36| 24| 18| 24| 48| 72| 96| 72|\r\n|**Expansion Region**| 96| 60| 48| 24| 24| 24| 48| 72| 96|\r\n|**Mid Rim**         |120| 84| 72| 48| 24| 36| 24| 48| 72|\r\n|**Outer Rim**       |144| 96| 96| 72| 48| 24| 48| 24| 60|\r\n|**Wild Space**      |168|120|120| 96| 72| 48| 24| 12|120|\r\n|**Unknown Regions** |192|144| 96| 72| 60| 72| 96|120| 48|\r\n\r\n### Travel in Hyperspace\r\nThe fastest way to travel long distances in space is through hyperspace. When a starship engages its hyperdrive, it accelerates beyond the speed of light and enters hyperspace. A starship in hyperspace can't communicate with ships in realspace. It is effectively cut off from realspace while in hyperspace.\r\n\r\nLarge objects that generate significant gravity, such as planets and stars, produce what is known as a \"mass shadow\" that projects into hyerspace. Collision with a mass shadow can have catastrophic repercussions. Hyperdrives have built-in safeguards that prevent a ship from jumping to hyperspace while inside of a mass shadow, causing a ship to immediately revert to realspace if the mass shadow is detected. Interdiction vesssels use gravity well generators to keep ships from activating their hyperdrives. Some pirates have been known to drag asteroids into hyperspace lanes in order to drag prey out of hyperspace.\r\n\r\nA ship uses a unit's worth of fuel for one day of flight in hyperspace and one unit for a single jump to hyperspeed.\r\n\r\n#### Travel Pace\r\nWhile traveling in hyperspace, a starship travels at a set speed as determined by the classification of the hyperdrive. A class 1 hyperdrive travels at hyperspeed, while a class 2 hyperdrive travels at half hyperspeed, and a class .5 hyperdrive travels at twice hyperspeed. \r\n\r\nThe galaxy at large is divided into territories, which are in turn subdivided into sectors. Traveling from one planet to another in the same sector takes less time than traveling from one planet to another in a different sector of the same territory. Consequently, traveling to a planet in a different territory takes even longer.\r\n\r\nYou can use the above **Base Hyperspace Travel Times** table to determine travel times. These times assume a class 1 hyperdrive.\r\n\r\n#### Astrogation\r\nPlotting a hyperspace course requires incredibly difficult calculations. Before jumping to hyperspace, a ship must plot a course via astrogation by completing 10 astrogation equations. When not under stress, a crewmember can take 10 minutes to carefully make these calculations and check them, resulting in automatic success. When under duress, such as in combat situations, a crewmember can calculate astronavigation with an Intelligence (Astrogation) check as an action on their turn, and then consults the **Astrogation Results** table.\r\n\r\n#### Astrogation Results\r\n|d20|\tResult|\r\n|:--:|:--|\r\n|9 or lower | Your calculations fail, resulting in no completed equations.|\r\n|10-15 | Your calculations are adequate, resulting in one completed equation.|\r\n|16-20 | Your calculations include a breakthrough, resulting in two completed equations.|\r\n|21-25 | Your calculations are excellent, resulting in three completed equations.|\r\n|26-29 | Your calculations are masterful, resulting in four completed equations.|\r\n|30+   |Your calculations are perfect, resulting in five completed equations.|\r\n\r\nAdditionally, the accuracy of the check is affected by how old the astrogation information is. If the astrogation information is less than a day old, the operator has advantage on the check. If the information is older than a week, however, they have disadvantage on the check.\r\n\r\nYou may choose to penalize your Intelligence (Astrogation) checks by 5 before making them in order to reduce your travel time by 24 hours; if this would reduce the travel time to less than 24 hours, you instead reduce the remaining travel time by one-half, to a minimum of 1 hour.  You must restart your calculations if you change this course choice.\r\n\r\nAlternatively, you may gain a +5 circumstance bonus on your Intelligence (Astrogation) checks if you voluntarily double the travel time.\r\n\r\n#### Hyperspace Hazards\r\nA jump to hyperspace can always be rushed, being made before all ten equations are completed, but such travel can be incredibly dangerous. If a starship is disabled because of a poorly plotted hyperspace course, the GM usually chooses the point at which the ship drops out of hyperspace at random. GMs looking for a more in-depth description of a hyperspace mishap can consult the table below.  For every complete equation, add 1 to your roll on the table below. If you roll a 1 on your die, you roll again on the table in addition to suffering the indicated penalty.  If you make a jump without *any* calculations and roll a 20, your ship comes out of hyperspace unscathed, but in a completely unknown location.\r\n\r\n#### Detecting Hyperspace Travel\r\nWhen a starship enters or exits hyperspace, it generates a short burst of Cronau radiation. Any facility with adequate sensor arrays can detect this radiation burst with a DC 20 Wisdom (Scan) check. Success would indicate that a ship entered or exited the system as well as the point of arrival or departure. With a successful Intelligence (Probe) check (DC 25), the angle of departure can be determined, indicating possible destinations.\r\n\r\n#### Hyperspace Mishaps\r\n|D20|Result|\r\n|:--:|:--|\r\n|20+    |   The ship suffers no adverse consequences.|\r\n|18-19    | The ship encounters dumped cargo, setting off a collision alarm. The ship must make a DC 15 Constitution save.  On a failure, the ship takes 3 hull dice of damage;  the ship takes half damage on a suc-cess. The cargo is salvageable, it consists of 10d10 tons of cargo, each with a value of 10d10x10 credits.|\r\n|15-17  | The ship passes through an uncharted dust cloud, clogging sensors and communications equipment. Scan and Probe checks aboard the ship are made with disadvantage until the ship is refitted. |\r\n|12-14  | The ship passes too close to a supernova, overloading computer systems with solar radiation. Intelligence checks aboard the ship have disadvantage until the ship is refitted.|\r\n|9-11  | The ship passes through an unexpected gravity field, causing structural stress. Maneuver checks are made with disadvantage until the ship is refitted.|\r\n|6-8  | Intense gravity warps the vessel's structural integrity.  The ship's AC is reduced by 2 until the ship is refitted.|\r\n|3-5  | The ship collides with significant debris, its hull immediately taking kinetic damage equal to one-tenth of its max HP, and shields regenerate at half their normal rate until the ship is refitted.|\r\n|1-2    | The hyperdrive suffers a catastrophic failure, and is rendered unusable until the ship is refitted.|\r\n\r\n>**The BoSS:** In addition to their duties of regulating information regarding ship ownership, the BoSS also maintains a database of astrogation information. Each time a ship docks in a major spaceport, they can update their astrogation data for a 150 credit fee. Astrogation data is routinely updated and is rarely more than a week old.\r\n\r\n## Crewing a Ship\r\nShips have a minimum and maximum crew capacity determined by their size, modifications, and ability scores. Most Small fighters, for instance, have a single crewmember controlling all aspects of the ship. Medium ships, however, might have a crew of half a dozen, while larger ships have crews in the tens to hundreds of thousands. \r\n\r\n### Minimum Effective Crew\r\nShips other than Tiny have a minimum number of required crewmembers to operate effectively. A small ship has a minimum effective crew of 1. For medium and larger ships, the minimum effective crew is determined by a ship's Intelligence modifier and its size, as shown below in the **Starship Minimum Effective Crew by Size** table.  \r\n\r\n#### Starship Minimum Effective Crew by Size \r\n######  ***Ship Size*** \r\n|***Ship Intelligence Modifier***|**Medium**|**Large**|**Huge**|**Gargantuan**|\r\n|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|\r\n|**-2**| 6| 800| 10,000|120,000|\r\n|**-1**| 5| 600| 8,000|100,000|\r\n|**0** | 4| 400| 7,000|80,000|\r\n|**1** | 3| 200| 6,000|70,000|\r\n|**2** | 2| 120| 5,000| 60,000|\r\n|**3** | 1| 64| 4,000| 50,000| \r\n|**4** | 1| 32| 3,000| 40,000|\r\n|**5** | 1| 16| 2,000| 30,000|\r\n|**6** | 1| 8| 1,000| 20,000|\r\n|**7** | -| - |   -  | 10,000|\r\n\r\nThis Minimum Effective Crew can be further altered by certain other features such as modifications.\r\n\r\n> #### Shifts\r\n> GMs should note that most large or larger starships have significantly larger crews than the minimum effective crew.  This is because such ships must be run and maintained constantly.  \r\n>Such ships usually employ crew in three or more shifts, so that approximately one-third of the crew is on duty at any given time, allowing the ship to always maintain a minimum effective crew at all times. \r\n\r\n### Skeleton Crew\r\n\r\nShips can, in extremis, be run by a crew that is smaller than the minimum effective crew.  However, this can be dangerous and results in a ship that is less effective than it otherwise would be. \r\n\r\n#### Ongoing Effects\r\nWhen a ship is run with a crew three-quarters the size of the minimum effective crew, the ship operates as though it were suffering from one more level of system damage than it otherwise would.  \r\n\r\nWhen a ship is run with a crew one-half the size of the minimum effective crew, the ship operates as though it were suffering from two more levels of system damage than it otherwise would. \r\n\r\nWhen a ship is run with a crew one-quarter the size of the minimum effective crew, the ship operates as though it were suffering from three more levels of system damage than it otherwise would. \r\n\r\nWhen a ship is run with a crew one-tenth the size of the minimum effective crew, the ship operates as though it were suffering from four more levels of system damage than it otherwise would. \r\n\r\nA ship cannot operate with a skeleton crew if the skeleton crew would cause the ship to operate as though it had 5 or more levels of system damage.\r\n\r\n#### Potential Damage\r\nAt the end of every full day of operation with a skeleton crew, the crewmember at the helm must make an Intelligence (Piloting) check to determine if the ship has suffered any damage as a result of operating with less than a minimum effective crew.  The DC for the check is 10 + 2 for every level of system damage the ship is operating at when the check is made.\r\n\r\n### Maximum Crew Size\r\n\r\nTiny Ships have a maximum crew size of 0.  Small Ships normally have a maximum crew size of 1, but this limit can be raised with the addition one or more Crew Expansion suite modifications and the Astromech Socket modification.  Medium and larger ships have a maximum crew size determined only by logic and space constraints, but are still limited in the number of actions that the ship can take each turn (5+the maximum number of Fire actions that can be taken by that ship.)\r\n\r\n### NPC Crews (Enlisted)\r\n\r\nSome players may find themselves lacking the requisite number of crewmembers to properly manage a starship. Under such circumstances, they will find themselves in need of NPC crewmembers.\r\n\r\n#### Acquiring an NPC Crew\r\n\r\n##### Joining a Faction\r\n\r\nJoining a large faction, such as the Galactic Republic or the Empire might merit being given charge of a crew. Generally, the crew is still loyal to the faction, but will continue to follow the orders of the party as long as they are not at odds with the faction’s goals. Refusing missions or violating the faction’s rule may lead to a labor strike, crew abandonment, or even mutiny.\r\n\r\n##### Salaried Crew\r\n\r\nThe party could seek to hire a reputable crew by offering to pay them wages for their time, risk, and expertise. Generally, a salaried crewmember will require a salary of 10 credits per day and hiring bonus of 300 credits. Such a crew is generally averse to committing crimes. Committing crimes or failing to pay wages may lead to a labor strike, crew abandonment, or even mutiny.\r\n\r\n##### Dispensational Crew\r\n\r\nThe party could seek to hire a less reputable crew by offering a portion of the ship’s profits. A dispensational crew generally requires 60% of profits split amongst the crew. Such a crew has no aversions to any actions or choices made by the crew. Failing to divide profits, however, may lead to a labor strike, crew abandonment, and a higher chance of mutiny. \r\n\r\n##### Droid Crew\r\n\r\nThe party could seek to build or purchase droids to crew their ship. Droid crews are different than humanoid crews in several different ways.\r\n- Droids do not require pay, but do cost 900 credits per unit to purchase (half if built by the party) and cost 2 credits per day in maintenance. \r\n- Droid NPC crewmembers are considered medium-sized when determining housing arrangements. \r\n- Droids do not eat, but the ship has higher energy needs to keep droids powered up. For every suite capacity worth of droid NPC crewmembers (rounded down), the ship’s fuel usage increases by 10%. \r\n- While droids will not cause a labor strike, abandon the ship, or mutiny, failing to provide adequate power leads to one level of exhaustion for every droid NPC crewmember every day they are without power.\r\n\r\n### Room and Board\r\n\r\nCrewmembers generally expect room and board to be provided by the players. Each crewmember requires a place to sleep and one portion of food per day. Providing better housing reduces the amount the players need to pay their crew since this is considered a benefit of working for the players. \r\n\r\n- Barracks are considered the normal sleeping situation for most crews. \r\n- Providing living quarters to sleep in reduces the necessary pay for the crewmembers sleeping there by one third (2/3 the original pay). \r\n- Providing luxury quarters to sleep in reduces the necessary pay for the crewmembers sleeping there by one half (1/2 the original pay). \r\n- If sleeping quarters or food portions are not supplied (e.g., the ship is not in 24 hour service), the necessary pay for crewmembers increases by one half for each of these necessities not provided (1.5 or 2 times the original pay).\r\n\r\n### NPC Crew Actions (Officers)\r\n\r\nNPC crewmembers may be used for more than just reaching minimum crew requirements, they may also be used to take actions on a starship.  The cost of such NPC officers, however, is much greater than for the rest of the enlisted crew, and this cost is related to their proficiency bonus. For salaried officers and droid officers, the initial and ongoing costs are shown in the **Officer NPC Costs** table below.  Officer NPC crewmembers typically have a proficiency bonus equal to the tier of the starship plus one (minimum +2), an intelligence modifier also equal to the tier of the ship (minimum +1), and ranks in deployments also equal to the tier of the ship (minimum of 1). \r\n\r\n#### Officer NPC Costs \r\n######  ***Salaried Officers******Droid Officers*** \r\n|***Ship Tier***|**Prof. Bonus**|**Hiring Bonus**|**Daily Salary**|**Purchase Cost**|**Maint. Cost**|\r\n|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|\r\n|**0**|+2| 600cr| 12cr|1,800cr|3cr|\r\n|**1**|+2| 600cr| 12cr|1,800cr|3cr|\r\n|**2** | +3| 1,800cr| 36cr|5,400cr|9cr|\r\n|**3** | +4| 5,400cr| 108cr|16,200cr|27cr|\r\n|**4** | +5| 16,200cr| 324cr| 48,600cr|81cr|\r\n|**5** | +6| 48,600cr| 972cr| 145,800cr|243cr|\r\n\r\n## Start-Up Procedure\r\n\r\nStarting up a starship requires many systems to boot, diagnostics to run, and mechanics to warm-up. Before becoming fully operable, a ship must start-up by completing 10 initiation procedures. When not under stress, a crew can take an amount of time shown in the **Starships Start-Up Time** table below to carefully complete these initiation procedures, resulting in automatic success. \r\n\r\n#### Starships Start-Up Time\r\n\r\n|Ship Size |Start-Up Time|\r\n|:--|:--|\r\n|Tiny | 1 minute |\r\n|Small | 2 minutes |\r\n|Medium | 5 minutes |\r\n\r\n|Ship Size |Start-Up Time|\r\n|:--|:--|\r\n|Large | 10 minutes |\r\n|Huge | 30 minutes |\r\n|Gargantuan | 60 minutes |\r\n\r\nWhen under duress, such as in combat situations, a pilot can lead their crew through an emergency start-up procedure by having a number of crew equal to the minimum crew size spend an action to complete initiation procedures.  On their turn, the crewmember leading the effort makes an Intelligence (Piloting) check as an action on their turn, and then consults the **Start-Up Procedures Results** table.\r\n\r\n#### Start-Up Procedures Results\r\n|d20|\tResult|\r\n|:--:|:--|\r\n|9 or lower | Your procedures fail, resulting in no completed initiation procedures.|\r\n|10-15 | Your procedures are adequate, resulting in one completed initiation procedure.|\r\n|16-20 | Your procedures include a breakthrough, resulting in two initiation procedures.|\r\n|21-25 | Your procedures are excellent, resulting in three completed initiation procedures.|\r\n|26-29 | Your procedures are masterful, resulting in four completed initiation procedures.|\r\n|30+   |Your procedures are perfect, resulting in five completed initiation procedures.|\r\n\r\nAdditionally, the ease of the check is affected by the state of repair of the ship. If the ship has maximum hull and shield points, the crewmember has advantage on the check. If the ship has less than its maximum hull points, however, they have disadvantage on the check.\r\n\r\nYou may choose to penalize your Intelligence (Piloting) check on each turn by 5 before making them in order to reduce the crew needed to perform the Start-up by half.  \r\n\r\nAlternatively, you may gain a +5 bonus on your Intelligence (Piloting) check if you have at least 1.5 times the minimum crew size completing initiation procedures.\r\n\r\n### Hazards of a Cold Start\r\nA start-up procedure, even an emergency one, can always be rushed, being made before all ten initiation procedures are completed, but such recklessness can be incredibly dangerous. If a ship takes off before a start-up procedure is completed, consult the Start-Up Mishaps table below. For every complete initiation procedure, add 1 to your roll on the table below. If you roll a 1 on your die, you roll again on the table in addition to suffering the indicated penalty.  If you take off without *any* initiation procedures and roll a 20, your ship is unscathed, but starts with no power dice available.  Power dice then regenerate using standard rules in later rounds.\r\n\r\n> #### Delayed Penalty\r\n> In certain circumstances, a GM may choose to roll secretly on the Start-Up Mishaps table and delay application of the penalty for dramatic effect.\r\n\r\n#### Start-Up Mishaps\r\n|d20|Result|\r\n|:--:|:--|\r\n|20+    |    The ship suffers no adverse consequences.|\r\n|18-19  | The ship's navcomputer is disabled until the ship recharges. |\r\n|15-17  | The ship gains one level of slowed until the ship recharges. |\r\n|12-14  | The ship is blinded until the ship recharges.|\r\n|9-11 | The ship gains one level of system damage.|\r\n|6-8  | The ship gains two levels of system damage.|\r\n|3-5  | The ship gains three levels of system damage.|\r\n|1-2  | The ship gains four levels of system damage.|\r\n\r\n## The Environment\r\nStarship exploration involves delving into the potentially dangerous, uncharted territory. The rules in this section cover some of the most important ways in which adventurers, and their ships, interact with the environment. The Dungeon Master's Guide has rules covering more unusual situations.\r\n\r\n### Vision and Light\r\nThe most fundamental tasks of starfaring&mdash;noticing danger, finding hidden objects, and hitting an enemy ship in combat, to name just a few&mdash;rely heavily on a ship's ability to see. Darkness and other effects that obscure vision can prove a significant hindrance.\r\n\r\nA given area might be lightly or heavily obscured. In a **lightly obscured** area, such as dim light, dust clouds, or electrical storms, ships have disadvantage on Wisdom (Scan) checks.\r\n\r\nA **heavily obscured** area-such as darkness, opaque gases, or dense asteroids-blocks vision entirely. A ship in a heavily obscured area effectively suffers from the blinded condition (see appendix A).\r\n\r\nThe presence or absence of light in an environment creates three categories of illumination: bright light, dim light, and darkness.\r\n\r\n**Bright light** lets most ships see normally. \r\n\r\n**Dim light**, also called shadows, creates a lightly obscured area. An area of dim light is usually a boundary between a source of bright light, and surrounding darkness. \r\n\r\n**Darkness** creates a heavily obscured area. \r\n\r\n#### Blindsight\r\ncrewmembers on a starship equipped with an enhanced scanner (Scanner, Premium) can perceive their surroundings without relying on sight, within a specific radius. \r\n\r\n#### Truesight\r\nMore advanced scanners (Scanner, Renowned) offer truesight, allowing crewmembers to detect starships that are completely invisible. Truesight allows a starship's scanners to automatically detect visual illusions and succeed on saving throws against them.\r\n\r\n## Recharging and Refitting  \r\nOver time, wear and tear on a ship accrues, forcing adventurers to temporarily abandon their pursuits to recharge and refit their ships. \r\n\r\n### Recharging\r\nAs long as a ship has the requisite crew, they can conduct makeshift repairs and the systems of the ship can reset and recharge themselves without the ship having to dock. Recharging the ship requires a workforce as shown in the **[Starship Size Equipment Workforce](#Starship%20Size%20Equipment%20Workforce)** table on page 79, and takes 1 hour.\r\n\r\nIf conducting repairs is interrupted for more than an hour, the workforce must begin recharging again for the ship to gain any benefit from it.\r\n\r\nOnce recharging is completed, a crewmember can attempt to spend one or more Hull Dice by making an Intelligence (Mechanic's kit) check. On a roll of 10 or less, you roll the Hull Die twice and take the lesser amount. On a roll of 11 to 20, you roll the Hull Die normally. On a roll of 21 or higher, you roll the Hull Die twice and take the greater amount.\r\n\r\nWhenever a Hull Die is spent to regain hull points, a crewmember rolls the die and adds the ship's Constitution modifier to it. The starship regains hull points equal to the total. The crew can decide to spend an additional Hull Die after each roll.\r\n\r\nAdditionally, all shield points and half of the ship's Shield Dice are restored at the end of the recharging period.  \r\n\r\n### Refitting\r\nRefitting is a period of extended downtime that requires docking at a spaceport or shipyard. Refitting costs a number of credits proportionate to the number of hull dice missing. The amount is 100 credits per hull die multiplied by the **[Starship Size Upgrade Cost](#Starship%20Size%20Upgrade%20Cost)** table on page 22. Refitting requires a workforce as shown in the **[Starship Size Upgrade Workforce](#Starship%20Size%20Upgrade%20Workforce)** table on page 22, and takes an amount of time depending on the size of starship, as shown in the **[Starship Size Refitting Time](#Starship%20Size%20Refitting%20Time)** table below.  \r\n\r\nAt the end of refitting, a ship regains all lost hull and shield points, expended Hull Dice and Shield Dice, and its system damage level is reduced by 1.\r\n\r\n#### Starship Size Refitting Time\r\n|Starship Size|Time|\r\n|:--|--:|\r\n|Tiny|4 hours|\r\n|Small|8 hours|\r\n|Medium|1 day|\r\n|Large|3 days|\r\n|Huge|1 week|\r\n|Gargantuan|1 month|\r\n\r\n#### Repairing the \"Used\" Condition\r\nIf the ship was \"used\" at the start of refitting, the foremost mechanic can make a DC 30 Intelligence (Mechanic's Kit) check. On a success, the cost of refitting is increased, and the ship is no longer \"used\".\r\n\r\nRepairing \"used\" costs a number of credits proportionate to the ship's maximum number of hull points. The amount is 10 credits per hull point multiplied by the **[Starship Size Upgrade Cost](#Starship%20Size%20Upgrade%20Cost)** table on page 22. \r\n\r\n### Primary System Failure\r\nIn some instances, primary systems can experience failure. When primary systems fail, an integrated emergency back up will activate. This back up can continue running the starship, provided there is adequate fuel, for 24 hours. At the end of the 24-hour period, primary systems fail, causing all electrical systems, including life support to fail. \r\n\r\nOnce a ship's primary systems fail, all functionality of the ship ceases to function. If the ship can be towed to a shipyard, it can still be repaired, however.\r\n\r\n#### Repairing Primary Systems\r\nIf the ship's primary systems had failed at the start of refitting, they can be repaired during that refitting, increasing the cost but not the time.\r\n\r\nRepairing primary systems costs a number of credits proportionate to the ship's maximum number of hull points. The amount is 10 credits per hull point multiplied by the **[Starship Size Upgrade Cost](#Starship%20Size%20Upgrade%20Cost)** table on page 22. ","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"8","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Appendix A: Conditions","chapterNumber":11,"contentMarkdown":"# Appendix A: Conditions\r\n\r\nConditions alter a starship's capabilities in a varietyof ways and can arise as a result of a power, a starship feature, or some other effect. Most conditions, such as blinded, are impairments, but a few, such as invisible, can be advantageous.\r\n\r\nA condition lasts either until it is countered or for a duration specified by the effect that imposed the condition. \r\n\r\nIf multiple effects impose the same condition on a starship, each instance of the condition has its own duration, but the condition's effects don't get worse. A starship either has a condition or doesn't.\r\n\r\nAny conditions that reference the ship also apply to any crew members when they take actions involving the ship. For instance, an ionized ship has disadvantage on attack rolls. Consequently, a deployed gunner would have disadvantage on attack rolls with a ship weapon, but not with their own weapons.\r\n\r\nThe following definitions specify what happens to a ship while it is subjected to a condition.\r\n\r\n#### Blinded\r\n- A blinded ship can't see and automatically fails any ability check that relies on sight or the ship's sensors.\r\n- Attack rolls against the ship have advantage, and the ship's attack rolls have disadvantage.\r\n\r\n#### Disabled\r\n- A disabled ship can't communicate with external sources more than 1,000 feet away.\r\n- A disabled ship can't take actions or reactions.\r\n- A disabled ship has 4 [Slowed Level](#Slowed%20Level)s.\r\n\r\n#### Ionized\r\n- An ionized starship has disadvantage on attack rolls and ability checks.\r\n\r\n#### Invisible\r\n- An invisible starship is impossible to see without the aid of powers or a special sense. For the purpose of hiding, the starship is heavily obscured. The starship's location can be detected by any noise it makes or any tracks it leaves.\r\n- Attack rolls against the ship have disadvantage, and the ship's attack rolls have advantage.\r\n\r\n#### Shocked\r\n- A shocked starship can't take reactions.\r\n- On its turn, a crewmembers on a shocked starship can take either an action or a bonus action, but not both.\r\n\r\n#### Slowed\r\nSome abilities, effects, and hazards can lead to a special condition called slowed. Slowed is measured in four levels. An effect can give a ship one or more levels of slowed, as specified in the effect’s description.\r\n\r\nIf an already slowed ship suffers another effect that causes it to be slowed, its current [Slowed Level](#Slowed%20Level) increases by the amount specified in the effect’s description.\r\n\r\nAn effect that removes slowed reduces its level as specified in the effect’s description, with all slowed effects ending if a ship’s [Slowed Level](#Slowed%20Level) is reduced below 1.\r\n\r\n##### Slowed Level\r\n|Level\t|Effect|\r\n|:--:|:--:|\r\n|1\t|Speed reduced by 150 feet|\r\n|2\t|Speed reduced by 250 feet|\r\n|3\t|Speed reduced by 300 feet|\r\n|4\t|Speed reduced to 0, and can’t benefit from any bonus to speed|\r\n\r\n#### Stalled\r\n- A stalled ship is disabled (see the condition).\r\n- Any active features controlled by the ship, such as a Tractor Beam or Gravity Well Projector, automatically end.\r\n- The ship automatically fails Strength and Dexterity saving throws.\r\n- Attack rolls against the ship have advantage.\r\n\r\n#### Stunned\r\n- A stunned ship has 4 [Slowed Level](#Slowed%20Level)s.\r\n- The ship automatically fails Strength and Dexterity saving throws.\r\n- Attack rolls against the ship have advantage.\r\n\r\n#### System Damage\r\nSome special abilities, or when certain conditions are met, cause a ship to sustain a special condition called system damage. such as and the long-term effects of freezing or scorching temperatures, can lead to a special condition called system damage. System damage is measured in six levels. An effect can give a starship one or more levels of system damage, as specified in the effect's description.\r\n\r\n|Level|Effect|\r\n|:--:|:--|\r\n|1|Disadvantage on ability checks|\r\n|2|1 [Slowed Level](#Slowed%20Level)|\r\n|3|Disadvantage on attack rolls and saving throws|\r\n|4|Hit point maximum, shield point maximum, and shield regeneration rate halved|\r\n|5|Ship becomes permanently \"used\" (see the condition)|\r\n|6|Ship suffers catastrophic power failure. All primary systems fail.|\r\n\r\nIf a ship with system damage suffers another effect that causes system damage, its current level of system damage increases by the amount specified in the effect's description.\r\nA ship suffers the effect of its current level of system damage as well as all lower levels. For example, a ship suffering level 2 system damage 1 [Slowed Level](#Slowed%20Level) and disadvantage on ability checks.\r\n\r\nAn effect that removes system damage reduces its level as specified in the effect's description, with all system damage effects (except for \"used\") ending if a ship's system damage level is reduced below 1.\r\n\r\nFinishing maintenance reduces a ship's system damage level by 1.\r\n\r\n#### Tractored\r\n- A tractored ship has 4 [Slowed Level](#Slowed%20Level)s.\r\n- The condition ends if the tractoring ship is disabled (see the condition).\r\n- The condition also ends if an effect removes the tractored ship from the reach of the tractoring ship or effect.\r\n\r\n#### Used\r\n- A used starship's value is reduced by half.\r\n- When a deployed crew member on a used starship rolls a 1 on an ability check, attack roll, or saving throw, they must make a destruction saving throw. If the roll is 10 or higher, they succeed. On a failure, the ship suffers 1 level of system damage.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"11","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Changelog","chapterNumber":99,"contentMarkdown":"# Changelog\r\n\r\n### 3/16/2021\r\nThere is no changelog, since almost the entirety of the book has been updated in some fashion.\r\n\r\n### 11/26/2019\r\n\r\n#### Throughout\r\n- Removed all references to book \"parts\", instead referring to the proper chapters.\r\n\r\n#### Chapter 1\r\n- Corrected Skillful Gunner to Precision Gunner when choosing Han's venture.\r\n\r\n#### Chapter 2\r\n- Added clarification to all of the Versatile deployment features.\r\n- Corrected System Disruption to apply to saving throws, not damage rolls.\r\n\r\n#### Chapter 3\r\n- Gargantuan Tier 2 Command Ship feature changed Scanned to Tractor Beam\r\n- Large Tier 2 Concentrated Fire adjusted to align with saving throws instead of attack rolls.\r\n- Medium Tier 4 Adaptive Armor corrected to actually be a good thing.\r\n- New roles have been added to each ship size except for Tiny.\r\n- Gargantuan Blockade Ship Role Mastery adjusted to not require the second tier feature.\r\n\r\n#### Chapter 4\r\n- You can now have more than 10 of any single suite. Don't ask.\r\n- Gravity Well Projector adjusted.\r\n- Tier requirement of Backup Hyperdrive removed.\r\n- Direct Controller damage component removed.\r\n- Explosive Payload changed to align with the change to ship weapon damage rolls.\r\n- Removed penalties from the Crew Slot modifications.\r\n\r\n#### Chapter 6\r\n- Storming Gunner changed to align with the change to ship weapon damage rolls.\r\n- Precision Gunner changed to align with the change to ship weapon damage rolls.\r\n\r\n#### Chapter 7\r\n- Removed the \"if your turning speed would be reduced to less than 50 feet instead increases your speed\" from Dexterity. This will still apply to features.\r\n- Adjusted ship weapons to use Strength for their damage modifier, instead of Dexterity.\r\n\r\n#### Chapter 9\r\n- Adjusted ship weapons to use Strength for their damage modifier, instead of Dexterity.\r\n\r\n#### And, as always\r\n- Minor text fixes.\r\n\r\n### 6/25/2019\r\n\r\n#### Chapter 4\r\n- Changed size adjustment for ships to constructs from three to four.\r\n- New Engineering System: External Docking System.\r\n\r\n#### Chapter 9\r\n- Added some clarification to Destruction saving throws.\r\n\r\n#### And, as always\r\n- Minor text fixes.\r\n\r\n### 5/14/2019\r\n\r\n#### Chapter 3\r\n- Adjusted the ability score maximums for ships, determined by their size.\r\n\r\n#### Chapter 4\r\n- Added clarification for what happens when you cap out an ability score.\r\n- Added rules for removing a ship's tier.\r\n\r\n#### And, as always\r\n- Minor text fixes.\r\n\r\n### 4/2/2019\r\n\r\n#### Chapter 4\r\n- New operation system: secondary transponder code.\r\n- New suite system: droid storage\r\n\r\n#### Chapter 9\r\n- Clarified that the weapon save DC is also used to calculate for primary and secondary weapons on Large and larger ships.\r\n\r\n### 3/5/2019\r\n\r\n#### Chapter 3\r\n- Droid Brain added to Stock Modifications for Tiny ships.\r\n- The free modifications granted to ships at tier 0 relabeled \"Stock Modifications\".\r\n\r\n#### Chapter 4\r\n- Added proficiency caveats to system types.\r\n- New engineering system: nano-droid distributor.\r\n- New operation system: shield disruptor.\r\n- New suite system: slave pens.\r\n- New universal system: ejection pod.\r\n- Proficiency chip series replaced with droid brain.\r\n- Updates to central computer series of universal systems.\r\n- Some modifications reworked.\r\n\r\n#### Chapter 6\r\n- Added a clarification regarding forgoing proficiency bonus and expertise.\r\n\r\n#### Chapter 8\r\n- Added more description to deployment capacities for ships.\r\n\r\n#### Chapter 9\r\n- Help action relabeled to Direct, since the action has been changed from the ground game. \r\n\r\n### 2/26/2019\r\n\r\n#### Throughout\r\n- Page numbers are now locked in. That means, while the content of a few pages will change, the overall structure of the book won't going forward.\r\n- You will see a number of pages that are blank. This is deliberate, as a part of the locked in pages.\r\n\r\n#### Chapter 2\r\n- Some features shuffled around. A few rewritten.\r\n\r\n#### Chapter 3\r\n- Some features shuffled around. A few rewritten.\r\n- New Variant for Space Stations on page 34.\r\n\r\n#### Chapter 4\r\n- Lots of new and rebalanced modifications.\r\n\r\n#### Chapter 5\r\n- Removed the cost disparity for Huge Weapons. The math now follows the same for all other equipment.\r\n- Changed Primary Weapons on Large and larger ships to use Dex saving throws.\r\n\r\n#### Chapter 6\r\n- Ventures have been smoothed out.\r\n\r\n#### Chapter 7\r\n- Clarified that Turning Speed can not be less than 50 feet.\r\n\r\n#### Chapter 8\r\n- Added rules for Landing Gear\r\n\r\n#### Chapter 9\r\n- Some features rebalanced or reworded.\r\n\r\n#### Chapter 10\r\n- This chapter is still incomplete. The math for encounter building needs to be reverse engineered from ship statblocks.\r\n\r\n#### Appendix B\r\n- This appendix will feature sample starships, one for each size, with additional explanations about how some numbers are derived.\r\n\r\n### 2/19/2019\r\n\r\n#### Affected Pages\r\n- A shit load\r\n- You're still going to see \"found on page \\_\\_\\_\". Page numbers aren't finalized yet so I haven't completed these.\r\n\r\n#### Chapter 2\r\n- Expanded Ventures to one each level instead of every other.\r\n- Shuffled some features around and added new ones.\r\n- More memes\r\n\r\n#### Chapter 3\r\n- Took out the Stock Starships, which will go to the Starship appendix for statblocks when ready.\r\n- Added a page for Tiny starships for those who wanted one.\r\n- Updated the Tier 0 Starship Features to include free Tier 0 Modifications (discussed in chapter 4)\r\n- Added some (but not all) flavor.\r\n\r\n#### Chapter 4\r\n- Added rules to change Saving Throws if players wanted to, as well as free tier 0 modifications when constructing brand new ships.\r\n- Lots of new and reworked modifications.\r\n- Cantina modification split into Recreation and Mess Hall (since I know people are going to ask where it went).\r\n\r\n#### Chapter 5\r\n- New Quaternary Ammunition: EMP Bomb\r\n- Added two more hyperdrive classes\r\n- Added rules for Primary Systems (electricity and life support)\r\n\r\n#### Chapter 6\r\n- Moved Gunning Style/Masteries here.\r\n- Lots of new ventures, and lots of space/requests for recommendations.\r\n\r\n#### Chapter 8\r\n- Added rules for Movement in Zero Gravity\r\n- Clarifed the \"deployed\" keyword\r\n- Moved System Damage to the Conditions appendix and changed it to be an analogue for Exhaustion mechanics\r\n- Added rules for repairing Primiary Systems and the \"Used\" condition\r\n\r\n#### Chapter 9\r\n- New Pilot action: Evade\r\n- Adjusted the Patch action\r\n- Changed Destruction saving throws to implement the new System Damage condition\r\n\r\n#### Appendix A\r\n- I realize the page number is wrong\r\n- New conditions","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"99","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Combat","chapterNumber":9,"contentMarkdown":"# Chapter 9: Combat\r\n\r\nAs the light freighter exits hyperspace, it finds itself in the middle of a snubfighter skirmish. Immediately, the pilot begins evasive maneuvers while hollering for help. One crewmember hops into the copilot seat while two more run to opposite sides of the craft to man the gun batteries. Three of the snubfighters&mdash;now identified as TIE fighters&mdash;turn towards this new opponent and open fire, but the blasts dissipiate ineffectually on the freighter's shields. The freighter's two gunners, now in place, open fire on the assaulting craft. One takes the blasts directly to the cockpit and explodes in a blaze, while the other is hit on a solar panel and spins off out of control into the distance. The third attempts to pass overhead, but the copilot takes a shot from the freighter's slaved railgun and destroys the fighter in a single stroke.\r\n\r\nThis chapter provides the rules you need for your characters and their craft to engage in space combat, whether it is a brief skirmish or an extended conflict. Throughout this chapter, the rules address you, the player or GM. The GM controls all the other ships and nonplayer characters involved in space combat, and each other player controls either their own ship or a function of your ship. \"You\" can also mean the character or ship you control.\r\n\r\n## The Order of Combat\r\nA typical combat encounter is a clash between two sides, a flurry of cannon shots and ship maneuvers. The game organizes the chaos of combat into a cycle of rounds and turns. A **round** represents about 6 seconds in the game world. During a round, each participant in a battle takes a **turn.** The order of turns is determined at the beginning of a combat encounter, when everyone rolls initiative. Once everyone has taken a turn, the fight continues to the next round if neither side has defeated the other.\r\n\r\n### Surprise\r\nAn assault carrier exits hyperspace and immediately begins firing on its prey. Fighters rapidly exit bays to support and protect the craft. Their opponents, caught unawares, are slow to respond and take significant damage before mounting their defense. In this situation, one side of the battle gained surprise over the other.\r\n\r\nThe GM determines who might be surprised. If neither side tries to be stealthy, they automatically notice each other. Otherwise, the GM compares the Dexterity (Stealth) checks of anyone hiding with the passive Wisdom (Perception) score of each creature on the opposing side. Any ship that doesn't notice a threat is surprised at the start of the encounter.\r\n\r\nIf you're surprised, you can't move or take an action on your first turn of the combat, and you can't take a reaction until that turn ends. A member of a group can be surprised even if the other members aren't.\r\n\r\n> ##### Combat Step By Step\r\n> **1. Determine surprise.** The GM determines whether\r\nanyone involved in the combat encounter is surprised.\r\n> **2. Establish positions.** The GM decides where all\r\ncharacters and ships are located.\r\n> **3. Roll initiative.** Every PC on a ship rolls initiative\r\nnormally, and the lowest initiative on each ship sets\r\nthe initiative for that ship. \r\n> **4. Start a ship turn.** When your ship activates based on the initiative order, the ship's reactor replenishes power dice and the crew determines how these dice are distributed through the power coupling. The crew should also decide if they want to activate their shield generator's regeneration at the start of the ship's turn. All PCs on a ship then take their\r\nindividual turns on their ship's turn in an order agreed\r\nupon by the crew for that ship turn.  In case of\r\ndisputes, the helm has final say.  The order of character\r\nturns on a ship's turn may change from round to\r\nround.\r\n> **5. Take turns.** Each ship in the battle takes a\r\nturn in ship initiative order.\r\n> **6. Begin the next round.** When every ship involved in the\r\ncombat has had a turn, the round ends. Repeat step 5\r\nuntil the fighting stops.\r\n\r\n### Your Role On Your Turn\r\nAll PCs on a ship take their individual turns on their ship’s turn in an order agreed upon by the crew for that ship turn. The crew should also decide if they want to activate their shield generator's regeneration at the start of the ship turn. In case of disputes, the crewmember at the helm has final say. This is also when the ship's reactor would replenish power dice to its coupling. The order of character turns on a ship’s turn may change from round to round.\r\n\r\nYour abilities depend on where you are deployed during space combat. In a snubfighter, you control all aspects of your craft: movement and maneuvering, weapons, operation, and engines. In a larger craft, however, only one player can take helm actions.  \r\n\r\nThe \"Movement and Position\" section later in this chapter gives the rules for your move.\r\n\r\n#### Actions\r\nYou may take one action on your turn, and any\r\naction taken by a player with your ship can\r\nonly be taken once per round unless otherwise stated. For example, although\r\ntwo different crewmembers could both cast the same\r\nforce power or make an ability check with the Medicine\r\nskill, they could not both take an action granted by a ship modification or the Boost Engines action,\r\ndescribed below. Only the crewmember at the helm can take helm\r\nactions, but all other actions may be taken by anyone\r\non the ship as logic dictates.\r\n\r\n#### Bonus Actions\r\nVarious class or deployment features, powers, and other abilities let you take an additional action on your turn called a bonus action. You can only take a bonus action if some feature gives you one, and you can only take one bonus action on each of your turns.\r\n\r\n#### Other Activity on Your Turn\r\nYour turn can include a variety of flourishes that require neither your action nor your move.\r\n\r\nYou can communicate however you are able as you take your turn.\r\n\r\nYou can also interact with one object or feature of the environment for free, during either your move or your action.\r\n\r\n#### Reactions\r\nCertain features allow you to take a reaction. A reaction is an instant response to a trigger of some kind, which can occur any turn.\r\n\r\nWhen you take a reaction, you can't take another one until the start of your next turn. If the reaction interrupts another creature's turn, that creature can continue its turn right after the reaction.\r\n\r\n## Movement and Position\r\nIn combat, ships are in constant motion, often using movement and position to gain the upper hand.\r\n\r\nOn your turn, the crewmember at the helm can move the ship a distance up to its speed. The ship can use as much or as little of its speed as desired, following the rules here.\r\n\r\nStarships come equipped with two speeds: **flying speed** and **turning speed**. \r\n\r\n### Facing\r\nAll Vehicles have a facing, and can normally only move in the direction they are facing (forward) or rotate about their center.\r\n\r\n### Flying Speed\r\n**Flying speed** is how far your ship can travel in a single round. It is expressed in feet. For every foot your ship travels forward, it expends one foot from its speed. \r\n\r\nA ship's unmodified flying speed is determined in **Chapter 3: Starships** by the Role selected for the ship at construction.\r\n\r\n### Turning Speed\r\n**Turning speed** determines how maneuverable your ship is. In order for your ship to rotate 90 degrees, you must spend an amount of your **flying speed** equal to your **turning speed**. For instance, if your ship has a **flying speed** of 350 feet, and a **turning speed** of 100 feet, you can travel 150 feet in a straight line, spending 150 feet of your **flying speed**, and then turn 90 degrees to starboard, spending 100 feet of your **flying speed**, leaving 100 feet of movement remaining.\r\n\r\nTypically games are played with turning limited to 90 degree increments, but, if your group has the desire and capability to track smaller angles, this is allowed.\r\n\r\nA ship can turn more (or less, if your group agrees) than 90 degrees on its turn, by spending a proportionate amount of movement.\r\n\r\nIf a ship's turning speed exceeds its flying speed, that ship cannot turn 90 degrees, in combat conditions, absent another effect modifiying the ship's turning speed and/or flying speed or the Hard Turn action.\r\n\r\nA ship's unmodified turning speed is determined in **Chapter 3: Starships** by the Role selected for the ship at construction.\r\n\r\n### Breaking Up Your Move\r\nThe crewmember at the helm can break up your ship's movement on its turn, using some flying speed before and after various crew actions. For example, if your ship has a speed of 300 feet, it can move 100 feet, two players can take actions, and then it can move 200 feet.\r\n\r\n#### Moving Between Attacks\r\nIf you take an action that includes more than one ship attack, you can break up your movement even further by moving between those attacks. For example, a ship that can make two attacks and that has a speed of 300 feet could move 100 feet, make an attack, move 200 feet, and then attack again.\r\n\r\n### Difficult Terrain\r\nCombat rarely takes place in featureless terrain. Asteroid fields, mountain ranges, other ships&mdash;the setting of a typical fight contains difficult terrain.\r\n\r\nEvery foot of movement in difficult terrain costs 1 extra foot. This rule is true even if multiple things in a space count as difficult terrain.\r\n\r\n### Moving Around Other Ships\r\nYou can move through a ship’s space. However, you can end your turn on a ship’s space only if the ship is at least two sizes larger or smaller than you. Another ship’s space is difficult terrain for your ship.\r\n\r\n> #### Variant: Playing on a Grid\r\n> If you play out a combat using a square grid and miniatures or other tokens, follow these rules.\r\n> ***Squares.*** Each square on the grid represents 50 feet.\r\n> ***Facing.*** Each ship has a facing: the direction to the adjacent square the vehicle is pointing toward. This means that a ship in a given square has eight possible facings. \r\n> ***Speed.*** Rather than moving foot by foot, move square by square on the grid. This means you use your speed in 50-foot segments. This is particularly easy if you translate your speed into squares by dividing the speed by 50. For example, a speed of 300 feet translates into a speed of 6 squares.\r\n> If you use a grid often, consider writing your speed in squares on your character sheet.\r\n> ***Entering a Square.*** To enter a square, you must have at least 1 square of movement left, unless the square is diagonally adjacent to your square (see below). \r\n> ***Corners.*** Diagonal movement can't cross the corner of an asteroid or other terrain feature that fills its space.\r\n> ***Ranges.*** To determine the range on a grid between two entities, start counting squares from a square adjacent to one of them and stop counting in the space of the other one. Count by the shortest route.\r\n> ***Diagonals.*** When measuring range or moving diagonally, the first diagonal square counts as 50 feet, but the second diagonal square counts as 100 feet. This pattern of 50 feet and then 100 feet continues whenever you're counting diagonally, even if you move horizontally or vertically between different bits of diagonal movement. For instance, a ship might move one square diagonally (50 feet), then three squares straight (150 feet), and then another square diagonally (100 feet) for a total movement of 300 feet.\r\n\r\n### Ship Size\r\nEach ship takes up a different amount of space. The Size Categories table shows how much space a ship of a particular size controls in combat. Objects sometimes use the same categories.\r\n\r\n#### Size Categories\r\n|Size|Space|\r\n|:--|:--|\r\n|Tiny|Up to 25 ft.|\r\n|Small|25 to 50 ft.|\r\n|Medium|50 to 250 ft.|\r\n|Large|250 to 2,500 ft.|\r\n|Huge|2,500 to 10,000 ft.|\r\n|Gargantuan|10,000 ft. or larger|\r\n\r\n> #### Variant: Sizes on a Grid\r\n> If you play out combat using a square grid and miniatures or other tokens, consider scaling down the sizes of ships. A Tiny or Small ship should take up 1 square, while a Medium ship takes up 2. A Large ship takes up 4 squares, a Huge 8, and a Gargantuan 16.\r\n\r\n#### Space\r\nA ship's space is the area in feet that it effectively controls in combat, not an expression of its physical dimensions. A typical Medium ship isn't 100 feet wide, for example, but it does control a space that wide.\r\n\r\n## Actions in Combat\r\nWhen you take your action on your turn, you can take one of the actions presented here; an action you gained from your class, specialization, or some other feature; an action granted by a ship modification; or an action that you improvise.\r\n\r\nWhen you describe an action not detailed elsewhere in the rules, the DM tells you whether that action is possible and what kind of roll you need to make, if any, to determine success or failure.\r\n\r\nActions possible by a given character in a given circumstance are determined by the GM as logic dictates.  For example, a snub-fighter control system allows for all actions to be useable from the cock-pit.  In Large and larger ships, players typically control a crew that carries out their actions, and, therefore, need not worry about which precise equipment is right in front of them.  In medium ships, things are most complicated.  Only one player may normally take helm\r\nactions: the player in the pilot seat. However, if\r\ndisabled, a co-pilot may be able to immediately take\r\nover without switching stations. Typically, other crew stations are general purpose, allowing\r\nany non-restricted actions to be taken at them.  \r\n\r\n### Boost\r\nYou can attempt to boost a function of your ship. Each function can only be boosted once on each of the ship's turns, and each time you try to boost a function of the ship after the first, the DC increases by 5, cumulatively, until the start of your next turn.\r\n\r\n#### Boost Engines\r\nYou can attempt to boost your speed.  When you take the Boost Engines action, you make a DC 10 Strength (Boost) check. On a success you increase your speed by 50 until the end of your ship's next turn.\r\n\r\n#### Boost Shields\r\nYou can attempt to boost your shields. When you take the Boost Shields action, you make a DC 10 Strength (Boost) check.  On a success, you roll a shield die, without expending it, and gain temporary shield points equal to the result that last until the start of your ship's next turn.\r\n\r\n#### Boost Weapons\r\nYou can attempt to boost your weapon output. When you take the Boost Weapons action, the next time this turn your ship would deal damage, you make a DC 10 Strength (Boost) check.  On a success, you have advantage on the damage roll. \r\n\r\n### Detect\r\nWhen you take the Detect action, you devote your attention to finding something. Depending on the nature of your detection, the DM might have you make a Wisdom (Scan) check or an Intelligence (Probe) check. \r\n\r\n### Direct\r\nWhen you take the Direct action, the creature gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn. Alternatively, you can direct a friendly creature that can hear you in attacking another target. If your ally attacks the target before the start of your next turn, the first attack roll is made with advantage.  The Direct action can be taken multiple times on a ship's turn.\r\n\r\n### Fire\r\nThe most common action to take in combat is the Fire\r\naction. With this action, you can make an attack (or\r\nattacks) with one ship weapon. See the\r\n\"Making an Attack\" section for the rules that govern\r\nattacks. The Fire action may be taken multiple times\r\non a ship's turn, but normally only once per weapon. A crewmember Firing from the helm has disadvantage on attack\r\nrolls with primary and secondary weapons.\r\n\r\n> #### Want more Crunch?\r\n> Although outside the scope of these rules, some play groups may want a more lore-friendly take on ship combat where only certain actions (whether base actions, actions given by ship modifications, or actions gained through deployment ranks) can be taken at certain ship stations.  If so, players and GMs are encouraged to agree to a ship layout that includes these stations along with a list of options that are either allowed or disallowed at that station.  A separate battle-mat can be used to track PC location on a ship during ship combat, if desired.\r\n\r\n### Helm\r\nWhen you take the Helm action, you choose from the following options to utilize. Only one Helm action can be taken per turn.\r\n\r\n#### Attack Run\r\nWhen you move at least 150 feet towards a target, you may declare an Attack Run as an action. You must have a clear path towards your target, and nothing should hinder your path (such as difficult terrain or obstacles). If you finish this movement within range of your target, you may follow it with one of these options:\r\n\r\n**Fire.** You may make a ship weapon attack from a forward-facing limited arc without suffering the normal disadvantage. If you attack with a tertiary or quaternary weapon, the attack deals additional damage equal to the distance of your attack run divided by 50, up to your ship's Strength modifier (minimum of 1). \r\n\r\n**Ram.** You may make a Ram attempt with advantage on your Strength (Ram) check.  If you succeed, the target ship takes additional damage equal to the distance of your Attack Run divided by 50, up to your ship's Constitution modifier (minimum of +1). \r\n\r\n#### Conceal\r\nWhen you take the Conceal action, you make a Dexterity (Hide) check in an attempt to Conceal your ship, following the rules in chapter 7 for hiding. If you succeed, you gain certain benefits, as described in the “Unseen Attackers and Targets” section later in this chapter.\r\n\r\n#### Dogfight\r\nWhen you engage a single enemy, you duck and weave, vying for a good shot while avoiding theirs.  You choose a target and make an opposed Dexterity (Maneuvering) check.  On a success, you cause the next attack made against your ship by the target to suffer from disadvantage, but you grant the next attack made against your ship by a different target advantage.  Additionally, you can perform a primary or tertiary weapon attack from a forward facing limited firing arc against that ship without suffering the normal disadvantage.\r\n\r\n#### Evade\r\nWhen you take the Evade action, you focus entirely on avoiding attacks. Until the start of your next turn, any Attack roll made against you has disadvantage if you can see the attacker on your instruments, and you make Dexterity Saving Throws with advantage.  \r\n\r\nThis action affects your entire ship: any ability check or\r\nattack made by your ship or anyone on it has\r\ndisadvantage until the end of your ship's next turn. The effects of Evade end if you are Incapacitated or if your speed drops to 0.\r\n\r\n#### Fly\r\nWhen you take the Fly action, you gain extra Movement for the current turn. The increase equals your speed, after applying any modifiers. \r\n\r\nWith a speed of 300 feet, for example, your ship can move up to 600 feet on its turn if you Fly. Any increase or decrease to your speed changes this additional Movement by the same amount. If your ship's speed of 300 feet is reduced to 150 feet, for instance, your ship can move up to 300 feet this turn if you Fly.\r\n\r\nThis action affects your ship's ability to stay on target: any ability check or attack made by your ship or anyone on it has disadvantage until the end of your ship's next turn.\r\n\r\n#### Harass \r\nYou can harass an enemy and lock them into a series of close-combat maneuvers in order to prevent their escape.  When you take the harass action, make an opposed Dexterity (Maneuvering) check against a target within one size category of you and within normal range of at least one of your forward facing primary weapons. This weapon cannot be Fired this turn.  On a success, if the target voluntarily leaves it's square before the beginning of your next turn, it takes damage as though it suffered a critical hit with the primary weapon used to harass.\r\n\r\n#### Hard Turn\r\nWhen you take the Hard Turn action, you coax your ship into a tight maneuver, turning your ship 90 degrees without expending any of your flying speed.\r\n\r\n#### Ram \r\nYou can attempt to ram another ship while flying through its space. When you take the ram action, you make a Strength (Ram) check opposed by the target's Dexterity (Maneuvering) check. On a failed check the ramming action fails.  On a success, both you and the target ship take kinetic damage equal to two of your ship's Hull Dice + your ship's Strength modifier. If your ship has shield points remaining, your ship instead takes half this damage. \r\n\r\n### Interfere\r\nYou can attempt to interfere with another creature within 1,000 feet, in the attempt of a task. When you take the Interfere action, you make a Charisma (Interfere) check contested by the target's Wisdom (Scan) check. If you succeed, the subject has disadvantage on the next ability check or attack roll it makes before the start of your next turn. The Interfere action can be taken multiple times on a ship's turn.\r\n\r\n### Patch\r\nYou can attempt to patch up damage a ship has taken, using one of its Hull Dice. When you take the Patch action, you make a Constitution (Patch) check (DC = 10 or half the ship's missing hull points, whichever number is higher). On a failure, you roll the Hull Die twice and take the lesser amount. On a success you roll the Hull Die normally. The Patch action can be taken multiple times on a ship's turn.\r\n\r\n### Regenerate Shields\r\nYou can attempt to regenerate your shields faster, spending one of your Shield Dice. When you take the Regenerate Shields action, you make a Strength (Boost) check (DC = 10 or half the ship's missing shield points, whichever number is higher). On a failure, you roll the Shield Die twice and take the lesser amount. On a success you roll the Shield Die normally. The Regenerate Shields action can only be taken once each ship turn.\r\n\r\n## Making an Attack\r\nWhether you're shooting your laser cannons or a railgun, an attack has a simple structure.\r\n\r\n**1. Choose a target.** Pick a target within your attack's range: a ship, an object, or a location.\r\n\r\n**2. Determine modifiers.** The GM determines whether the target has cover and whether you have advantage or disadvantage against the target. In addition, powers, special abilities, and other effects can apply penalties or bonuses to your attack roll.\r\n\r\n**3. Resolve the attack.** You make the attack roll. On a hit, you roll damage, unless the particular attack has rules that specify otherwise. Some attacks cause special effects in addition to or instead of damage. If there's ever any question whether something you're doing counts as an attack, the rule is simple: if you're making an attack roll, you're making an attack.\r\n\r\n### Attack Rolls\r\nWhen you make an attack with a primary or secondary weapon, your attack roll determines whether the attack hits or misses. To make an attack roll, roll a d20, add your proficiency bonus (if you have at least one deployment rank), the ship's Wisdom modifier, and any weapon-specific bonuses or penalties. If the total of the roll plus modifiers equals or exceeds the target's Armor Class (AC), the attack hits. \r\n\r\nShips are always considered proficiently equipped with their properly-installed weapons.\r\n\r\n#### Rolling 1 or 20\r\nSometimes fate blesses or curses a gunner, causing the novice to hit and the veteran to miss. \r\n\r\nIf the d20 roll for an attack is a 20, the attack hits regardless of any modifiers or the target's AC. In addition, the attack is a critical hit, as explained later in this chapter.\r\n\r\nIf the d20 roll for an attack is a 1, the attack misses regardless of any modifiers or the target's AC.\r\n\r\n#### Range\r\nYou can make ranged attacks only against targets within a specified range.\r\n\r\nShip weaponry typically has two ranges. The value of these ranges depends on the type of weapon (primary, secondary, or tertiary), as described in Chapter 5.\r\n\r\n#### Ranged Attacks in Close combat\r\nAiming a ranged attack is more difficult when a foe is next to you. When you make a ranged attack with a ship weapon, a power, you have disadvantage on the attack roll if you are within 50 feet of your target.\r\n\r\n### Firing Arc\r\nShips have a firing arc, which is determined by the hardpoint on which they are mounted. Fixed hardpoints offer a limited firing arc, while turret hardpoints add an unlimited firing arc.\r\n\r\n#### Limited Firing Arc\r\nMany weapons, such as forward- or aft-mounted laser cannons, can only fire in a single direction, indicated by a limited firing arc. The available arcs are spaced 90 degrees from each other, are adjacent, and consist of: forward, aft, port, and starboard.\r\n\r\nWeapons with a limited firing arc only fire at targets within a 90 degree arc, with the ship's center point as the arc's vertex. A weapon's range within it's arc is measured from the outer edge of the ship it is mounted on, although primary weapons can still target and effect targets within a ship's own area, and treat this area as within the weapon's normal range.\r\n\r\n#### Unlimited Firing Arc\r\nWeapons with an unlimited firing arc can fire at any target within range and line of sight.\r\n\r\n### Saving Throws\r\nWhile many weapons utilize an attack roll, tertiary and quaternary weapons, as well as primary weapons on Huge and larger ships, instead call for a saving throw. When an ability grants advantage or disadvantage on an attack and the attack calls for a saving throw instead of an attack roll, unless stated otherwise, the saving throw is made with disadvantage or advantage, respectively. The saving throw is calculated as follows:\r\n\r\n___\r\n\r\n**Weapon save DC** = 8 + the crewmember's proficiency bonus (if at least rank 1) + the ship's Wisdom modifier\r\n\r\n___\r\n\r\n### Damage Rolls\r\nEach ship weapon specifies the damage it deals. You roll the damage die or dice, add the ship's Strength modifier to damage from primary and secondary weapons, and apply the damage to your target. Higher quality weapons, special abilities, and other factors can grant a bonus to damage.\r\n\r\n#### Critical Hits\r\nWhen you score a critical hit, you get to roll extra dice for the attack's damage against the target. Roll all of the attack's damage dice twice and add them together. Then add any relevant modifiers as normal. To speed up play, you can roll all the damage dice at once.\r\n\r\n#### DAMAGE TYPES\r\nStarship combat damage types are generally similar to ground combat damage types with a few minor differences.  Most notably, in space, no one can hear you scream (no sonic damage).\r\n\r\n***Acid.*** Acid damage is less effective against shields,\r\ndealing only half damage to shields.\r\n\r\n***Cold.*** Cold damage is less effective against shields,\r\ndealing only half damage to shields.\r\n\r\n***Energy.*** The most common type of damage, it deals\r\nnormal damage to hull and shields.\r\n\r\n***Fire.*** Fire damage is less effective against shields,\r\ndealing only half damage to shields.\r\n\r\n***Force.*** Deals normal damage to hull and shields.\r\n\r\n***Ion.*** Ion damage is less effective against hull,\r\ndealing only half damage to hull.  Ion damage cannot destroy ships.  Instead, ion damage that reduces a ship to zero hull points causes the ship to become disabled and stable.\r\n\r\n***Kinetic.*** Deals normal damage to hull and shields.\r\nAdditionally, when ships collide with each other or\r\ndebris, they deal kinetic damage.\r\n\r\n***Lightning.*** Lightning damage is less effective against hull,\r\ndealing only half damage to hull.\r\n\r\n***Necrotic.*** Necrotic damage is less effective against ships,\r\ndealing only half damage to hull and shields.\r\n***Poison.*** Poison damage is ineffective against ships, dealing no damage to hull or shields.\r\n\r\n***Psychic.*** Psychic damage is ineffective against ships, dealing no damage to hull or shields.\r\n\r\n***Sonic.*** Deals normal damage to hull and shields when in an atmosphere, but does no damage in space.\r\n\r\n***True.*** True damage is not dealt by any specific source. Instead, effects that prevent or redirect damage cannot be used to counter the damage caused by true damage.\r\n\r\n> #### Starship Resistances and Immunities\r\n> ***Hull Resistances:*** Ion, Lightning, Necrotic\r\n> ***Shield Resistances:*** Acid, Cold, Fire, Necrotic\r\n> ***Hull & Shield Immunities:*** Poison, Psychic\r\n\r\n### Damage Resistance and Vulnerability\r\nSome ships might have resistance or vulnerability to a damage type. If a ship has resistance to a damage type, damage of that type is halved against it. If a ship has vulnerability to a damage type, damage of that type is doubled against it.\r\n\r\nResistance, and then vulnerability, are applied after all other modifiers to damage. Multiple instances of resistance or vulnerability that affect the same damage type count only as one instance.\r\n\r\n## Cover\r\nAsteroids, ships, debris, and other obstacles can provide cover during combat, making a target more difficult to harm. A target can benefit from cover only when an attack or other effect originates on the opposite side of the cover.\r\n\r\nThere are four degrees of cover. If a target is behind multiple sources of cover, only the most protective degree of cover applies; the degrees aren't added together. For example, if a target is behind a ship that gives half cover and an asteroid that gives three-quarters cover, the target has three-quarters cover.\r\n\r\nA target with **one-quarter cover** has a +2 bonus to AC and Dexterity saving throws. A target has one-quarter cover if an obstacle blocks at least one-fourth of it.\r\n\r\nA target with **half cover** has a +3 bonus to AC and Dexterity saving throws. A target has half cover if an obstacle blocks at least half of it.\r\n\r\nA target with **three-quarters** cover has a +5 bonus to AC and Dexterity saving throws. A target has three-quarter cover if about three-quarters of it is covered by an obstacle. \r\n\r\nA target with **total cover** can’t be targeted directly by an attack or a power, although some powers can reach such a target by including it in an area of effect. A target has total cover if it is completely concealed by an obstacle.\r\n\r\n## Damage and Repairs\r\nSpace combat is lethal, and players always run a risk by engaging in it. A well placed cannon shot, a proton torpedo, or a seismic charge all have the potential to damage, or outright destroy, a ship.\r\n\r\n### Hull Points\r\nHull points represent a ship's hull integrity. A ship's current hull points (usually just called hull points) can be any number from the ship's hull point maximum down to 0. This number changes frequently as a ship takes damage or receives repairs.\r\n\r\nWhenever a ship takes damage, that damage is subtracted from its hull points. The loss of hull points has no effect on a ship's capabilities until the ship drops to 0 hull points.\r\n\r\n### Shield Points\r\nOften, a ship will have a buffer of energy called a shield. Ship's equipped in such a way of shield points in addition to hit points.\r\n\r\nWhenever a ship with shield points takes damage, the shield takes the damage instead. If this damage reduces the ship's shield points to 0, the hull takes any remaining damage. For instance, if your ship has 5 shield points and takes 7 damage, your ship loses its shield points and then take 2 damage to your ship's hull points.\r\n\r\n### Repairs\r\nDamage to hulls is permanent until repaired. Small repairs can happen while the ship is still in space, but significant repairs require docking in an appropriate location, as discussed in Chapter 8.\r\n\r\nWhen a ship receives repairs of any kind, hull points regained are added to its current hull points. A ship's hull points can't exceed its hull point maximum.\r\n\r\n### Dropping to 0 Hull Points\r\nWhen a ship is reduced to 0 hull points, it is either destroyed or disabled. If the ship is not instantly destroyed, the ship suffers 1 level of system damage and becomes disabled.\r\n\r\n> #### Describing the Effects of Damage\r\n> GMs describe hull point loss in different ways. When your ship's current hull point total is half or more of your hull point maximum, it typically shows no signs of damage. When it drops below half its hull point maximum, it show signs of wear, such as electrical fires or dislodged machinery. An attack that reduces your ship to 0 hit points strikes directly, leaving a massive hole or otherwise disables the ship.\r\n\r\n#### Instantly Destroyed\r\nMassive damage can destroy a ship instantly. When damage reduces a ship to 0 hull points and there is damage remaining, the ship explodes if the remaining damage equals or exceeds its hull point maximum.\r\n\r\n#### Destruction Saving Throws\r\nAt the start of the ship's turn, if the ship has 0 hull points, you must make a special saving throw, called a destruction saving throw, to determine whether or not you're able to salvage your ship. Unlike other saving throws, this one isn't tied to any ability score; you are in the hands of fate now. Roll a d20. If the roll is 10 or higher, you succeed. Otherwise, you fail. A success has no effect by itself; on your third success, your ship becomes stable (see below). On a failure, your ship suffers 1 level of system damage. The successes don't need to be consecutive; keep track of both until you collect three successes, or your ship's primary systems fail. \r\n\r\n***Rolling 1 or 20.*** When you make a destruction saving throw and roll a 1 on the d20, it counts as two failures, causing 2 levels of system damage. If you roll a 20 on the d20, your ship regains 1 hull point.\r\n\r\n***Damage at 0 Hull Points.*** If your ship takes any damage while it has 0 hull points, it suffers 1 level of system damage. If the damage is from a critical hit, it suffers 2 levels of system damage instead. If the damage equals or exceeds its hull point maximum, it is instantly destroyed.\r\n\r\n#### Stabilizing a Ship\r\nThe best way to stablize a ship with 0 hit points is to repair it. If repairs are unavailable, the ship can at least be stabilized so that it isn't killed by a failed destruction saving throw.\r\n\r\nA crewmember can use their action to attempt repairs on a disabled ship and attempt to stabilize it, which requires a successful DC 10 Intelligence (Mechanic's Kit) check.\r\n\r\nA **stable** ship doesn't make destruction saving throws, even though it has 0 hit points, but it does remain disabled. The ship stops being stable, and must start making destruction saving throws again, if it takes any damage. A stable ship that isn't repaired regains 1 hit point after 1d4 hours.\r\n\r\n#### Ships and Destruction\r\nMost GMs have an NPC ship explode the instant it drops to 0 hull points, rather than disabling it and having it make destruction saving throws. Special ships are common exceptions; the GM might have them be disabled and follow the same rules as player ships.\r\n\r\n### Disabling a Ship\r\nSometimes an attacker wants to incapacitate a ship,\r\nrather than destroy it. When an attacker reduces a ship\r\nto 0 hull points with a primary or secondary weapon, or with ion or lightning damage from any source, the attacker\r\ncan disable the ship, rendering it disabled and stable. The attacker can make this choice\r\nthe instant the damage is dealt, unless the damage dealt is ion damage, which can only disable ships, not destroy them. ","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"9","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Customization Options","chapterNumber":6,"contentMarkdown":"# Chapter 6: Customization Options\r\n\r\nThe combination of your character's personal   features, as well as their chosen deployment, defines your character's capabilities in the space component of the game, and the personal details you create set your character apart from every other character. Even within your class, species, and deployment specialization you have options to fine-tune what your character can do. But this chapter is for players who want to go a step further.\r\n\r\nThis chapter defines two sets of rules for customizing your character: multispeccing and ventures. Multispeccing lets you combine deployments together, and ventures are special options you can choose as you gain ranks.\r\n\r\nShips are locked to their respective size-driven tiers and have no multiclass parallels.\r\n\r\n## Multispecializing\r\nMultispecializing allows you to gain ranks in multiple deployment specializations. Doing so lets you mix the abilities of those deployments to realize a character concept that might not be reflected in one of the standard specialization options.\r\n\r\nWith this rule, you have the option of gaining a rank in a new specialization whenever you advance in rank, instead of gaining a rank in your current specialization. Your ranks in all your deployments are added together to determine your character rank. For example, if you have two ranks in pilot and one in gunner, you're a 3rd-rank character.\r\n\r\nAs you advance in ranks, you might primarily remain a member of your original deployment with just a single rank in another specialization, or you might change course entirely, never looking back at the deployment you left behind. You might even start progressing in a third or fourth specialization. Compared to a single-specialized character of the same rank, you'll sacrifice some focus in exchange for versatility.\r\n\r\n> #### Multispecializing Example\r\n>Drew is playing a 1st-rank pilot. When his character is ready to progress to 2nd rank, Drew decides that his character will multispec instead of continuing to progress as a pilot. Drew's character has been spending a lot of time with Rickey's gunner, and has even been doing some simulations. Drew decides that his character will multispec into the gunner deployment, and thus his character becomes a 1st-rank pilot and 1st-rank gunner (written as pilot 1/gunner 1).\r\n>When Drew's character is ready to progress to 3rd rank, he can decide whether to add another pilot rank (becoming a pilot 2/gunner 1), another gunner rank (becoming a pilot 1/gunner 2), or a rank in a third deployment, perhaps dabbling in the inner workings of the ship (becoming a pilot 1/gunner 1/mechanic 1).\r\n\r\n### Prerequisites\r\nUnlike classes, there are no requirements for multispeccing. When a player has progressed to a rank higher than 1, they can choose to multispec or focus on their primary deployment specialization, with no external requirements or considerations. \r\n\r\n### Milestones \r\nRather than traditional experience and book-keeping, ranks should be awarded as milestones for completing a specific encounter, or obtaining certain knowledge. \r\n\r\n### Proficiency Bonus\r\nShips do not have a proficiency bonus. When a feature references a proficiency bonus, instead use the proficiency bonus of the appropriate crewmember as long as the crewmember has at least one deployment rank.\r\n\r\n> Rather than having a separate proficiency bonus for the space and ground portions of your game, your proficiency bonus for space is the same as that of the ground. \r\n\r\nIf a deployment feature or venture allows you to forgo your proficiency bonus, you may only do so once.\r\n\r\n#### Expertise\r\nIf you have expertise in a skill as well as a feature that lets you forgo your proficiency bonus, you can only forgo your proficiency bonus once. For instance, if you are a 5th-level, 4th-rank pilot with an 18 in Intelligence and expertise in Piloting, you add 10 to your Piloting checks (4 + 2 x 3). If you use the 4th-rank pilot feature \"That's a Good Trick\" to forgo your proficiency bonus, you instead add 7 for the Piloting check as a part of that Evade action (4 + 2 x 3 - 3).\r\n\r\n## Gunning Styles\r\nCertain deployment features or ventures offer your choice of Gunning Style. Choose from the following. You can't take a Gunning Style option more than once, even if you later get to choose again.\r\n\r\n#### Cannoneer\r\nYou are skilled with laser cannons. While you are firing a primary weapon, you gain a +2 bonus to damage rolls and save DCs.\r\n\r\n#### Heavy Gunner\r\nYou are skilled with railguns and turbolasers. While you are firing a secondary weapon, you gain a +2 bonus to attack rolls and save DCs. \r\n\r\n#### Payload Delivery\r\nYou are skilled with mines, missiles, rockets, and other explosive weapons. When you roll a 1 or 2 on a damage die for a tertiary or quaternary weapon, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. \r\n\r\n## Gunning Masteries\r\nCertain deployment features or ventures offer your choice of Gunning Mastery. Choose from the following. You can't take a Gunning Mastery option more than once, even if you later get to choose again.\r\n\r\n#### Cannon Mastery\r\nYou are the master of laser cannons. While you are firing a primary weapon, when you take the Fire action, you can choose to fire rapidly at the expense of accuracy. Your attacks are made without the aid of your proficiency bonus, but you use your bonus action to make an additional attack, also without your proficiency bonus.\r\n\r\n#### Heavy Gun Mastery\r\nYou are the master of railguns and turbolasers. While you are firing a secondary weapon, before you make an attack, you can choose to double your proficiency bonus. If the attack hits, you reduce the damage dealt by an amount equal to your proficiency bonus.\r\n\r\n#### Payload Mastery\r\nYou are the master of missiles, rockets, and other ship-board explosive weapons. While you are firing a tertiary or quaternary weapon, you can choose to reduce the DC by an amount equal to your proficiency bonus. If you do, and the target fails the saving throw, they take additional damage equal to twice your proficiency bonus.\r\n\r\n## Ventures\r\nVentures represent talents beyond the deployment specialization of a character. This embodies their training and experience in other aspects of their lives. At certain deployment ranks, your deployment gives you the Venture feature. You can take each venture only once, unless the venture's description says otherwise.\r\n\r\nYou must meet any prerequisite specified in a venture to take that venture. If you ever lose a venture's prerequisite, you can't use that venture again until you regain the prerequisite. For example, the Spacecasting venture requires you to be able to cast force or tech powers. If your character loses the ability to do so, you can't benefit from the Spacecasting venture until you regain the ability to cast force or tech powers.\r\n\r\n> Ventures, and this book in general, are designed and written in such a way that they have minimal impact on the ground game. All ventures are intended to only be usable while deployed aboard a ship, even if they don't explicitly say it.\r\n\r\n### Analytical Coordinator\r\n_**Prerequisite:** at least 1 level in scholar_\r\n\r\nWhen an ally makes an ability check or attack roll affected by your Direct action, and they are also the target of your Critical Analysis class feature, they can also roll a d6 and add it to the ability check or attack roll.\r\n\r\n### Astrogation Mechanic\r\nWhen you make an Intelligence (Astrogation) check, your ship is considered proficiently equipped if you have proficiency in Technology or expertly equipped if you have expertise in Technology.\r\n\r\nAdditionally, when you make a Constitution (Patch) check when taking the Patch action, your ship is considered proficiently equipped if you have proficiency in Mechanic's Kit or expertly equipped if you have expertise in Mechanic's Kit. \r\n\r\n### Calculating Gunner\r\nWhen you make an attack roll with a secondary ship weapon, you can use your Intelligence modifier, instead of the ship's Wisdom modifier, for the attack rolls.\r\n\r\n### Counterslicer\r\nWhen you are the target of the Interfere action and are forced to make an Wisdom (Scan), if you succeed on the contest, you have advantage on the next Charisma (Interfere) check you make before the end of your next turn.\r\n\r\n### Cunning Operator\r\nWhen you take the Interfere action and fail the contest, you can use your bonus action to repeat the check against the same target.\r\n\r\n### Diamond Deployment\r\n_**Prerequisite:** at least 14 levels in monk_\r\n\r\nWhile deployed, when your ship fails a saving throw, you can spend 1 focus point to reroll the die.\r\n\r\n### Dogfighter Superiority\r\n_**Prerequisite:** at least 2 levels in fighter_\r\n\r\nWhen you expend a power die or another die granted by your Deployment, roll the die as normal, but you can instead subtract it from your pool of superiority dice.\r\n\r\n### Experienced Slicer\r\n_**Prerequisite:**  at least 1 rank in operator_  \r\n\r\nWhen setting your Operator's Disruptions save DC and whenever a Disruption uses your ship's Charisma modifier, you may add half your Intelligence modifier.\r\n\r\n### Explosive Gambits\r\n_**Prerequisite:** at least 3 ranks in gunner_\r\n\r\nOnce per turn, when you roll the maximum on a gambit die, you can roll an additional die and add it to the roll.\r\n\r\n### Flurry of Fire\r\n_**Prerequisite:** at least 2 levels in monk_\r\n\r\nImmediately after you take the Fire action you can spend 1 focus point to make an additional attack as a bonus action. This additional attack must be made with a primary weapon.\r\n\r\n### Force-Empowered Accuracy\r\n_**Prerequisite:** at least 2 levels in consular_\r\n\r\nOnce per turn, when you miss with a ship attack, or when a target succeeds on the saving throw against a ship weapon, you can spend 1 force point to reroll the die. You must use the new roll.\r\n\r\n### Force-Empowered Blasting\r\n_**Prerequisite:** at least 2 levels in guardian_\r\n\r\nOnce per turn, when you deal damage with a ship weapon, you can spend 1 force point to deal an additional 1d8 damage to the target. The damage is the same type as the weapon's damage.\r\n\r\n### Force-Empowered Shooting\r\n_**Prerequisite:** at least 2 levels in sentinel_\r\n\r\nWhen you take the Fire action, you can spend 1 force point to make an additional attack with a bonus action. This additional attack must be made with a primary weapon.\r\n\r\n### Force Piloting\r\n_**Prerequisite:** The ability to cast force powers_\r\n\r\nWhen you make an Dexterity (Manuever) check while aboard your ship, you may add half (round up) your Wisdom or Charisma modifier (your choice), to your result. Additionally, you can add half (round up) your Wisdom or Charisma modifier (your choice) to your ship's AC while at the helm.\r\n\r\n### Force Purification\r\n_**Prerequisite:** at least 14 levels in guardian_\r\n\r\nShips become valid targets for you Cleansing Touch ability.\r\n\r\n### Furious Gunner\r\n_**Prerequisite:** at least 1 level in berserker_\r\n\r\nWhile raging and firing a primary weapon, you can take a penalty to your attack roll up to your rage damage bonus, adding twice the amount to the damage roll on a hit.\r\n\r\n### Gunner Adept\r\n_**Prerequisite:** Rank 2_\r\n\r\nYou have gunner training that allows you to perform special combat gambits. You learn two gambits of your choice from among those available to the gunner deployment. \r\n\r\n### Gunning Mastery\r\n_**Prerequisite:** Rank 5_\r\n\r\nYou master a particular style of gunning. Choose one of the Gunning Mastery options, detailed above. You can select this venture multiple times. You can't take a Gunning Mastery option more than once, even if you later get to choose again.\r\n\r\n### Gunning Stylist\r\n_**Prerequisite:** Rank 3_\r\n\r\nYou adopt a particular style of gunning as your specialty. Choose one of the Gunning Style options options, detailed above. You can select this venture multiple times. You can't take a Gunning Style option more than once, even if you later get to choose again.\r\n\r\n### Hot Wire\r\nWhen you would make a Constitution (Patch) check while aboard your ship, you can instead make an Intelligence (Mechanic's Kit).\r\n\r\n### Indomitable Starship\r\n_**Prerequisite:** at least 9 levels in fighter_\r\n\r\nWhile deployed, when your ship fails a saving throw, you can use your Indomitable class feature to reroll the die.\r\n\r\n### Infiltration \r\n_**Prerequisite:** at least 10 levels in scout_\r\n\r\nYou can take the Fly or Conceal actions as a bonus action on each of your turns.\r\n\r\nWhen you attempt to Conceal your ship, you can opt to not move your ship more than half its speed on that turn. If you do so, ships that attempt to detect you take a -10 penalty to their Wisdom (Scan) checks until the start of your next turn. You lose this benefit if you move more than half your speed, either voluntarily or because of some external effect. You are still automatically detected if any effect or action causes you to no longer be hidden.\r\n\r\nIf you are still hidden on your next turn, you can continue to move up to half your speed and gain this benefit until you are detected.\r\n\r\nFinally, you can no longer be tracked by unenhanced means, unless you choose to leave a trail.\r\n\r\n### Infuse Ship Weapon\r\n_**Prerequisite:** at least 2 levels in engineer_\r\n\r\nShip weapons become valid targets for your Infuse Item class feature.\r\n\r\n### Intuitive Gunner\r\n_**Prerequisite:** The ability to cast force powers_\r\n\r\nWhen you determine the save DC for a tertiary ship weapon while on a Medium or smaller ship, you can add half your Wisdom or Charisma modifier (your choice) to the save DC. \r\n\r\n### Keen Eye\r\n_**Prerequisite:** Rank 4_\r\n\r\nWhen you take the Search action and succeed on a Wisdom (Scan) or Intelligence (Probe) check aided by your ship's scanners, you can learn certain information about a target if you are aware of them. The GM tells you if the ship is your ship's equal, superior, or inferior in regard to one of the following characteristics of your choice:\r\n- Any one Ability Score\r\n- Armor Class\r\n- Current total hull and shield points\r\n- Current Shield die type and number, and shield regeneration rate\r\n- Total ship tiers (if any)\r\n- Total deployment ranks (if any)\r\n\r\nOnce you've targeted a ship with this feature, you can't target it again until you complete a long rest.\r\n\r\n### Lock on Target\r\n_**Prerequisite:** The ability to cast tech powers_\r\n_**Prerequisite:** at least 1 rank in gunner_\r\n\r\nOnce per turn, when you hit a target with a ship attack from a primary or secondary weapon, you may use a reaction to spend one tech point to mark the target. The next attack roll you make against the ship before the end of your next turn can’t suffer from disadvantage.\r\n\r\n### Multi-Roled\r\nWhen you take Dual Role, choose a secondary deployment. When you advance a rank in your primary deployment, you may select a deployment maneuver (collaboration, gambit, technique, disruption, tactic, or stratagem) from your secondary deployment instead of your primary deployment. \r\n\r\nIf your chosen secondary deployment is Mechanic, you can use a power die from any location instead of a tech die for that technique.\r\n\r\n### Multi-Roled, Improved              \r\n_**Prerequisite:**  Multi-Roled_ \r\n\r\nWhen you advance a rank in your primary deployment, you may select a deployment maneuver (collaboration, gambit, technique, disruption, tactic, or stratagem) from any deployment instead of your primary deployment.\r\n\r\nIf your chosen maneuver is a technique, you can use a power die from any location instead of a tech die for that technique.\r\n\r\n### Multi-Rolled, Legendary   \r\n_**Prerequisite:**  Dual Roles, Multi-Roles, Rank 5_\r\n\r\nOver a long rest you may switch out a number of deployment maneuvers (collaboration, gambit, technique, disruption, tactic, or stratagem) you know up to your intelligence modifier (minimum of 1) for an equal number of maneuvers from other deployments. \r\n\r\nIf any of your chosen maneuvers are a technique, you can use a power die from any location instead of a tech die for that technique.\r\n\r\n### Multitasker\r\nWhen operating a ship, you gain a second reaction you can take with the ship.\r\n\r\n### Multitasker, Improved\r\n_**Prerequisite:** Multitasker_ \r\n\r\nWhen operating a ship, you gain a second bonus action you can take with the ship.\r\n\r\n###  Multitasker, Legendary\r\n_**Prerequisite:**  Multitasker, Improved; Rank 5_ \r\n\r\nWhen operating a ship, you gain a second action you can take with the ship.\r\n\r\n### Natural Slicer\r\nWhenever you make a Charisma (Interfere) check, you may instead make an Intelligence (Slicer Tools) check.\r\n\r\n### Perceptive Techie\r\nWhen you make a Wisdom (Scan) or Intelligence (Probe) check while aboard your ship, you may use your Wisdom modifier instead of your ship's Ability modifier.\r\n\r\n### Persistent Interference\r\n_**Prerequisite:** at least 3 ranks in operator_\r\n\r\nWhen you take the Interfere action and succeed on the contest, the target has disadvantage on the next Charisma (Interfere) check before the end of your next turn.\r\n\r\n### Pilot Adept\r\n_**Prerequisite:** Rank 2_\r\n\r\nYou have pilot training that allows you to perform special combat tactics. You learn two tactics of your choice from among those available to the Pilot deployment. \r\n\r\n### Pilot in Training\r\nWhen you make a Dexterity (Maneuvering) check while at the helm, you can add your proficiency bonus to checks you make if you do not already do so.\r\n\r\n### Precision GUNNER\r\nWhen you make an attack roll with a primary ship\r\nweapon while on a Large or smaller ship, you can\r\nuse your Dexterity modifier, instead of the ship's\r\nWisdom modifier, for the attack rolls.\r\n\r\n### Protected by the Force\r\n_**Prerequisite:** at least 3 levels in consular_\r\n\r\nWhen your ship is hit by an attack, you can use your reaction to shroud your ship in Force energy. Until the start of your next turn, you have a bonus to AC equal to your Wisdom or Charisma modifier (your choice, minimum of +1). This includes the triggering attack.\r\n\r\nYou can use this feature a number of times equal to your proficiency bonus, as shown in the consular table. You regain all expended uses when you finish a long rest.\r\n\r\n### Reckless Ramming\r\n_**Prerequisite:** at least 2 levels in berserker_\r\n\r\nWhen you take the Ram action, you can throw aside all concern for defense to attack with fierce desperation. The target has disadvantage on the Dexterity (Maneuvering) check, and you deal additional damage equal to your rage damage bonus. The first attack roll made against your ship before the start of your next turn has advantage.\r\n\r\n### Recurrent Repairs\r\n_**Prerequisite:** at least 3 ranks in mechanic_\r\n\r\nWhen you succeed on a Constitution (Patch) check as a part of a Patch action you take, you have advantage on the next Constitution (Patch) check you take as a part of the Patch action you take before the end of your next turn.\r\n\r\n### Resourceful Display\r\n_**Prerequisite:** at least 1 rank in coordinator_\r\n\r\nOnce per round, when you, or an ally with your Inspiring Display die, roll an Inspiring Display, they can roll the die twice and take either result.\r\n\r\n### Resourceful Gambits\r\n_**Prerequisite:** at least 1 rank in gunner_\r\n\r\nOnce per round, when you roll a power die used for a gunner's gambit, you can roll the die twice and take either result.\r\n\r\n### Resourceful Boost\r\n_**Prerequisite:** at least 1 rank in mechanic_\r\n\r\nOnce per round, when you use your System Boost feature, you can roll the tech die twice and take either result.\r\n\r\n### Resourceful Disruption\r\n_**Prerequisite:** at least 1 rank in operator_\r\n\r\nOnce per round, when you roll a power die as part of an operator's disruption, you can roll the die twice and take either result.\r\n\r\n### Resourceful Tactics\r\n_**Prerequisite:** at least 1 rank in pilot_\r\n\r\nOnce per round, when you roll a power die as part of a pilot's tactic, you can roll the die twice and take either result.\r\n\r\n### Resourceful Technician\r\n_**Prerequisite:** at least 1 rank in technician_\r\n\r\nOnce per round, when you roll a power die as part of a technician's stratagem, you can roll the die twice and take either result.\r\n\r\n### Scanner Specialist\r\nWhen you take the Search action, you have advantage on Wisdom (Scan) and Intelligence (Probe) checks that rely on the scanner.\r\n\r\n### Shield Tweaker\r\n_**Prerequisite:** The Ability to Cast 1st level Tech Powers_\r\n\r\nIf your ship has 1 or more shield points remaining, as a reaction to your ship taking damage, you may spend two tech points to tweak your ship's shields to capture some of the incoming energy, lessening its effect on your ship and storing it for your ship's next primary weapon attack. Your ship gains resistance to the triggering damage type until the start of your ship's next turn. Also, the first time your ship hits with a primary weapon attack on your ship's next turn, the target takes an extra 1d6 damage of the triggering type, and the power ends.\r\n\r\n### Shrewd Interrogator\r\nWhen you make a Wisdom (Insight) or Charisma (Deception) check while aboard your ship, you may use your Intelligence modifier instead of your Wisdom or Charisma modifier. \r\n\r\n### Slippery Pilot\r\n_**Prerequisite:** at least 2 levels in operative_\r\n\r\nYour quick thinking and agility allow you to act and move your ship quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Conceal, Evade, or Fly action.\r\n\r\n### Sneak Firing\r\n_**Prerequisite:** at least 1 level in operative_\r\n\r\nOnce per turn, you can deal an extra 1d6 damage to one ship you hit with a ship attack if you have advantage on the attack roll.  You can select this venture multiple times.\r\n\r\n### Spacecasting\r\n_**Prerequisite:** The ability to cast force or tech powers_\r\n\r\nWhen casting a force or tech power while aboard your ship and in space, the power's range is multiplied by 2. You can not target a hostile creature with a power unless you are aware of their presence and location.\r\n\r\n###  Spacecasting, Greater\r\n_**Prerequisite:** Spacecasting, Improved_\r\n\r\nWhen casting a force or tech power while aboard your ship and in space, the power's range is instead multiplied by 100. You can not target a hostile creature with a power unless you are aware of their presence and location.\r\n\r\nAdditionally, when casting a force or tech power while aboard your ship and in space that affects an area, the area's dimensions are instead multiplied by 10.\r\n\r\nLastly, when casting a force or tech power while aboard your ship and in space, you instead divide by 5 when scaling damage against Tiny ships.\r\n\r\n### Spacecasting, Improved \r\n_**Prerequisite:** Spacecasting_\r\n\r\nWhen casting a force or tech power while aboard your ship and in space, the power's range is instead multiplied by 10. You can not target a hostile creature with a power unless you are aware of their presence and location.\r\n\r\nAdditionally, when casting a force or tech power while aboard your ship and in space that affects an area, the area's dimensions are multiplied by 2.\r\n\r\n###  Spacecasting, Legendary\r\n_**Prerequisite:** Spacecasting, Master_\r\n\r\nWhen casting a force or tech power while aboard your ship and in space that affects an area, the area's dimensions are instead multiplied by 1,000.\r\n\r\nAdditionally, when casting a force or tech power while aboard your ship and in space, you ignore the damage scaling against Medium and smaller ships.\r\n\r\n### Spacecasting, Master \r\n_**Prerequisite:** Spacecasting, Greater_\r\n\r\nWhen casting a force or tech power while aboard your ship and in space, the power's range is instead multiplied by 1,000. You can not target a hostile creature with a power unless you are aware of their presence and location.\r\n\r\nAdditionally, when casting a force or tech power while aboard your ship and in space that affects an area, the area's dimensions are instead multiplied by 100.\r\n\r\nLastly, when casting a force or tech power while aboard your ship and in space, you instead divide by 2 when scaling damage against Small and smaller ships.\r\n\r\n### Space Explorer\r\n_**Prerequisite:** at least 1 level in scout_\r\n\r\nWhile deployed, parts of your Skilled Explorer class feature extend to your ship:\r\n- Your ship is not slowed by difficult terrain.\r\n- Your ship can't get lost by unenhanced means.\r\n- Your ship can move stealthily at a normal pace.\r\n\r\n### Storming Gunner\r\nYou can use your immense strength to steady primary weapons with the burst, rapid, or saturate features.  When you make an attack roll with a primary ship weapon having at least one of these features while on a Medium or smaller ship, you can use your Strength modifier, instead of the ship's Wisdom modifier, for the attack rolls or setting the DC for the targets' saves.\r\n\r\n### Strong Alone, Stronger Together\r\n_**Prerequisite:** at least 3 ranks in coordinator_\r\n\r\nWhen you take the Direct action, you have advantage on the next ability check or saving throw you make before the start of your next turn.\r\n\r\n### Tactical Superiority\r\n_**Prerequisite:** at least 2 levels in scholar_\r\n\r\nWhen you expend a power die or another die granted by a Deployment, roll the die as normal, but you can instead subtract it from your pool of superiority dice.\r\n\r\n### TARGETING FIRE\r\n_**Prerequisite:** at least 1 rank in gunner_\r\n\r\nWhen you take this Venture, you may select two areas that you are adept at targeting.  You may take this Venture multiple times.  Each time you do so, you may select two additional target areas.\r\n\r\nOnce per turn, when you hit a target with a ship attack from a primary or secondary weapon, you may use a reaction to either forego advantage if you have advantage, spend one tech point, or spend one force point to target a specific area of the ship causing targeted damage there:\r\n\r\n#### ENGINES\r\nThe target gain 1 [Slowed Level](#Slowed%20Level) until the end of its turn as it suffers damage to its engines.\r\n\r\n#### Fire Control System\r\nYou damage the target's targeting systems.  The first time the target forces you to make a saving throw before the start of your next turn, the target takes an additional 1d6 ionic damage, and you can roll 1d4 and add the number rolled to your saving throw. \r\n\r\n#### Gravity Generator\r\nYou cause each Large or smaller ship within 100 feet of the target to make a Strength saving throw (DC = 8 + your proficiency bonus + your ship's Strength modifier).  On a failure, that ship is pulled to the nearest unoccupied space adjacent to the target.\r\n\r\n#### Reactor\r\nYou destabilize the ship's reactor. Until the start of your next turn, if the target becomes tractored, ionized, or shocked, the reactor suffers damaging feedback, causing the ship to immediately take 1d8 ionic damage.\r\n\r\n#### Sensors\r\nYou create an illusory duplicate of your ship in your space that only the target can see. The target has disadvantage on the next attack roll it makes against your ship before the start of your next turn.\r\n\r\n#### Shields\r\nYou cause the target to take additional damage to the target's shields equal to your techcasting ability modifier at the start of your next turn. \r\n\r\n#### Static Discharge Vanes\r\nYou cause the target to become shocked until the end of your ship's next turn. When this attack hits a target, if there is a ship within 300 feet who is shocked, an arc of lightning courses between the two ships, dealing 1d6 lightning damage to both of them. If there are multiple other ships who are shocked, the lightning leaps to the closest ship.\r\n\r\n#### Weapons\r\nYou damage the ship's weapon systems.  The first time it would deal damage before the start of your next turn, that damage is reduced by 1d6.\r\n\r\n> #### GM Note:\r\n> If a ship being fought does not have the system that is targeted in the Targeting Fire venture (e.g., an X-Wing hit by an attack utilizing Targeting Fire: Gravity Generator does not have a gravity generator), then consider allowing the venture's effects to work via alternative means (e.g., the hyperdrive is hit instead). \r\n\r\n### Technological Knowledge\r\n_**Prerequisite:** at least 3 levels in engineer_\r\n\r\nShips become a valid target of your potent aptitude ability.\r\n\r\n### Thread the Needle\r\n_**Prerequisite:** at least 3 ranks in pilot_\r\n\r\nWhen you take the Evade action, you can gain the benefits of Evade against only a single target in order to avoid the penalty of disadvantage on any skill check or attack roll made by your ship or anyone on it.\r\n\r\n### Trust in the Force\r\n_**Prerequisite:** at least 10 levels in sentinel_\r\n\r\nWhen you take the Dogfight action, you can make a Dexterity (Maneuvering) check (DC = 10 + the number of enemy ships you can see).  On a success, the next attack made against your ship by any ship you can see is not granted advantage by the Dogfight action.\r\n\r\n### Weapon Enhancement\r\n_**Prerequisite:** The ability to cast 3rd level tech powers_\r\n\r\nAs an action, you may touch an unenhanced ship weapon on your ship and spend four tech points, making it an enhanced weapon, for up to an hour, as long as you maintain concentration. Additionally, choose one of these damage types: acid, cold, energy, fire, ion, kinetic, or lightning.  The unenhanced ship weapon you touch has a +1 to attack rolls and deals an extra 1d4 damage of the chosen type for the duration.\r\n\r\n### Weapon Overheat\r\n_**Prerequisite:** The ability to cast 2nd level tech powers_\r\n\r\nAs a bonus action, you may spend three tech points to empower a ship weapon on your ship. For up to an hour, as long as you maintain concentration, you can cool the weapon once per turn without using an action, and as a bonus action on each of your turns you can make one attack with the weapon.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"6","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Deployments","chapterNumber":2,"contentMarkdown":"# Chapter 2: Deployments\r\n\r\nAdventurers are extraordinary people, driven by a thirst for excitement into a life that others would never dare lead. They are heroes, compelled to explore the dark places of the world and take on the challenges that lesser women and men can't stand against.\r\n\r\nDeployments are roles your characters can fill that are not directly correlated with their class. A character can then specialize in a specific deployment, granting a variety of features, such as the gunner's gambits or the pilot's tactics. As you progress in your deployment specialization, you gain more powerful features, and some features improve. Each deployment specialization entry in this chapter includes a table summarizing the benefits you gain at every rank, and a detailed explanation of each one.\r\n\r\nA character can fill multiple roles simultaneously, provided it can reach the appropriate equipment to utilize that deployment's features.\r\n\r\nUnlike classes, when players achieve the space portion of the game, they start at rank 0. Players should attempt to experience multiple roles to see which suits them best before choosing the one in which they will specialize.\r\n\r\n> When engaging in the space portion of a campaign, many class features work in conjunction with a ship deployment, while others don't. It is up to your GM to determine which is which.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"2","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Equipment","chapterNumber":5,"contentMarkdown":"# Chapter 5: Equipment\r\n\r\nThe starship marketplace on the planet of Kuat  teems with a myriad of manufacturers trying to peddle their parts. Santhe engineers preach the benefits of their lightweight ship armors, while Czerka employees counter that reinforcement trumps speed. SoroSuub representatives propagate the destructive power of their heavy laser cannon across from BlasTech vendors demonstrating their rapid-fire laser cannon, which they tout as more consistent. Across this planet, and many others, ships and parts for myriad vessels are available for purchase.\r\n\r\nThis chapter offers choices of certain equipment types, to be used in conjunction with the starship upgrades featured in Chapter 4. The listed prices are those appropriate to ships of a Small size; when outfitting a ship of any other size, you'll want to apply the [Starship Size Equipment Cost](#Starship%20Size%20Equipment%20Cost), as shown in the **[Starship Size Equipment Cost](#Starship%20Size%20Equipment%20Cost)** table below, which differs slightly from a similar table found in Chapter 4.\r\n\r\nLike modifications, if PCs provide the workforce to install the equipment and invest their time, the final costs incurred to add equipment is only half that shown (just the material cost of an assembled piece of equipment). Moreover, one or more PCs can assemble a piece of equipment without the ship's presence being required by spending an amount of time assembling based on the material cost of the assembled piece of equipment (half the total installed cost) and by using raw materials equal to half the material cost of the installed equipment (one-quarter the total installed cost).\r\n\r\n### COST MODIFIERS\r\nEquipment for bigger starships is costlier to acquire and install than that for smaller ships. Consequently, each\r\nstarship has a cost modifier, derived from its size as\r\nshown in the **[Starship Size Equipment Cost](#Starship%20Size%20Equipment%20Cost)** table below,\r\nwhich is multiplied by the base cost of the item.  Because Ship weapons and ammunition only come in two size categories, their costs do not change based on the ship's size cost modifier.\r\n\r\n##### Starship Size Equipment Cost \r\n\r\n| Starship Size | Cost Modifier |\r\n|:----:|:---:|\r\n| Tiny  |x 0.5 |\r\n| Small |x 1 |\r\n| Medium |x 2 |\r\n\r\n| Starship Size | Cost Modifier |\r\n|:----:|:---:|\r\n| Large |x 5 |\r\n| Huge |x 50 |\r\n| Gargantuan |x 500 |\r\n\r\nFor instance, to purchase and install Deflection Armor on a Small size ship, it costs 3,100 credits. To purchase and install it on a Huge ship, however, it costs 155,000 (3,100 x 50).\r\n\r\n### Equipment Workforce\r\nAdditionally, bigger ships require more people to install new equipment, as shown below in the **[Starship Size Equipment Workforce](#Starship%20Size%20Equipment%20Workforce)** table below.\r\n\r\n##### Starship Size Equipment Workforce \r\n\r\n| Starship Size | Minimum Workforce |\r\n|:----:|:----:|\r\n| Tiny  | 1 |\r\n| Small  | 1 |\r\n| Medium  | 2 |\r\n\r\n| Starship Size | Minimum Workforce |\r\n|:----:|:----:|\r\n| Large  | 5 |\r\n| Huge | 50 |\r\n| Gargantuan | 500 |\r\n\r\n### Installation Time\r\nWith sufficient workforce, a snubfighter's equipment can be installed in no more than a week. However, installing a new equipment layout in a freighter can take up to a month, and an overhaul of a large ship such as a cruiser might take a year. It isn't practical for a smaller workforce to make changes to such big ships, regardless of how much time the workers have.\r\n\r\nThe base time needed to upgrade a starship is calculated as follows:\r\n\r\n___\r\n\r\n**time (in days) = (\"base cost of new equipment\" x \"[Starship Size Equipment Cost](#Starship%20Size%20Equipment%20Cost)\") / (500 x \"size of workforce\")**\r\n\r\n___\r\n\r\nFor instance, to install Deflection Armor in a Small ship, with a workforce of 1, would take 6.2 days. To install it on a Huge ship, with a workforce of 100, however, would take 3.1 days [(3,100 x 50) / (500 x 100)].\r\n\r\nIt is assumed that each member of the workforce works 8 hours per day.\r\n\r\n## Cargo\r\nOne of the primary features of a starship is its ability to store and transport cargo. This capacity accounts for everything not directly mounted to the ship, such as consumables, extra fuel, and personnel.\r\n\r\n### Cargo Capacity\r\nEach ship comes with a capacity for a certain amount of cargo, depending on its size, as shown below in the **[Starship Size Cargo Capacity](#Starship%20Size%20Cargo%20Capacity)** table.\r\n\r\n##### Starship Size Cargo Capacity\r\n\r\n|Starship Size|Cargo Capacity|\r\n|:--:|:--:|\r\n|Tiny|�|\r\n|Small|2 tons|\r\n|Medium|25 tons|\r\n\r\n|Starship Size|Cargo Capacity|\r\n|:--:|:--:|\r\n|Large|500 tons|\r\n|Huge|10,000 tons|\r\n|Gargantuan|200,000 tons|\r\n\r\n> #### Variant: Cargo, cargo everywhere\r\n> If you want to add more realism to your ship's cargo capacity, consider this additional rule in your games.\r\n> Every suite modification that does not explicitly grant cargo in it's text, grants an amount of cargo capacity, depending on the ship's size, equal to 1/5 the amount shown in the\r\n**[Starship Size Cargo Capacity](#Starship%20Size%20Cargo%20Capacity)** table.  However, the suite becomes unusable for its purpose if filled beyond 1/25 of the amount shown in the table.\r\n\r\n## Armor and Shields\r\n\r\nDifferent ships use different types of armor based on their size and maneuverability. Snubfighters typically use lighter weight armor giving them greater avoid-ance, while bombers focus more on absorption over maneuverability. In addition to armor, some ships have shields to give them a greater defensive advantage.\r\n\r\n### Armor\r\nArmor augments the AC and/or grants damage reduction to ships. All starships have access to armor without need of modifications, although there are modifications that upgrade this armor.\r\n\r\n***Lightweight Armor.*** \r\nLightweight armor is commonly used on smaller ships, allowing them to take full advantage of their quickness.\r\n\r\n***Deflection Armor.***\r\nDeflection armor offers a trade-off for a somewhat maneuverable but less bulky ship. A ship with Deflection Armor installed gains damage reduction, but limits the amount of Dexterity that can be applied to its Armor Class. \r\n\r\n***Reinforced Armor.***\r\nReinforced armor grants a ship significant damage reduction, but makes it less likely to avoid damage. \r\n\r\n#### Armor Class\r\nThe armor class of a ship is 10 plus (or minus) the ship's Dexterity modifier, plus the bonus from Tier upgrades, plus any other applicable bonuses. For example, if a Tier 2 (+1 bonus) small ship has a Dexterity of 16 (+3 modifier), and the ship is using lightweight armor, the ship has an armor class of 14 (10+3+1). \r\n\r\n#### Damage Reduction\r\nDamage reduction (DR) is a static value that you subtract when you take damage (to hull or shields) if certain conditions are met. DR is expressed as a number. DR provided by armor only affects damage you take as a result of being hit by an attack roll, in the same way that AC only helps you avoid being hit by an attack roll.\r\n\r\nIf passive DR would reduce the damage you take to 0, you instead take 1 damage.\r\n\r\n### Shields\r\nSome ships lack shields, though most ships have them. Shield points determine how strong a ship's shields are, while shield regeneration rate determines how quickly those shields regenerate.  All starships have access to shields without need of modifications.\r\n\r\n***Base Shield Points.*** Your starship's base shield points is calculated like your's ship's maximum hull points. At Tier 0, your base shield points equal the highest roll of your first Shield Die, as well as the average roll for each additional Shield Die. You also add your ship's Strength modifier to each die. \r\n\r\n***Shield Capacity.*** The capacity of shields is calculated by multiplying the base shield points by the shield capacity. For instance, if a ship has 50 base shield points, then it would have 50 shield points with directional shields, 75 with fortress shields, and only 33 with quick-charge shields.\r\n\r\n***Shield Regeneration Rate.*** Shield regeneration rate is represented by a set value.  Your ship may regenerate shields (no action required) once per round on the ship's turn by that value by expending a shield die without rolling it, up to the Shield Capacity. The shield regeneration rate is calculated by multiplying the maximum value of the ship's Shield Die by the shield regeneration rate coefficient. For instance, a Small ship (d6) regenerates 6 shield points at the start of the ship's turn with directional shields, but only 4 shield points with fortress shields (6 x 2/3).\r\n\r\n***Shield Depletion.*** In the event that shield points are reduced to 0, they can no longer be regenerated passively. A ship's shields can only be restored by using the Regenerate Shields action, by completing a recharge, or finishing a refitting.\r\n\r\n***Shield Dice Recovery.*** Half of a ship's Shield Dice are replenished after a recharge. \r\n\r\n#### Directional Shield\r\nDirectional Shields are the most commonly used and balanced shields on the market.\r\n\r\n#### Fortress Shield\r\nFortress shields offer a higher maximum shield points, but regenerate slower than normal shields.\r\n\r\n#### Quick-Charge Shield\r\nQuick-Charge Shields, opposite of Fortress Shields, offer a reduced capacity, but rapidly replenish.\r\n\r\n|Name|Cost   |Armor Class|Damage Reduction|Stealth|       Shield      Capacity|Shield Regeneration   Rate Coefficient|\r\n|:--|--:|:--:|:--:|:--:|:--:|:--:|\r\n|\t_Armor_\t    ||||||||\r\n| \tLightweight armor       |3,100 cr| 10+Dex |- |-|          -|      -| \r\n| \tDeflection armor      |3,450 cr| 10+Dex (max 2) | 3|-|          -|      -| \r\n| \tReinforced armor       |3,700 cr| 10+Dex (max 0) | 6|Disadv.|          -|      -|\r\n|\t_Shields_\t|||||||\r\n| \tDirectional shield     |4,300 cr| - | - | -  |        x 1|     x 1|\r\n| \tFortress shield        |4,650 cr| - | - | - |      x 3/2|    x 2/3|\r\n|  \tQuick-Charge shield    |4,900 cr| - | - | - |      x 2/3|    x 3/2|\r\n\r\n## Ship Power\r\nShips have different power generation, distribution, and storage systems based on their energy consumption needs.  Excess power can be used to fuel special abilities.\r\n\r\n### Power Dice\r\nCrewmembers can use a ship's power die to fuel special abilities granted by ranks in a particular deployment role.  A power die is expended when a crewmember uses it, and can be used when stored in the system listed in the ability or in central storage.\r\n\r\nThe size of your ship�s power dice is determined by your ship�s tier, as shown below in the **Starship Tier Power Die Size** table. \r\n\r\nYour ship�s maximum power dice and how your power dice are stored are determined by your ship's power coupling.  How many power dice it recovers each turn is determined by your ship�s reactor. \r\n\r\n##### Starship Tier Power Die Size\r\n|Starship Tier|Power Die Size |\r\n|:--:|:--:|\r\n|0|1|\r\n|1|d4|\r\n|2|d6|\r\n|3|d8|\r\n|4|d10|\r\n|5|d12|\r\n\r\n### Reactors\r\nShips use different reactor types based on their intend-ed uses. While the majority of commercial ships use standard reactors with average performance charac-teristics, some ships use more specialized reactor systems. Ships meant for endurance or stealth may use reactors optimized for fuel efficiency, while military craft often use reactors with greater fuel consumption and improved power output. \r\n\r\n***Power Die Recovery.*** At the start of each of your ship�s turns, it recovers a number of expended power dice, as shown in the Power Dice Recovery column of \r\n\r\nthe **Reactors and Power Couplings** table below.\r\n\r\n#### Fuel Cell Reactor\r\nFuel cell reactors are the most common and balanced reactors on the market.\r\n\r\n#### Ionization Reactor\r\nIonization reactors are highly fuel-efficient reactors that trade power output for fuel economy.\r\n\r\n#### Power Core Reactor\r\nPower core reactors have highly variable power output capabilities, but sacrifice fuel economy as a result.\r\n\r\n### Power Coupling\r\nDifferent power couplings are used in ships, often based on the number of crew expected to operate the ship.  Three power coupling models are in standard usage: direct power coupling, distributed power coupling, and hub & spoke power coupling.\r\nThese power dice are stored in a central and/or individual system capacitors to power abilities of crewmembers.  \r\n\r\n***Power Die Storage.*** Your ship�s maximum power dice are determined by its storage, as shown in the two storage columns of the **Reactors and Power Couplings** table below. Power dice stored centrally can be used by any deployment abilities, while those stored in specific systems can only be used by abilities that reference that system. There are five systems used by Deployment abilities: communications, engines, shields, sensors, and weapons. Each system has its own storage capacity in distributed and hub & spoke architectures.\r\n\r\n#### Direct Power Coupling\r\nDirect power coupling has a central power capacitor that feeds power directly to each system.\r\n\r\n#### Distributed Power Coupling\r\nDistributed power coupling sacrifices flexibility by allocating power separately to each system.\r\n\r\n#### Hub & Spoke Power Coupling\r\nA hub and spoke coupling system combines attributes of both other systems, providing some flexibility and some increased power storage capacity. \r\n\r\n##### Reactors and Power Couplings\r\n|Name|Cost|Fuel Use Modifier|Power Dice Recovery|Central Storage Capacity|System Storage Capacity|\r\n|:--|--:|:--:|:--:|:--:|:--:|:--:|\r\n|\t_Reactor_\t    ||||||||\r\n|\tFuel cell reactor  |4,500 cr| -    |1|-|-| \r\n|\tIonization reactor |5,100 cr| x 0.5|1d2-1|-|-| \r\n|\tPower core reactor |5,750 cr| x 1.5|1d2|-|-|\r\n|\t_Power Coupling_\t||||||||\r\n|\tDirect power coupling |4,100 cr| - | - |4|-|\r\n|\tDistributed power coupling   |5,100 cr| - | - |-|2 (per system)|\r\n| Hub & spoke power coupling   |5,600 cr| - | - |2|1 (per system)|\r\n\r\n## Weapons\r\nShips have weapon categories based on their determined function. Most snubfighters use laser cannons, while gunships have both railguns and lasers. Specialized ships often carry torpedoes or missile batteries, or even a bomb deployer. In order to install a weapon, your ship must have a vacant fixed or turret hardpoint modification.\r\n\r\nShip weapons are divided into four categories: Primary, Secondary, Tertiary, and Quaternary. Properties vary based on the weapon's category.\r\n\r\nIn order to install a weapon onto a starship, the ship must have a vacant hardpoint modification onto which the weapon is installed. The hardpoint modification may be upgraded with a mounting type which can add new firing arcs (turret mounting, or broadside mounting modifications) or add a new way of firing (fire-linked mounting) to the weapon installed onto that hardpoint, as described in **Chapter 4: Modifications**.\r\n\r\n> #### Weapon Installation: Start to Finish\r\n> If your ship already has a vacant hardpoint, then you can simply install a weapon onto the hardpoint per the equipment installation rules described in this chapter and the process is complete.\r\n> If your ship does not have any vacant hardpoints, then you must first purchase and install a hardpoint. If you want your weapon to have an unlimited firing arc, e.g., you purchase and install a hardpoint modification and a turret mounting modification (which has, as a prerequisite, the hardpoint modification). After installing the hardpoint per the modification installation rules in Chapter 4, you can now install the new weapon onto the hardpoint.\r\n\r\nShips have weapon categories based on their\r\nfunction. Most snubfighters use laser\r\ncannons, while gunships have both railguns and lasers.\r\nSpecialized ships often carry torpedoes or missile\r\nbatteries, or even a bomb deployer. \r\n\r\n### Primary Weapons\r\nPrimary weapons are the most common type that smaller ships carry: laser cannons. If a medium or smaller ship has any weapons, it has laser cannons. Laser cannons vary in effective range, rate of fire, damage, and damage type.\r\n\r\nIn a Huge or larger ship, primary weapons are\r\nde-ployed in arrays called point-defense systems.\r\nRather than being Fired, point-defense systems are activated via their zone keyword and call\r\nfor Dexterity saving throws to avoid the weapon's\r\neffects which apply to all ships entering or beginning\r\ntheir turn in range of the point-defense system. If the\r\ntarget fails the saving throw, they take the weapon's\r\nnormal damage. On a successful save, they take half of\r\nthe weapon's normal damage. A ship can not have\r\nmore than one of each type of point-defense weapon\r\nin any firing arc.\r\n\r\n***Range.*** The first number is the primary weapon's **normal range** in feet, and the second number indicates the primary weapon's **long range**. When attacking a target with a primary weapon beyond **normal range**, you have disadvantage on the attack roll. \r\n\r\nIn a Huge or larger ship, when attacking a target with a primary weapon beyond **normal range**, they have advantage on the saving throw. You can't attack a target beyond the weapon's **long range**. \r\n\r\n### Secondary Weapons\r\nSecondary weapons are typically railguns or a small turbolaser on Large or smaller ships.  On Huge and larger ships, secondary weapons are the most common type of weapon, and typically take the form of turbolaser batteries. These weapons deal more damage and have a longer range than primary weapons, but they are more cumbersome. They are a common addition to gunships. \r\n\r\nIn a Huge or larger ship, you have disadvantage to hit Large and Medium ships and cannot target Small or Tiny ships with secondary weapons.\r\n\r\n***Range.*** The first number is the secondary weapon's **close range** in feet, and the second number indicates the secondary weapon's **normal range**. When attacking a target within **close range**, you have disadvantage on the attack roll. If you would already have disadvantage because a Huge or larger ship is firing at a Large or Medium ship, you roll the higher die a second time. When attacking a target beyond **close range**, but within **normal range**, you make the attack roll unaltered. You can't attack a target beyond the secondary weapon's **normal range**. \r\n\r\n### Tertiary Weapons\r\nTertiary weapons are limited-use weapons in the form of missiles, rockets or torpedoes. These weapons often have a long range, high accuracy, and massive damage potential but they are limited use and expensive to obtain. X-Wings are typically outfitted with proton torpedoes, for example. \r\n\r\nRather than attack rolls, tertiary weapons call for Dexterity saving throws to avoid the weapon's effects. If the target fails the saving throw, they take the weapon's normal damage. On a successful save, they take half of the weapon's normal damage.  On a die result of \"1\" they treat the weapon's damage as if it had rolled the maximum.\r\n\r\nShips two or more sizes smaller than you have advantage on the saving throw.  Ships two or more sizes large than you have disadvantage on the saving throw.\r\n\r\n***Range.*** The first number is the tertiary weapon's **normal range** in feet, and the second number indicates the tertiary weapon's **long range**. When attacking a target with a tertiary weapon beyond **normal range**, they have advantage on the saving throw. You can't attack a target beyond the tertiary weapon's **long range**.  \r\n\r\n### Quaternary Weapons\r\nQuaternary weapons are limited-use weapons in the form of bombs, charges, and mines. These weapons deal massive damage, but travel at slow speeds, and are costly to acquire. Y-Wings are typically outfitted with proton bombs.\r\n\r\nRather than attack rolls, quaternary weapons call for saving throws to avoid the weapon's effects. If the target fails the saving throw, they take the weapon's normal damage. On a successful save, they take half of the weapon's normal damage.\r\n\r\nWhen released, quaternary weapons travel in a straight line at a rate of 100 feet per round, moving at the start of the firing gunner's turn. Quaternary weapons detonate when they physically connect with an object, when the firing gunner detonates them remotely using their reaction, or 1 minute after they are deployed.\r\n\r\nWhen a crewmember takes the Fire action with a quaternary weapon, they can release a single loaded piece of ammunition. \r\n\r\n***Range.*** Quaternary weapons do not have a range. Instead, when Firing a quaternary weapon, the crewmember chooses whether to drop the ammunition in place or to launch the ammunition.  If launched, the ammunition travels in a straight line at a rate of 100 feet per round.\r\n\r\n### Weapon Properties\r\nMany weapons have special properties related to their use, as shown in the **Weapons** table.\r\n\r\n#### Ammunition\r\nYou can use a weapon that has the ammunition property to make a ranged attack only if you have ammunition to fire from the weapon. Each time you attack with the weapon, you expend one piece of ammunition. \r\n\r\nWeapons with the ammunition property come with a range in parentheses after the property. The range property varies based on the weapon type.\r\n\r\n#### Auto\r\nAutomatic weapons only fire in burst or rapid mode.\r\n\r\n#### Burst\r\nA weapon that has the burst property can spray a 150-foot-cube area within range with shots. Each ship in the area must make a Dexterity saving throw (DC = 8 + your bonus to ranged ship attacks).  On a failure, the ship takes the weapon's normal damage.  The ship takes no damage on a success. This produces an amount of heat or consumes an amount of ammunition as indicated by the burst number. If the ranged ship attack would have disadvantage, affected targets instead have advantage.\r\n\r\n#### Constitution\r\nA weapon with this special property requires more hull structure to securely hold and use and more cooling capacity to safely operate. While firing it, you have disadvantage on attack rolls unless you meet the Constitution requirement.\r\n\r\n#### Dire\r\nBefore you make an attack with a weapon with the dire property, you can choose to suffer a penalty to the attack roll up to the dire number. If you do so and you hit with it, you gain the same bonus to the damage roll.\r\n\r\n#### Explosive\r\nWhen a ship is dealt damage by a weapon with the explosive property, creatures inside are forced to make a Constitution saving throw to maintain concentration.  The DC for the check equals 10 or half the damage taken by the ship, whichever number is higher.\r\n\r\n#### Heavy\r\nWhen you hit with an attack roll with this weapon, you deal additional damage equal to half your Strength modifier (rounded up, minimum of +1). Heavy is incompatible with saturate.\r\n\r\n#### Hidden\r\nYou have advantage on Charisma (Swindle) checks made to conceal a hidden weapon.\r\n\r\n#### Homing\r\nA weapon with the homing property gives disadvantage on saving throws made within normal range.  Targets are not granted advantage on their saving throws for being at long range.\r\n\r\n#### Ionizing\r\nOn a hit, the target must succeed on a DC 13 Constitution saving throw or it is ionized for 1 minute. As an action by a crewmember on their turn, the ship can repeat the saving throw, ending the effect early on a success. Ships larger than you have advantage on the saving throw.\r\n\r\n#### Keen\r\nWhen you make a weapon attack with a weapon with the keen property, the critical hit range increases by an amount equal to the keen number.\r\n\r\n#### Melt\r\nYou may choose to forgo your proficiency bonus to your attack roll or suffer a penalty to the saving throw DC of the weapon equal to your proficiency bonus.  If you do so, on a hit, you may add your proficiency bonus to the damage result.\r\n\r\n#### Overheat\r\nA limited number of shots can be made with a weapon that has the overheat property. A character must then cool the weapon using an action or a bonus action (the character's choice).  A weapon will naturally cool over a period of ten minutes of non-use. \r\n\r\n#### Piercing\r\nBefore you make a weapon attack with a weapon with the piercing property, you can choose to gain a bonus to the attack roll up to the piercing number. If you do so, and you hit with it, you suffer an equivalent penalty to the damage roll.\r\n\r\n#### Power\r\nYou can use a weapon that has this property to make a ranged attack without the use of ammunition. The weapon draws directly from the ship's power source.\r\n\r\nWeapons with the power property come with a range in parentheses after the property. The range lists two numbers. The effect of these two numbers varies based on the weapon type.\r\n\r\n#### Range\r\nA weapon that can be used to make a ranged attack has a range shown in parentheses after the ammunition or thrown property. The range lists two numbers. The first is the weapon's normal range in feet, and the second indicates the weapon's maximum range. When attacking a target beyond normal range, you have disadvantage on the attack roll. You can't attack a target beyond the weapon's long range.\r\n\r\n#### Rapid\r\nA weapon that has the rapid property can unload on a single target. The target must make a Dexterity saving throw (DC = 8 + your bonus to ranged ship attacks). On a failed save, the target takes normal weapon damage, plus an additional amount equal to the weapon's damage dice. On a success, the target takes no damage. This produces an amount of heat or consumes an amount of ammunition as indicated by the rapid number. If the ranged ship attack would have disadvantage, the target instead has advantage.\r\n\r\n#### Reload\r\nA limited number of shots can be made with a weapon that has the reload property. A crewmember must then reload it. Reloading a weapon takes 1 minute per ammunition\r\n\r\n#### SATURATE\r\nWhen making an attack with a weapon with saturate,\r\nyou use your choice of your Strength or Wisdom\r\nmodifier for the attack roll or save DC. Saturate is incompatible\r\nwith heavy.\r\n\r\n#### Special\r\nA weapon with the special property has unusual rules governing its use, explained in the weapon's description (see \"Special Weapons\" later in this section).\r\n\r\n#### Vicious\r\nWhenever you deal damage with a weapon with the vicious property and roll the maximum on a weapon damage die, you gain a bonus to damage equal to the vicious number.\r\n\r\n#### Zone\r\nWeapons with the zone property are activated with an action and persist until deactivated (no action required). The weapon creates a zone of difficult terrain within the firing arc and normal range of the weapon. Additionally, your ship has advantage on dexterity saving throws against tertiary weapons launched outside normal range of the weapon.\r\n\r\n## Weapons by Size\r\nIn addition to the cost of the weapon varying by size, the damage dice and reload value for ammunition based weapons vary as well. There are two tables showing the various weapon systems that can be added to ships. The first is for size Tiny to Large ships, and the second is for size Huge to Gargantuan.  A third table lists the types of tertiary ammunition that can be used by the tertiary weapon systems.\r\n\r\n### Tertiary and Quaternary Weapons\r\n\r\n#### Ship Weapons (Tiny-Large)\r\nWhen scaling a tertiary or quaternary weapon to a size Tiny ship, reduce the reload number by half. When scaling a tertiary or quaternary weapon to a size Medium ship, double the reload number. When scaling a tertiary or quaternary weapon to a size Large Ship, quadruple the reload number.\r\n\r\nFor instance, a Cluster Pod Launcher for a size Tiny ship has a reload of 6; for a size Medium ship has a reload of 24. Meanwhile, a Bomb Deployer for a size Tiny ship has a reload of 2; for a size Medium ship the Bomb Deployer has a reload of 8.\r\n\r\nThe damage done by tertiary ammunition for ships sized Tiny, Small, Medium, and Large is shown in the \"Damage\" column of the **Tertiary Ammunition** table.  The number in parentheses is only used for ships sized Huge and Gargantuan.\r\n\r\n#### Ship Weapons (Huge & Gargantuan)\r\nWhen scaling a tertiary or quaternary weapon to a size Gargantuan ship, double the reload number. \r\n\r\nFor instance, an Assault Cluster Pod Launcher for a size Gargantuan ship has a reload of 48. Meanwhile, a Bomb Deployer for a size Gargantuan ship has a reload of 16.\r\n\r\nThe damage done by tertiary ammunition for ships sized Huge and Gargantuan is shown in parentheses in the \"Damage\" column of the **Tertiary Ammunition** table.  The number outside the parentheses is only used for ships size Tiny, Small, Medium, and Large.\r\n\r\n##### Ship Weapons (Tiny-Large)\r\n|Name|Cost|  |Damage|Properties| \r\n|:---|---:|:-:|:---|:---|\r\n|_Primary Weapons_\t|||||\r\n|Assault laser cannon\t\t|4,150 cr||2d6 energy\t |Power (range 1200/4800), constitution 15, overheat 2|\r\n|Blaster cannon             \t|4,000 cr||1d8 energy\t |Power (range 600/2400), hidden, overheat 18, rapid 9|\r\n|Burst laser cannon\t\t\t|4,500 cr||2d4 energy\t |Power (range 200/800), auto, burst 1, overheat 2, saturate|\r\n|Double laser cannon\t\t\t|4,500 cr||2d4 energy\t |Power (range 800/3200), overheat 8|\r\n|Heavy blaster cannon\t\t|4,150 cr||1d8 energy\t |Power (range 600/2400), heavy, overheat 12|\r\n|Heavy ion cannon\t\t\t|4,150 cr||1d10 ion \t |Power (range 1000/4000), constitution 17, heavy, ionizing, overheat 4|\r\n|Heavy laser cannon\t\t\t|4,150 cr||1d12 energy\t |Power (range 1200/4800), constitution 15, heavy, overheat 2|\r\n|Ion cannon      \t\t\t|6,100 cr||2d4 ion       |Power (range 800/3200), constitution 13, ionizing, overheat 8|\r\n|Laser cannon             \t|4,000 cr||1d10 energy\t |Power (range 1000/4000), constitution 11, overheat 4|\r\n|Light ion cannon  \t\t\t|6,100 cr||1d8 ion       |Power (range 800/3200), overheat 16|\r\n|Light laser cannon       \t|4,100 cr||1d8 energy\t |Power (range 800/3200), overheat 16|\r\n|Quad laser cannon       \t|4,400 cr||2d4 energy\t |Power (range 800/3200), constitution 13, overheat 8, rapid 2|\r\n|Quad pulse laser        \t|4,400 cr||1d6 energy\t |Power (range 400/1600), overheat 16, rapid 4|\r\n|Plasburst laser cannon     \t|4,000 cr||1d8 energy\t |Power (range 600/2400), burst 12, overheat 12|\r\n|Pulse laser cannon       \t|2,500 cr||1d4 energy\t |Power (range 500/2000), keen 1, piercing 1, overheat 20|\r\n|Rapid-fire laser cannon    \t|4,600 cr||1d6 energy\t |Power (range 400/1600), auto, burst 16, overheat 16, rapid 4|\r\n|Slug cannon             \t|4,000 cr||1d8 kinetic\t |Power (range 600/2400), constitution 11, dire 1, overheat 4|\r\n|Sparkler ion cannon  \t\t|6,100 cr||1d4 ion       |Power (range 200/800), auto, burst 1, ionizing, overheat 1, saturate|\r\n|Thermite cannon      \t\t|6,300 cr||1d12 fire     |Power (range 1200/4800), constitution 17, melt, overheat 2|\r\n|Twin auto-blaster       \t|4,400 cr||1d4 energy\t |Power (range 250/1000), auto, burst 10, hidden, overheat 20, rapid 5|\r\n|Twin laser cannon       \t|4,400 cr||1d8 energy\t |Power (range 600/2400), constitution 11, rapid 3, overheat 12|\r\n|_Secondary Weapons_\t|||||||\r\n|Ion railgun\t\t        \t|5,700 cr||1d10 ion \t |Power (range 1000/4000), constitution 17, ionizing, overheat 4|\r\n|Particle beam\t\t    \t|5,750 cr||2d4 energy    |Power (range 800/3200), constitution 11, overheat 4|\r\n|Slug railgun\t\t    \t|5,150 cr||1d12 kinetic  |Power (range 1200/4800), constitution 15, overheat 2|\r\n|Thermite railgun\t    \t|5,400 cr||1d10 fire     |Power (range 1200/4800), constitution 17, melt, overheat 2|\r\n|Turbolaser   \t\t    \t|5,000 cr||1d10 energy   |Power (range 1000/4000), constitution 13, overheat 4|\r\n|_Tertiary Weapons_\t|||||||\r\n|Cluster pod launcher\t            |6,000 cr||   -           |Ammunition, reload 12|\r\n|Missile launcher        |6,250 cr||            -  |Ammunition, reload 4|\r\n|Torpedo launcher                  |6,900 cr||  -            |Ammunition reload 4|\r\n|_Quaternary Weapons_\t|||||||\r\n|Bomb deployer               |8,000 cr|| -            |Ammunition, reload 4|\r\n\r\n##### Ship Weapons (Huge-Gargantuan)\r\n|Name|Cost|  |Damage|Properties| \r\n|:---|---:|:-:|:---|:---|\r\n|_Primary Weapons_\t|||||\r\n|Blaster point-defense      |4,000 cr||3d4 energy\t     |Power (range 200/800), saturate, zone|\r\n|Ion cannon point-defense   |5,500 cr||2d6 ion   \t     |Power (range 300/1200), ionizing, saturate, zone|\r\n|Laser cannon point-defense |6,000 cr||3d6 energy\t     |Power (range 300/1200), saturate, zone|\r\n|Ordnance point-defense     |6,000 cr||2d6 kinetic        |Power (range 300/1200), explosive, saturate, zone|\r\n|_Secondary Weapons_\t|||||||\r\n|Assault turbolaser battery\t    |4,150 cr||6d6 energy\t |Power (range 1200/4800), con. 15, overheat 2|\r\n|Burst turbolaser battery  \t    |4,500 cr||6d4 energy\t |Power (range 200/800), auto, burst 1, overheat 2, saturate|\r\n|Double turbolaser battery \t    |4,500 cr||6d4 energy\t |Power (range 800/3200), overheat 8|\r\n|Heavy ion battery\t\t\t    |4,150 cr||3d10 ion \t |Power (range 1000/4000), con. 17, heavy, ionizing, overheat 4|\r\n|Heavy ion railgun\t\t        |5,700 cr||3d10 ion \t |Power (range 2000/8000), con. 19, ionizing, overheat 4|\r\n|Heavy gun battery            \t|4,000 cr||4d10 kinetic\t |Power (range 400/1600), con. 17, overheat 1, vicious 1|\r\n|Heavy slug railgun   \t\t    |5,150 cr||3d12 kinetic  |Power (range 2400/9600), con. 17, overheat 2|\r\n|Heavy thermite railgun\t    \t|5,400 cr||3d10 fire     |Power (range 2400/9600), con. 19, melt, overheat 2|\r\n|Heavy turbolaser battery\t    |4,150 cr||3d12 energy\t |Power (range 1200/4800), con. 15, heavy, overheat 2|\r\n|Ion battery     \t\t\t    |6,100 cr||6d4 ion       |Power (range 800/3200), con. 13, ionizing, overheat 8|\r\n|Light ion battery \t\t    \t|6,100 cr||3d8 ion       |Power (range 800/3200), overheat 16|\r\n|Light turbolaser battery   \t    |4,100 cr||3d8 energy\t |Power (range 800/3200), overheat 16|\r\n|Long-range turbolaser battery  \t|4,000 cr||3d10 energy   |Power (range 2400/9600), con. 15, overheat 2|\r\n|Quad turbolaser battery     \t|4,400 cr||6d4 energy\t |Power (range 800/3200), con. 13, overheat 8, rapid 2|\r\n|Quad pulse turbolaser battery  \t|4,400 cr||2d6 energy\t |Power (range 400/1600), overheat 16, rapid 4|\r\n|Particle Cannon\t\t    \t    |5,750 cr||6d4 energy    |Power (range 1600/6400), con. 13, overheat 4|\r\n|Plasburst turbolaser battery \t|4,000 cr||3d8 energy\t |Power (range 600/2400), burst 12, overheat 12|\r\n|Pulse turbolaser battery       \t|2,500 cr||3d4 energy\t |Power (range 500/2000), keen 1, piercing 1, overheat 20|\r\n|Rapid-fire turbolaser battery  \t|4,600 cr||3d6 energy\t |Power (range 400/1600), auto, burst 16, overheat 16, rapid 4|\r\n|Thermite battery      \t    \t|6,300 cr||3d12 fire     |Power (range 1200/4800), con. 17, melt, overheat 2|\r\n|Turbolaser battery         \t    |4,000 cr||3d10 energy\t |Power (range 1000/4000), con. 11, overheat 4|\r\n|Twin turbolaser battery      \t|4,400 cr||2d8 energy\t |Power (range 600/2400), con. 11, rapid 3, overheat 12|\r\n|_Tertiary Weapons_\t|||||||\r\n|Assault cluster pod launcher\t            |6,000 cr||   -           |Ammunition, reload 24|\r\n|Assault missile launcher        |6,250 cr||            -  |Ammunition, reload 8|\r\n|Assault torpedo launcher                  |6,900 cr||  -            |Ammunition reload 8|\r\n|_Quaternary Weapons_\t|||||||\r\n|\tBomb layer                  |8,000 cr||-                |Ammunition, reload 8|\r\n\r\n##### Tertiary Ammunition\r\n|Name|Cost|Damage|Weight|Properties|\r\n|:---|---:|:---|-:|:---|\r\n|_(Assault) Cluster pod_\t|||||||\r\n|  Adv. cluster missile          |200 cr  |3d6 (6d6) kinetic  |20 (40) lb|(Range 600/2400), auto, burst 6, explosive, rapid 6|\r\n|  Adv. homing cluster missile   |250 cr  |3d6 (6d6) kinetic  |25 (50) lb|(Range 600/2400), auto, burst 6, explosive, homing, rapid 6|\r\n|  Cluster missile              |100 cr   |3d4 (6d4) kinetic   |10 (20) lb|(Range 600/2400), auto, burst 6, explosive, rapid 6|\r\n|  Homing cluster missile        |150 cr  |3d4 (6d4) kinetic |15 (30) lb|(Range 600/2400), auto, burst 6, explosive, homing, rapid 6|\r\n|  Nano cluster rocket          |100 cr   |1d4 (2d4) kinetic  |10 (20) lb|(Range 800/3200), explosive, homing|\r\n|_(Assault) Missile launcher_\t||||||\r\n|  Adv. concussion missile       |1250 cr|2d10 (4d10) energy |125 (250) lb|(Range 800/3200), auto, burst 1, explosive, rapid 1|\r\n|  Concussion missile            |750 cr  |2d8 (4d8) energy   |75 (150) lb|(Range 600/2400), auto, burst 1, explosive, rapid 1|\r\n|  Conner net (missile)          |850 cr  |-                  |85 (170) lb|(Range 600/2400), special|\r\n|  Discord missile               |850 cr  |-                  |85 (170) lb|(Range 600/2400), special|\r\n|  Proton rocket                 |950 cr  |10d4 (20d4) kinetic|95 (190) lb|(Range 200/800), explosive, vicious 1|\r\n|  Ion pulse missile             |700 cr  |2d10 (4d10) ion    |70 (140) lb|(Range 1000/4000), ionizing|\r\n|  Silent thunder missile        |1500 cr |4d10 (8d10) energy |150 (300) lb|(Range 1200/4800), explosive|\r\n|  S-thread tracer               |1500 cr |-                  |50 (100) lb|(Range 1200/4800), special|\r\n|_(Assault) Torpedo launcher_\t||||||\r\n|  Advanced proton torpedo       |850 cr  |2d12 (4d12) energy |85 (170) lb|(Range 800/3200), explosive, keen 1|\r\n|  Flechette torpedo             |850 cr  |-                  |85 (170) lb|(Range 600/2400), special|\r\n|  Homing torpedo                |250 cr  |1d12 (2d12) energy |25 (50) lb|(Range 1200/4800), explosive, homing|\r\n|  Plasma torpedo                |700 cr  |2d12 (4d12) ion    |70 (140) lb|(Range 1200/4800), vicious 1|\r\n|  Proton torpedo                |650 cr  |2d10 (4d10) energy |65 (130) lb|(Range 1200/4800), explosive, keen 1|\r\n|  Thermite torpedo              |700 cr  |2d10 (4d10) fire   |70 (140) lb|(Range 1200/4800), melt, keen 1|\r\n\r\n##### Quaternary Ammunition\r\n\r\n|Name|Cost|Weight|\r\n|:---|:---:|:--|\r\n|\tBomblets        \t|1200 (2400) cr|16 (32) lb|\r\n|\tConner net (mine)  \t|2000 (4000) cr|30 (60) lb|\r\n|\tEMP bomb        \t|2300 (4600) cr|45 (90) lb|\r\n|\tGlop bomb         \t|2000 (4000) cr|30 (60) lb|\r\n|\tGravity bomb        |2200 (4400) cr|40 (80) lb|\r\n\r\n|Name|Cost|Weight|\r\n|:---|:---:|:--|\r\n|\tGravity mine        |2000 (4000) cr|30 (60) lb|\r\n|\tProton bomb        \t|2100 (4200) cr|32 (65) lb|\r\n|\tProximity mine   \t|2200 (4400) cr|32 (65) lb|\r\n|\tPulse bomb        \t|2300 (4600) cr|35 (70) lb|\r\n|\tSeismic charge   \t|2000 (4000) cr|30 (60) lb|\r\n\r\n## Ammunition \r\nTertiary and quaternary weapons require ammunition.  Values in brackets apply to Huge and larger ships.\r\n\r\n**Tertiary Ammunition.** The ammunition for tertiary weapons varies based on the specific type of launcher attached to the hardpoint.\r\n\r\n**Quaternary Ammunition.** The ammunition for quaternary weapons, while fire-able by the same bomb deployer, vary greatly in function. Regardless of their function, all quaternary ammunition has 1 hull point and an AC of 20. Upon destruction, all quaternary ammunition detonates. The damage value is appropriate for Tiny-Large ships, while the value in parentheses is appropriate for Huge-Gargantuan ships. \r\n\r\n### Ammunition Descriptions\r\n\r\n#### Bomblets\r\nWhen a bomblet detonates, each ship within 50 [100] feet must make a Dexterity saving throw (DC 15). A ship takes 1d10 [2d10] energy damage on a failed save, or half as much on a successful one.\r\n\r\n#### Conner Net\r\nOn a failed saving throw for a missile or upon detonation for a mine, a conner net deploys on the target, which must make a Constitution saving throw (DC 15). On a failed save, the ship is stunned for 1 minute. As an action on each of their turns, a crewmember can have the ship repeat the saving throw, ending the effect on a success.  \r\n\r\n#### DISCORD MISSILE\r\nOn a failed saving throw, the missile deploys pistoeka sabotage or �buzz� droids on the target. At the end of each of the target ship�s turns, the target ship gains one level of system damage if the target is medium or smaller [large or smaller]. As an action on each of their turns, a crewmember can have the ship attempt their choice of a dexterity or constitution saving throw (DC 15), ending the effect on a success.\r\n\r\n#### EMP Bomb\r\nWhen an EMP bomb detonates, each ship within 150 [300] feet must make a Constitution saving throw (DC 15). On a failed save, a ship is stunned for 1 minute. As an action on each of their turns, a crewmember can have the ship repeat the saving throw, ending the effect on a success.  \r\n\r\n#### Flechette Torpedo\r\nA Flechette torpedo detonates at a point within range, creating a 200 (400) foot cube of difficult terrain.  Any ship entering or starting their turn in this area must succeed at a Dexterity saving throw (DC 15) or take 1d8 [2d8] kinetic damage.\r\n\r\n#### Glop Bomb\r\nWhen a glop bomb detonates, each ship within 50 [100] feet must make a Dexterity saving throw (DC 15). On a failed save, a ship is blinded for 1 minute. As an action on each of their turns, a crewmember can have the ship repeat the saving throw, ending the effect on a success.  Ships larger than you have advantage on their saving throw.\r\n\r\n#### Gravity Bomb\r\nRather than exploding on contact, gravity bombs detonate any time a ship comes within range of it. When a gravity bomb detonates, it attaches itself to the closest ship hull within 50 [100] feet, creating a mass shadow centered on the ship with a radius of 50 feet that lasts for 10 minutes.  A ship can attempt to dislodge the gravity bomb at the beginning of each ship turn by making a Strength saving throw (DC 15). Any Large or smaller [Gargantuan or smaller] ships with an attached gravity bomb are unable to activate their hyperdrives.\r\n\r\n#### Gravity Mine\r\nRather than exploding on contact, gravity mines detonate any time a ship comes within range of it. When a gravity mine detonates, it creates a mass shadow centered on the point of detonation with a radius of 50 [100] feet that lasts for 10 minutes. Any ships touching this mass shadow are unable to activate their hyperdrives.\r\n\r\n#### Proton Bomb\r\nWhen a proton bomb detonates, each ship within 100 [200] feet must make a Dexterity saving throw (DC 15). A ship takes 4d10 [8d10] energy damage on a failed save, or half as much on a successful one.\r\n\r\n#### Proximity Mine\r\nRather than exploding on contact, proximity mines detonate any time a ship comes within range of it. When a proximity mine detonates, each ship within 100 [200] feet must make a Dexterity saving throw (DC 15). A ship takes 2d10 [4d10] fire damage on a failed save, or half as much on a successful one.\r\n\r\n#### Pulse Bomb\r\nWhen a pulse bomb detonates, each ship within 200 [400] feet must make a Constitution saving throw (DC 15). A ship takes 2d10 [4d10] ion damage on a failed save, or half as much on a successful one. Additionally, on a failed save, it is ionized for 1 minute. As an action on each of their turns, a crewmember can have the ship repeat the saving throw, ending the effect on a success.  Ships larger than you have advantage on their saving throw.\r\n\r\n#### Seismic Charge\r\nWhen a seismic charge detonates, each ship within 150 [300] feet must make a Dexterity saving throw (DC 15). A ship takes 1d10 [2d10] kinetic damage on a failed save, or half as much on a successful one.\r\n\r\n#### S-Thread Tracer\r\nOn a failed saving throw, the missile latches an S-thread tracer onto the target. When making an Intelligence (Probe) check to detect the S-threaded ship's hyperspace travel, its angle of departure can be detected on a roll of 15 instead of 25. \r\n\r\n## Hyperdrive\r\nThe hyperdrive is a propulsion system that allows a starship to reach hyperspeed and traverse the void between stars in the alternate dimension of hyperspace. For a starship to have a hyperdrive, it must have a vacant hyperdrive slot modification.\r\n\r\nThe hyperdrive functions by sending hypermatter particles to hurl a ship into hyperspace while preserv-ing the vessel's mass/energy profile, and requires a functional hyperdrive motivator to do so. The vessel then travels along a programmed course until it drops back into normal space-realspace-at its destination.\r\n\r\nA crewmember can engage the hyperdrive as an action, causing the hyperdrive to accept and use the calculations provided during astrogation. The designated pilot must spend at least 50 feet of your flying speed before the end of the ship's turn to move forward and enter hyperspace, otherwise the hyperdrive resets and must be re-engaged.\r\n\r\nA hyperdrive's only function is to keep a vessel in hyperspace, and should a hyperdrive be forcibly deactivated or destroyed during transit, the ship will be violently pulled back into realspace.\r\n\r\nTiny ships rarely have a hyperdrive, while Small ships occasionally do. Medium and larger ships typically have a hyperdrive.\r\n\r\nThe speed of a hyperdrive is rated on an inverse scale: the faster the hyperdrive, the lower the rating or \"Class\". Acting as a multiplier for a given base travel time then, a Class 2 hyperdrive takes twice the base time to travel a given route, while the Millennium Falcon's Class 0.5 takes only half the base time.\r\n\r\nA ship can have multiple hyperdrives. Larger ships typically have a back-up in case of failure. Only one hyperdrive can be activated at a time. Your ship must have a hyperdrive slot for each hyperdrive.\r\n\r\n##### Hyperdrives\r\n|Name|Cost|\r\n|:--|--:|\r\n|Hyperdrive, class 0.5    |50,000 cr|\r\n|Hyperdrive, class 0.75   |25,000 cr|\r\n|Hyperdrive, class 1.0    |15,000 cr|\r\n|Hyperdrive, class 1.5    |12,500 cr|\r\n|Hyperdrive, class 2      |10,000 cr|\r\n|Hyperdrive, class 3      | 7,500 cr|\r\n|Hyperdrive, class 4      | 5,000 cr|\r\n|Hyperdrive, class 5      | 2,500 cr|\r\n|Hyperdrive, class 8      | 1,000 cr|\r\n|Hyperdrive, class 12     |   750 cr|\r\n|Hyperdrive, class 15     |   500 cr|\r\n\r\n## Docking\r\nAll starships require refueling and restocking, as well as a place to dock where they can get these services.\r\n\r\n### Docking Fees\r\nDocking fees vary planet-to-planet, but typically average around 20 credits per day in an average spaceport for a Tiny or Small ship. For a Medium or larger ship, multiply the amount by the **[Starship Size Equipment Cost](#Starship%20Size%20Equipment%20Cost)** table.\r\n\r\nFor Large and larger ships, docking on planet is impractical. Typically, most civilized planets will have docking station in space that the characters can dock to. Alternatively, if they don't need to refuel or restock, they can simply remain in orbit and bypass any docking fees, while the party themselves transfer to the planet's surface in a smaller transport.\r\n\r\n#### Long Term Storage\r\nLong-term storage is available in some locations, averaging around 200 credits per month for a Tiny or Small ship. For a Medium or larger ship, multiply the amount by the **[Starship Size Equipment Cost](#Starship%20Size%20Equipment%20Cost)** table.\r\n\r\nAgain, it is impractical for a Large or larger ship to to be stored on planet. At large shipyards, long term storage might be available.\r\n\r\nIt generally requires about eight hours to get a ship out of long-term storage and ready for flight.\r\n\r\n## Refueling and Restocking\r\nAll ships require fuel to operate; without it, a ship is effectively disabled. In general, most starships refuel each time they put into port, and during refueling other essential ship consumables (such as water and oxygen) are restocked as well.\r\n\r\n### Refueling\r\nShips consume fuel in terms of \"units\", the quantity of which varies by the size of the ship. A ship uses a unit's worth of fuel for one day of flight in realspace or hyperspace, after one hour of flight in atmosphere, or in a single jump to hyperspeed. Costs for a unit's worth of fuel can be found below on the **[Starship Size Fuel Cost](#Starship%20Size%20Fuel%20Cost)** table.\r\n\r\n##### Starship Size Fuel Cost\r\n|Starship Size|Fuel Cost|\r\n|:--|--:|\r\n|Tiny|25 cr/unit|\r\n|Small|50 cr/unit|\r\n|Medium|100 cr/unit|\r\n|Large|1,000 cr/unit|\r\n|Huge|10,000 cr/unit|\r\n|Gargantuan|100,000 cr/unit|\r\n\r\nAdditionally, a ship can store an amount of fuel, as determined by its size, in the **[Starship Size Fuel Capacity](#Starship%20Size%20Fuel%20Capacity)** table below.\r\n\r\n##### Starship Size Fuel Capacity\r\n|Starship Size|Fuel Capacity|\r\n|:--|--:|\r\n|Tiny| 5 units|\r\n|Small| 10 units|\r\n|Medium| 30 units|\r\n|Large| 300 units|\r\n|Huge| 600 units|\r\n|Gargantuan| 1,800 units|\r\n\r\n#### Primary Systems\r\nWhen a ship refuels, their primary systems, such as electricity and life support, are also replenished. As long the starship has fuel remaining, primary systems function. \r\n\r\n### Restocking\r\nShips store food and beverage in terms of \"portions\", the quantity of which varies by the size of the ship. Each living creature aboard a ship consumes one portion per day spent aboard the ship. A portion costs 10 credits. \r\n\r\n##### Starship Size Food Capacity\r\n|Starship Size|Food Capacity|\r\n|:--|--:|\r\n|Tiny| -|\r\n|Small| 10 portions|\r\n|Medium| 120 portions|\r\n|Large| 240,000 portions|\r\n|Huge| 9,600,000 portions|\r\n|Gargantuan| 576,000,000 portions|","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"5","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Generating Encounters","chapterNumber":10,"contentMarkdown":"# Chapter 10: Generating Encounters\r\n\r\nCreating interesting starship encounters can be a challenging task. Unlike in character-based encounters, DMs are limited by the more constrained nature of space combat: The heroes are confied to an environment that might limit their abilities, and coming up with encounters that do more than just pit two squads of starfighters against one another takes more work. Despite this, creating an exciting starship combat encounter can make an adventure much more memorable, encouraging players to become just as involved as they would be in ground-based encounters.\r\n\r\nOne of the most important elements of a good starship encounter is giving each player something to do. Gunners should have plenty of targets, a goal that is relatively easy to accomplish. Pilots should have obstacles to maneuver around and ships to fly past, making the environment of the encounter very important. Character combat holds players' interests because each player has something to do in every round. Engaging players in the same manner during a starship combat encounter requires the Gamemaster to design aspects of the encounter that give every player something to do in every round.\r\n\r\nDesigning a starship encounter that keeps several players active on every turn can be daunting. An alternative solution is to create encounters that encourage players to fly their own starships. For example, in a party of four characters, one character might serve as the pilot of the party's freighter, one character might serve as the gunner aboard that freighter, and the other two would pilot starfighters in the same encounter. This gives three players -- the three pilots -- the ability to move and attack in each round, just as they would in character combat. Even characters untrained in the Piloting skill can perform basic movement and actions, and trained pilots can help protect those untrained pilots during starship combat.\r\n\r\n## Give Objectives Other Than Destruction\r\nOne of the best ways to make a starship combat encounter more engaging is to give players an objective other than simply eradicating the opposition. Although destroying one's opponents can certainly be a key component in accomplishing that objective, it doesn't necessarily have to be all of it (and, in fact, it rarely is). When designing an encounter, try to pick an objective that allows the heroes to engage their enemy in combat while giving them some other goal to focus on. A goal other than all-out destruction also encourages the players to be more cautious and think tactically rather than just going in guns ablaze. Just as you might not have character combat just for combat's sake, starship combat encounters should serve the purpose of moving the plot forward.\r\n\r\n### Escort Missions\r\nOne option for an alternative objective is an encounter in which the players are required to protect something or someone. Escort missions are common among starship pilots in the *Star Wars* setting, and providing the players with the goal of protecting something from coming to harm means that the players will have to do more than just unleashing their weapons. Protecting something requires more tactical awareness while still allowing for high action and dogfighting that makes space combat exciting. The players might be escorting a ship through hostile territory, defending a transport as it's being loaded, or keeping enemy vessels from detecting a secret base.\r\n\r\n### Blockade Run\r\nAlternatively, not all encounters can be won by destroying your enemies; the players might simply be trying to get from one place through another through a series of encounters. The players might be trying to maneuver through a large scale battle toward a specific target, attempting to penetrate the core of a space station, or simply trying to avoid being captured or destroyed.\r\n\r\n### Base Assault\r\nFurthermore, you could have your players use their starship to assault a planetary base. Rather than just dogfighting, they might assault a compound featuring turbolaser batteries and walkers.\r\n\r\n### Retrieval Mission\r\nFinally, the players might have to task of obtaining something during a starship encounter. This could be a job as simple as using a tractor beam to drag away a derelict ship, or it might involve the heroes actually landing somewhere, obtaining an item, and rejoining the fight. In some cases, the object in question might be a hostile starship, requiring the heroes to disable rather than destroy. \r\n\r\n## Build Interesting Battlefields\r\nAnother key element of good space combat encounters is creating combat arenas that are interesting. Certainly, encounters involving two groups of ships engaging one another in open space can be fun, but adding a certain element of environmental challenge to the encounter makes it much more memorable. Perhaps while fleeing, the characters must fly through an asteroid belt wrought with peril, their pursuit detonating asteroids in an attempt to disable them. Just as in character-scale combat, adding terrain features to space battles creates more lively combat sequences that require creativity and tactical thinking on the part of the players.\r\n\r\nThe presence of environmental obstacles also creates a more dynamic battlefield, adding another dimension to the placement and movement of starships. Terrain challenges in space combat necessitate movement and encourage players to be more creative in their actions. The following terrain hazards can be part of any space combat sequence.\r\n\r\n### Asteroids, Debris, and Enclosed Terrain\r\nSpace is a lot less empty than one might think, and an environment that contains asteroids, debris, or enclosure is difficult to move through and can potentially damage a starship. Moving through the space of an object hazard requires an Intelligence (Piloting) check, with a DC equal to the size of the obstacle, as shown in the DC column below. On a failure, the ship takes kinetic damage equal to the Damage column.\r\n\r\n|Size|DC|Damage|\r\n|:--|:--:|--:|\r\n|Tiny|10|1d6|\r\n|Small|14|2d6|\r\n|Medium|18|3d6|\r\n|Large|22|4d6|\r\n|Huge|26|5d6|\r\n|Gargantuan|30|6d6|\r\n\r\n### Damaging Environment\r\nThough most combat takes place in a vacuum, some battle might take place in thick dust clouds, the upper atmosphere of a corrosive gas giant, electromagnetically charged nebulae, or even in close proximity to a star--and any of these features can damage a ship. Each hazard functions differently.\r\n\r\n#### Corrosive Gases\r\nOccasionally encountered in planetary atmospheres and some nebulae, corrosive gases can also be the result of massive industrial accident. If a starship enters a corrosive gas field or starts its turn there, the crewmember at the helm must make a DC 12 Intelligence (Piloting) check. A starship takes 1d6 kinetic damage on a failed check, or half as much on a successful one.\r\n\r\n#### Dust Clouds\r\nUsually encountered as a part of an asteroid field, or as a part of a planetary ring system, light and moderate dust clouds provide very poor visibility. While in a dust cloud, a starship is considered *heavily obscured*.\r\n\r\n#### Ionic Discharges\r\nSome nebulae and planetary atmospheres produce nearly continuous discharges of ionic particles. If a starship enters an ionic discharged area or starts its turn there, the starship takes pulse damage equal to half the maximum value of the ship's Hit Die.\r\n\r\n#### Radiation\r\nIn close proximity to a star or other source of intense electromagnetic radiation, a starship can take substantial damage. Generally, these hazards will cover a large radius, but you might designate some areas as being in the shadow of a planet or moon, negating the effects of the radiation. If a starship enters a radiation proximity or starts its turn there, the starship takes 1 energy damage.\r\n\r\n## Create Exciting Scenarios with Complications\r\nOne of the best ways to create tension in a space combat sequence is to present complications that affect the way combat takes place. Although battles in which starships simply square off agains one another are fine, a battle with some larger complication can increase the level of tension and excitement. Complications are factions that affect combat without affecting the battlefield itself.\r\n\r\nOne of the most often-used complications is a time constraint. Placing a limit on the amount of time--in rounds or otherwise-- that the players have to complete their tasks creates a sense of urgency that makes space combat more exciting. For instance, attacking a superweapon before its weapon fires, or attempting to incapacitate an enemy ship before it makes the jump to hyperspace.\r\n\r\nSimilarly, limiting the perception or communication of combatants can add an air of the unknown to an encounter. In addition to terrain that impairs visibility, you might include a jamming field that prohibits ships from communicating with each other, or a sensor scrambler that imposes disadvantage on Piloting checks as the ship's onboard computers struggle to clear out the interference.\r\n\r\n### NPC INITIATIVE\r\nAt the beginning of every combat, PC ships typically role group initiative.  NPC ships may be large in number and/or have huge numbers of NPCs manning them, so a GM should generally determine NPC initiative by rolling for each ship individually as follws.  Roll initiative by making a ship Dexterity check modified by the number given in the Initiative Size Modifier table below. \r\n\r\n#### Initiative Size Modifier\r\n\r\n|Ship Size|Initiative Size Modifier|\r\n|:--:|:--:|\r\n|Tiny|\t0|\r\n|Small|\t-3|\r\n|Medium|-7|\r\n\r\n|Ship Size|Initiative Size Modifier|\r\n|:--:|:--:|\r\n|Large\t|-9|\r\n|Huge\t|-10|\r\n|Gargantuan|-11|\r\n\r\n> Encounter Creation and Ship Rating (analogous to Challenge Rating for creatures) needs to be rewritten. It will require a decent amount of maff on my end, so it's not ready yet. For the time being, have your GM use common sense to dictate what is an appropriate encounter.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"10","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Introduction","chapterNumber":0,"contentMarkdown":"# Introduction\r\n\r\nThe *Star Wars* 5th Edition roleplaying game is about storytelling in worlds of lightsabers and the Force. It shares elements with childhood games of make-believe. Like those games, SW5e is driven by imagination. It's about picturing the towering AT-AT beneath the stormy night sky and imagining how a squad of rebel troops might overcome the challenges that scene presents.\r\n\r\nThis book is designed to add another significant layer to your SW5e experience. The rules are designed to work alongside the traditional SW5e ruleset, and so an experienced player should have no trouble jumping right into the book. For the less experienced-or more curious-player, this Introduction discusses the basics.\r\n\r\n**Game Master (GM):** As your ship exits hyperspace above the moon of Nar Shaddaa, you see a series of snubfighters move to approach your freighter in an offensive formation. Several other craft go about their business in the vicinity, paying no attention to your potential predicament.\r\n\r\n**Rickey (playing Vinto):** I want to hail them and see what their intentions are.\r\n\r\n**Drew (playing Dash):** I'm going to go man the dorsal gun, just in case.\r\n\r\n**Erik (playing Kodo):** ...\r\n\r\nUnlike a game of make-believe, D&D gives structure to the stories, a way of determining the consequences of the adventurers' actions. Players roll dice to resolve whether their attacks hit or miss or whether their starship can scale a skim the surface of a star destroyer, break the lock on a concussion missile, or pull off some other dangerous task. Anything is possible, but the dice make some outcomes more probable than others.\r\n\r\n**Game Master (GM):** OK, one at a time. Rickey, you're hailing the newcomers?\r\n\r\n**Rickey:** Yeah. Do they respond?\r\n\r\n**GM:** Make a Charisma check.\r\n\r\n**Rickey:** Does my Persuasion skill apply?\r\n\r\n**GM:** Sure!\r\n\r\n**Rickey (rolling a d20):** ... Four.\r\n\r\n**GM:** You can hear the click of static, but no voice responds to you. And Drew, Dash is manning the dorsal gun?\r\n\r\n**Drew:** Yup!\r\n\r\n**GM:** Okay. Eric, what's Kodo doing?\r\n\r\n**Eric:** ...\r\n\r\nIn the *Star Wars* Dungeons and Dragons game, each player creates an adventurer (also called a character) and teams up with other adventurers (played by friends). Working together, the group might obtain a freighter and take to the stars, expanding the scope and potential of their game. They might become pirates, the scourge of the Outer Rim, or they may accept missions from a leading faction. They may become smugglers, taking jobs as they see fit, or become bounty hunters in the employee of a powerful hutt.\r\n\r\nOne player, however, takes on the role of the Game Master (GM), the game's lead storyteller and referee. The GM creates adventures for the characters, who navigate its hazards and decide which paths to explore. The GM might describe an ongoing naval battle, and the players decide what they want their adventurers to do. Will they choose a side and join in the combat? Will they attempt to mediate a truce? Or will they simply choose a new destination?\r\n\r\nThen the GM determines the results of the adventurers' actions and narrates what they experience. Because the GM can improvise to react to anything the players attempt, D&D is infinitely flexible, and each adventure can be exciting and unexpected.\r\n\r\nThe game has no real end; when one story or quest wraps up, another one can begin, creating an ongoing story called a **campaign**. Many people who play the game keep their campaigns going for months or years, meeting with their friends every week or so to pick up the story where they left off. The adventurers grow in might as the campaign continues. Each force defeated, each adventure completed, and each relic recovered not only adds to the continuing story, but also earns the adventurers new capabilities. This increase in power is reflected by an adventurer's level and deployment rank, as well as their starship's tier.\r\n\r\nThere's no winning and losing in the *Star Wars* Dungeons and Dragons game�at least, not the way those terms are usually understood. Together, the GM and the players create an exciting story of bold adventurers who confront deadly perils. Sometimes an adventurer might come to a grisly end, dispatched by a Sith lord. The party itself might meet its demise should it bite off more than it can chew in a starship encounter. Even so, the other adventurers can beseech a powerful Jedi to revive their fallen comrade, or the players might choose (or be forced) to create new characters to carry on. The group might fail to complete an adventure successfully, but if everyone had a good time and created a memorable story, they all win.\r\n\r\n## Take to the Stars\r\nOne of the premier components of *Star Wars* 5th Edition, versus a traditional Dungeons and Dragons campaign, is the wide variety of planets a character can visit and explore. To facilitate and encourage that experience, adventurers need a means to travel.\r\n\r\nPublic transportation exists, and players can simply pay someone else to transport them if they so desire. Alternatively, you can elect to keep the scope of a campaign small, and limit it to one or two planets. It would be easy to run a game on Coruscant, with its myriad cultures and territories, without the players having to venture offworld.\r\n\r\nBut if your players want to journey among the stars, this book is designed to those ends.\r\n\r\n## Using This Book\r\n*Starships of the Galaxy* is divided into ten chapters.\r\n\r\n**Chapters 1-6** are about taking your SW5e character, adopting a deployment, and designing a ship. It includes information on the six main deployments, the six ship size classifications, ship upgrades, ship equipment, and the customization options that you can choose from. Many of the rules in these chapters rely on material found later in the book. If you come across a game concept that you don't understand, consult the book's table of contents.\r\n\r\nFor initial encounters, you can generally skip these chapters by running characters without a deployment and by utilizing a pre-generated stock ship.\r\n\r\n**Chapters 7-9** detail the rules of how to run the space portion of the game, beyond the basics described in this introduction. These chapters covers where the rules deviate from the ground game, and where they remain the same. \r\n\r\n**Chapter 10** is for GMs, and covers the rules for generating encounters and ships, as well as the stats for stock ships off which players can build.\r\n\r\n## How to Play\r\nGenerally, the space game runs almost identical to the ground. The GM still describes the environment, and the players describe what they want to do. The GM then narrates the results of of the adventurers' actions.\r\n\r\n> #### Space Versus Ground\r\n> The most important distinction here is the scaling down of the dice. An X-wing's laser cannon deals 1d6 to an enemy X-wing. The perspective for damage here is space. If you need to scale ships to the perspective of players, you want to scale the damage, hit/hull points, shield points, damage reduction, and shield regeneration rate of ships by 10, and vice versa. For Instance, an X-wing's primary weapon may deal 1d6 to ships, but would deal (1d6)x10 to a player, while a player's explosion power would instead deal (8d6)/10 damage (round down) to the X-wing.\r\n>Because of their size and durability, some GMs may rule that Large and larger ships are simply immune to damage from small arms fire.\r\n>Additionally, a Tiny starship is Tiny on the space scale, but Huge on the ground scale. Consequently, a Small ship is Gargantuan on the ground scale. Medium and larger ships would be considered colossal.\r\n>Because starships are not primarily designed to fight individual creatures, Tiny-Large Starships have disadvantage on attacks versus Large and smaller creatures (and such creatures have advantage on saves caused by these ships' weapons).\r\n\r\n### Game Dice\r\nThe game uses the same polyhedral dice with different numbers of sides, referenced in the same fashion; the different dice are referred to by the letter d followed by the number of sides: d2, d4, d6, d8, d10, d12, and d20. \r\n\r\n### The D20\r\nThe same d20 that a Jedi uses to swing his lightsaber is used for firing a ship's weapons. The biggest deviation here is that when a player fires a ship weapon, they use the player's proficiency bonus, *but the ship's Wisdom bonus*. The reason for this is two-fold:\r\n\r\n**1. In the ground game, some Ability scores are stronger than others.** Since this ruleset is designed to enhance the way the game is played, one character should not be penalized for being slightly different from another character.\r\n\r\n**2. How accurate a ship's weapons are is modified by the ship's targeting system.** A ship with a higher Wisdom is more capable of accurate targeting than a ship with a low Wisdom, consequently yielding a greater likelihood of accuracy.\r\n\r\nThis and other deviations will be discussed at greater length in **Chapter 7: Using Ability Scores**.\r\n\r\n### Advantage and Disadvantage\r\nAdvantage and Disadvantage function identical to the ground game; with advantage, you roll two dice and take the higher value, while with the disadvantage you roll two dice and take the lesser.\r\n\r\n### Specific Beats General\r\nIn the same vein, while latter chapters contain broad strokes for the game's rules, certain deployment or ship features override those rules, creating an exception to how the rest of the game works. Remember this: if a specific rule contradicts a general rule, the specific rule wins.\r\n\r\n### ROUND APPROPRIATELY\r\nFollow standard rules for rounding; if a number ends in one-half or greater, round up, while if a number ends in less than one-half, round down.\r\n\r\n## What It Brings\r\n**Starships of the Galaxy** is designed to be an *in addition to* rather than *instead of*. The rules here, predominantly, function identically, or analogously, to the ground game, but the features and boons achieved here are designed to be kept separate. While features of the ground game, such as your characters' species, classes, backgrounds, and customization options impact your character's prowess in the space game, the space game should not affect your characters in the ground game. \r\n\r\nAs always, there might be some exceptions to this rule; for instance, many of the suite options offer bonuses that affect the ground game, and players can use their ship to assault a stronghold that their characters might not be able to conquer on their own. Ultimately, the cross over is up to the GM to adjudicate.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"0","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Modifications","chapterNumber":4,"contentMarkdown":"# Chapter 4: Modifications\r\n\r\nAs soon as heroes get theirs hands on a starship,    they want to modify it. The desire for faster hyperdrives, more weapons, better shields, and possibly even some space for smuggled goods generally comes before the first payment to a Hutt loan shark is due. Upgrading and modifying a starship gives players a sense of ownership that makes them more connected to a campaign, and it serves other useful purposes as well.\r\n\r\nHeroes who want to improve a starship have a built-in reason to take risks to earn credits (or other re-wards, such as the use of the repair bay of a grateful military group). Although *Star Wars* focuses on on heroic action-adventure over the cobbling together of credits for tinkering with a ship, many characters are simply more motivated if they know there's a material reward on the line. Furthermore, a starship acts as a base of operations, allowing heroes to have a place that seems like home even as they gallivant across the galaxy. Finally, as the heroes gain levels, a better-equipped ship prepares them for greater challenges.\r\n\r\n## Modifying a Starship\r\nWhen ships are produced, they are left with extra space, superstructure, and power production to facilitate the addition of new system modifications and suites. In addition to the costs associated with acquiring raw materials, components, and installation, each modification consumes one of a ship's modifi-cation slots. This section details all of the system mod-ifications available to a ship. There are five categories of modifications, discussed later in this chapter.\r\n\r\nWhen players acquire a new ship, it typically comes with minimal modifications already installed. Players then choose the modifications they want installed on their ship. Like construction and upgrading, installing new systems and modifying old ones takes materials, time, and a substantial workforce. Even with the requisite components, the GM may decide that a modification is inaccessible; it might only be obtainable if the heroes get hold of it directly, by recovering it from a supply depot, trading it off of a collector, or stealing it from the manufacturer. \r\n\r\nThe cost of a modification depends on its category, as shown below in the **Modification Category Cost** table.  These costs reflect the material and personnel costs of assembling and installing a modification, and would be directly reflected in the increased cost of a ship bought with these modifications pre-installed. However, if PCs can provide the workforce to install the modification and invest their time, the final costs incurred to add a modification are only half that shown (just the material cost of an assembled modification). Moreover, one or more PCs can assemble a modifi-cation without the ship's presence being required by spending an amount of time assembling based on the material cost of the assembled modification (half the total installed cost) and by using raw materials equal to half the material cost of the installed modification (one-quarter the total installed cost).\r\n\r\nFor example, a crew could acquire raw materials equal to 1000cr and assemble a Universal modification for a small ship (having a total installed cost of 4000cr). The material cost of the modification would then be 2000cr. Then, the crew could install that modification in a small ship for a final installed cost for the Universal modification of 4000cr. Alternatively, the crew may have found this assembled modification as loot worth 2000cr and could hire a shipyard to install the modifi-cation by paying just the installation portion (2000cr) of the total installed cost (4000cr). Any combination of this process is feasible.\r\n\r\n##### Modification Category Base Cost\r\n| Modification Category | Base Cost |\r\n|:----|----:|\r\n| Engineering  | 3,500 cr |\r\n| Operation | 3,500 cr |\r\n| Suite | 5,000 cr |\r\n| Universal | 4,000 cr |\r\n| Weapon | 3,000 cr |\r\n\r\n### Size Modifiers\r\nIn the same way it costs more to upgrade a capital ship than a starfighter, it costs more to modify it as well. Each starship has a cost modifier depending on the ship's size, as shown in the [Starship Size Modification Cost](#Starship%20Size%20Modification%20Cost) table below:\r\n\r\n##### Starship Size Modification Cost\r\n| Starship Size | Cost Modifier |\r\n|:----:|:-------------:|\r\n| Tiny  |x 0.5 |\r\n| Small |x 1 |\r\n| Medium|x 2 |\r\n| Large |x 5 |\r\n| Huge |x 50 |\r\n| Gargantuan |x 500 |\r\n\r\nFor instance, to purchase and install a Hardpoint in a Small ship, it costs 3,000 credits. To purchase and install one on a Huge ship, however, it costs 150,000 (3,000 x 50).\r\n\r\nFor a Small ship, two people can do everything necessary (though additional staff will reduce the time taken), while Medium or larger ships require a more extensive workforce, as shown below in the [Starship Size Modification Workforce](#Starship%20Size%20Modification%20Workforce) table.\r\n\r\n##### Starship Size Modification Workforce\r\n| Starship Size | Minimum Workforce |\r\n|:----:|:----:|\r\n| Tiny  | 1 |\r\n| Small  | 2 |\r\n| Medium  | 4 |\r\n| Large  | 10 |\r\n| Huge | 100 |\r\n| Gargantuan | 1,000 |\r\n\r\n### Modification Slots\r\nThe number of modifications that a ship can easily accommodate is based on the ship's size, as shown below in the [Modification Capacity by Ship Size](#Modification%20Capacity%20by%20Ship%20Size) table.\r\n\r\n#### Modification Capacity by Ship Size\r\n\r\n| Starship Size | Modification Slots |\r\n|:----:|:----:|\r\n| Tiny  |10 |\r\n| Small |20 |\r\n| Medium |30 |\r\n| Large |50 |\r\n| Huge |60 |\r\n| Gargantuan |70 |\r\n\r\nHowever, if you lack sufficient modification slots to support a modification, you can still add it, if you are willing to spend more time and credits for installing all the space and subsystems required to support the modification.  For every modification slot you manually add to your ship, add 50% to the [Modification Category Base Cost](#Modification%20Category%20Base%20Cost).  Additionally, for every modification you install over your modification capacity, add a cumulative 2 to the installation DC for a tiny to medium ship, and a cumulative 1 to the installation DC for a large to gargantuan ship.\r\n\r\n### Modification Time\r\nWith sufficient workforce, a snubfighter can be modified in no more than a week's time. However, a new modification layout in a freighter can take up to a month, and an overhaul of a large ship such as a cruiser might take a year. It isn't practical for a smaller workforce to make changes to such big ships, regardless of how much time the workers have.\r\n\r\nBecause workers generally craft at a rate of 250cr/day, the base time needed to modify a starship is calculated as follows:\r\n\r\n___\r\n\r\n**time (in days) = (\"[Modification Category Base Cost](#Modification%20Category%20Base%20Cost)\" x \"[Starship Size Modification Cost](#Starship%20Size%20Modification%20Cost)\") / (250 x \"size of workforce\")**\r\n\r\n___\r\n\r\nFor instance, to install a Hardpoint in a Small ship, with a workforce of two, it takes six days. To install one on a Huge ship, with a workforce of 100, however, it also takes six days.\r\n\r\nIt is assumed that each member of the workforce works 8 hours per day.\r\n\r\n### Modification Grade And Ship Tier\r\nFinally, modifications have a grade (0 if not listed).\r\nHigh-grade modifications are more costly, using scarce\r\nmaterials to construct and install. When purchasing\r\nand installing a modification with a listed grade,\r\nmultiply the final cost of the modification by the\r\nmodification’s grade, if Grade 1 or higher. As an example, a Grade 2 modification would\r\nhave two times the final cost of a Grade 0 or 1 modification. \r\n\r\nAdditionally, these modifications require more precise skill to install, as shown below in the [Modification Grade Installation by Ship Tier](#Modification%20Grade%20Installation%20by%20Ship%20Tier) table. However, ships of higher quality (high tier) make it easier to install these high-quality (high grade) modifications.  \r\n\r\n### Modification Installation Check\r\nWhen making a modification, the foremost mechanic must make an Intelligence (Mechanic’s Kit) check to correctly install modifications. A GM may decide to assume that this check is automatically passed when a party contracts out the instalation of a modification to a shipyard adequately equipped to routinely handle such an installation. The DC for the check varies based on the grade of the modification and the tier of the ship, as shown below in the [Modification Grade Installation by Ship Tier](#Modification%20Grade%20Installation%20by%20Ship%20Tier) table below.\r\n\r\n##### Modification Grade Installation by Ship Tier  \r\n|Modification Grade|Tier 0|Tier 1|Tier 2|Tier 3|Tier 4|Tier 5|\r\n|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|\r\n|**Grade 0**| 10|  9|  8|  7|  6|  5|\r\n|**Grade 1**| 17| 12| 11| 10|  9|  8| \r\n|**Grade 2**| 24| 19| 14| 13| 12| 11| \r\n|**Grade 3**| 31| 26| 21| 16| 15| 14| \r\n|**Grade 4**| 38| 33| 28| 23| 18| 17| \r\n|**Grade 5**| 45| 40| 35| 30| 25| 20| \r\n\r\nOn a failure, half the requisite time and cost is incurred, but the modification is not installed.\r\n\r\n### Prerequisites\r\nSome modifications have prerequisites that must be met before they can be installed. \r\n\r\nIf at any time you lose access to a modification's prerequisite, such as removal or ship damage, you can't use that modification again until you regain access to the prerequisite.\r\n\r\n### Ability Score Maximums\r\nIf a tier feature or modification would increase an ability score above its maximum without also increasing that maximum, you can instead allocate that additional ability score increase to another ability score.\r\n\r\n### Changing Saving Throw Proficiency\r\nWhen a starship is created, a saving throw proficiency may be chosen from a list available to the starship. Later on, however, players may want to change their starship's saving throw proficiency to another of the available options. Changing a saving throw proficiency requires time and credits as if installing a new universal modification.\r\n\r\n### Removing Modifications\r\nSometimes, characters might decide they want to remove a modification in favor of a new one. Removing a modification requires half the cost it takes to install the modification originally, and takes half the time.\r\n\r\n### Removing Tiers\r\nSometimes, characters might decide they want to change a selection made for a starship tier feature. To do so, they must remove the tier from the ship, reducing the ship's tier by one. Doing so removes all features from the ship earned at the new tier, including Ability Score Improvements, additional Hull and Shield Dice, and additional modifications.\r\n\r\nRemoving a starship tier requires half the cost it takes to upgrade to that tier, and takes half the time.\r\n\r\nIf upgrading the ship to the tier again at the same time as removal, the additional time to remove is incurred, but the cost to remove is not required.\r\n\r\n### Starship Tier Features\r\nIf a modification is granted to your starship by a starship tier feature, such as the Role Specialization feature, that modification does not require an Intelligence (Mechanic's Kit) check, comes at no additional cost, does not take a modification slot or count against your ship's maximum suites--unless otherwise stated-- and you can't voluntarily remove it. If your starship already has that modification, you may install an additional modification that is available to you and of equal or lesser grade instead.\r\n\r\n### Stock Modifications\r\nAlso at tier 0, each ship comes with a number of modifications, at no additional cost, depending on its size, as shown in chapter 3. These modifications do take up modification slots.\r\n\r\n## Modification Categories\r\nThere are five categories of modification. Each category has separate rules governing its use.\r\n\r\n### Engineering Systems\r\nThese modifications offer unique functionality to the ship. Each engineering system can be chosen multiple times.\r\n\r\n### Operation Systems\r\nThese specialized modifications aid in the operation and response of the ship. Each operation system can be chosen only once.\r\n\r\n### Suite Systems\r\nSuite systems add additional functionality to the ship in the form of bays, stations and designated areas, offering increased utility to civilians, crewmembers, and troopers. Each suite system can be chosen no more than ten times. All suite systems require a ship of size Small or larger. In addition to their modification slot cost, ships are limited to the number of suite systems they can have, depending on the ship's size and constitution modifier, as shown below in the [Starship Size Maximum Suites](#Starship%20Size%20Maximum%20Suites) table.\r\n\r\n##### Starship Size Maximum Suites\r\n| Starship Size | Maximum Suites |\r\n|:----:|:----:|\r\n| Tiny  | — |\r\n| Small  | -1 + con. mod. |\r\n| Medium  | 3 + con. mod. |\r\n| Large  | 3 + 2x con. mod. |\r\n| Huge | 6 + 3x con. mod. |\r\n| Gargantuan | 10 + 4x con. mod. |\r\n\r\nAdditionally, unless otherwise specified, each suite system can accommodate a standard number of civilians, crewmembers, or troopers, as shown below in the **[Starship Size Suite Capacity](#Starship%20Size%20Suite%20Capacity)** table.  A ship does not gain a feature that accommodates less than 1.\r\n\r\n##### Starship Size Suite Capacity\r\n| Starship Size | Suite Capacity |\r\n|:----:|:----:|\r\n| Tiny  | — |\r\n| Small  | 1 |\r\n| Medium  | 4 |\r\n| Large  | 400 |\r\n| Huge | 4,000 |\r\n| Gargantuan | 40,000 |\r\n\r\n### Universal Systems\r\nThese modifications offer passive benefits to the ship as a whole. Each Universal System can be chosen only once.\r\n\r\n### Weapon Systems\r\nThese modifications deal with the installation and improvement of weapon systems. Each weapon system can be chosen multiple times.\r\n\r\nA ship is proficiently equipped by having the weapon system installed, therefore any crewmember using a system can add their proficiency bonus when the weapon system indicates.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"4","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Starships","chapterNumber":3,"contentMarkdown":"# Chapter 3: Starships\r\n\r\nCharacters are nothing without their ships, which serve as a great source of inspiration and motivation for their adventures. The starship can even be the adventure itself.\r\n\r\nThe first step is acquisition.\r\n\r\n## Acquiring a Ship\r\nMany parties might see fit to merely obtain passage on a vessel as a part of their adventures, and there's nothing wrong with that. Others will want to obtain their own ships as fast as possible as it is a core component to their character. It is at the discretion of the GM to determine when a party should obtain their first starship using one of the following options.\r\n\r\n### Joining a Faction\r\nJoining a large faction, such as the Galactic Republic or the Empire might merit the acquisition of a personal starship. Generally, the faction still owns the ship and allows the party to use it as long as they are in accordance with the faction's wishes. Refusing missions or violating the faction's rule may lead to disavowment, pursuit, and eventual repossession of the ship. \r\n\r\n### Shipjacking\r\nThe most nefarious (and frankly most enjoyable) way to acquire a starship is to steal one. Shipjacking is an old and extremely dangerous profession. Starport authorities (as well as the original owners) are constantly on the lookout for stolen ships, and if the heroes fail to adequately falsify documentation identifying themselves as the ship's owners, they can find themself in an uncomfortable position.\r\n\r\n### Purchasing\r\nThe most common method of acquiring a ship is by purchasing. The cost of a brand new \"stock\" starship can be found below, on the **[Starship Size Stock Cost](#Starship%20Size%20Stock%20Cost)** table.\r\n\r\n#### Starship Size Stock Cost\r\n| Starship Size | Tier 0 Cost|\r\n|:----:|----:|\r\n| Tiny  | 12,500 cr|\r\n| Small  | 25,000 cr|\r\n| Medium  | 75,000 cr|\r\n| Large  | 500,000 cr|\r\n| Huge | 100,000,000 cr|\r\n| Gargantuan | 1,000,000,000 cr|\r\n\r\nHow the players afford the ship varies as well. They may be patient, earning the credits to make the purchase over time. Alternatively, they might seek a backer, or a loan through a financial institution.\r\n\r\n> Newly constructed starships come with a number of vacant modification slots, which can be filled with modifications, which are discussed in Chapter 4.\r\n\r\n#### Financing\r\nThe party could seek a loan from a bank to purchase a starship. Generally, 20% of the starship's cost is required as a down payment, with monthly pay-ments equal to 2% of the cost for the following five years. \r\n\r\n#### A Wealthy Sponsor\r\nAlternatively, the party may work for a wealthy individual or group, such as an aristocrat. Convincing such an individual to finance you, however, can be quite the adventure in-and-of itself. Can the party prove that the relationship will be mutually beneficial?\r\n\r\n#### Loan Sharks\r\nAs a more dangerous option, a loan shark or an afflu-ent gangster could finance a ship. Usually requiring less money up front, this loan has steeper loan pay-ments (~10% of the total cost each month for 3 years).\r\n\r\n### Building a Ship\r\nBuilding a ship is generally cheaper than buying it, but takes time and necessitates use of a shipyard and a substantial workforce. If players elect to build a stock starship instead of purchasing one, it requires half the cost of the finished ship in facilities, raw materials, and labor.  The minimum workforce size is shown below on the **Starship Size Construction Workforce** table.  Ship construction also has a maximum practical workforce, beyond which no time gains are readily made.\r\n\r\n#### Starship Size Construction Workforce\r\n| Starship Size | Min. Workforce | Max. Workforce |\r\n|:----:|:----:|:----:|\r\n| Tiny  | 3 | 18 |\r\n| Small  | 5 | 30 |\r\n| Medium  | 10 | 60 |\r\n| Large  | 100 | 600 |\r\n| Huge | 1,000 | 6,000 |\r\n| Gargantuan | 10,000 | 60,000 |\r\n\r\nBecause workers generally craft at a rate of 250cr/day, the base time it takes to build a ship is:\r\n\r\n___\r\n\r\n**time (in days) = (\"[Starship Size Stock Cost](#Starship%20Size%20Stock%20Cost)\") / (500 x \"size of workforce\")**\r\n\r\n___\r\n\r\nFor instance, to build a Small ship, with a workforce of 5, would take 20 days. To build a Huge ship, with a workforce of 1,000, however, would take 400 days [100,000,000 / (250 x 1,000)].\r\n\r\nIt is assumed each member of the workforce works 8 hours per day.  A workforce more than double the min-imum workforce must work in shifts for further gains.\r\n\r\n### STOCK MODIFICATIONS\r\nAt construction, your ship comes with a number of stock modifications that you can choose from. These modifications must be Grade: 0 modifications. Although they come without cost, they do count against your maximum modification slots and your maximum suite systems.\r\n\r\n## Upgrading a Starship\r\nOnce the party has acquired a ship, they can add equipment and modifications to it and upgrade its basic systems. Upgrading a ship is a matter of workforce, time, and skill. This assumes the starship you are upgrading has no missing hull points or damaged systems, the requisite resources and tools are freely available, and you are docked at a spaceport or shipyard. Under less optimal conditions the time, money, and skill required could be increased by as much as 100%, or be ruled impossible by the GM.\r\n\r\n### Upgrading a Ship's Tier\r\nIn addition to the cost of modifications and equipment, players can invest credits into their starship's basic systems, increasing the tier of the ship. As a player increases the tier of their starship, they unlock add-itional Hull and Shield Dice, and unique size-specific features. The material and personnel costs in credits that a party must invest in their ship varies based on the tier they are trying to obtain, as show below in the **[Base Upgrade Cost by Tier](#Base%20Upgrade%20Cost%20by%20Tier)** table. The costs detailed here include hiring the required workforce. However, if PCs can provide the workforce directly and invest their time, the final costs incurred are only half that shown.\r\n\r\n#### Base Upgrade Cost by Tier\r\n| Tier | Cost in Credits | Description of Rarity |\r\n|:----:|:----:|:----:|\r\n| 0 | 0         | Mass Production (Standard) |\r\n| 1 | 3,900     | Modified (Premium) |\r\n| 2 | 77,500    | Fully Customized (Prototype) |\r\n| 3 | 297,000   | Highly Sophisticated Engineering (Advanced) |\r\n| 4 | 620,000   | State of the Art (Legendary) |\r\n| 5 | 1,150,000 | Unique (Artifact) |\r\n\r\n### Cost Modifiers\r\nIt costs more to upgrade the hull of a capital ship than the hull of a starfighter; bigger starships are simply costlier to improve. Consequently, each starship has a cost modifier depending on the ship's size, as shown in the **[Starship Size Upgrade Cost](#Starship%20Size%20Upgrade%20Cost)** table below, which is multiplied by the value for that tier in the **[Base Upgrade Cost by Tier](#Base%20Upgrade%20Cost%20by%20Tier)** table.\r\n\r\n#### Starship Size Upgrade Cost\r\n| Starship Size | Cost Modifier |\r\n|:----:|:-------------|\r\n| Tiny  |x 0.5 |\r\n| Small |x 1 |\r\n| Medium |x 2 |\r\n| Large |x 10 |\r\n| Huge |x 100 |\r\n| Gargantuan |x 1,000 | \r\n\r\nFor instance, to upgrade a Small size ship from Tier 0 to Tier 1, it costs 3,900 credits. To upgrade a Huge size ship from Tier 2 to Tier 3, however, it costs 29,700,000 (297,000 x 100).\r\n\r\n### Upgrade Workforce\r\nAdditionally, bigger ships require more people to perform these upgrades. For a Small ship, a single person can do everything necessary (though additional workers will reduce the time taken), while a Medium or larger ship requires a more extensive workforce, as shown below in the **[Starship Size Upgrade Workforce](#Starship%20Size%20Upgrade%20Workforce)** table below.\r\n\r\n#### Starship Size Upgrade Workforce\r\n| Starship Size | Minimum Workforce |\r\n|:----:|:----:|\r\n| Tiny  | 1 |\r\n| Small  | 1 |\r\n| Medium  | 5 |\r\n| Large  | 50 |\r\n| Huge | 500 |\r\n| Gargantuan | 5,000 |\r\n\r\n### Upgrade Time\r\nWith sufficient workforce, a snubfighter can be upgraded in no more than a week's time. However, upgrading a freighter can take up to a month, and an overhaul of a large ship such as a cruiser might take a year. It isn't practical for a smaller workforce to make changes to such big ships, regardless of how much time the workers have.\r\n\r\nThe base time needed to upgrade a starship is calculated as follows:\r\n\r\n___\r\n\r\n**time (in days) = (\"[Base Upgrade Cost by Tier](#Base%20Upgrade%20Cost%20by%20Tier)\" x \"[Starship Size Upgrade Cost](#Starship%20Size%20Upgrade%20Cost)\") / (500 x \"size of workforce\")**\r\n\r\n___\r\n\r\nFor instance, to upgrade a Small size ship from tier 0 to tier 1, with a workforce of 3, would take 2.6 days. To upgrade a Huge size ship from Tier 2 to Tier 3, with a workforce of 500, however, would take 118.8 days [(297,000 x 100) / (500 x 500)].\r\n\r\nIt is assumed that each member of the workforce works 8 hours per day.\r\n\r\n> Starship features are generally only usable once per round. Once they have been used by a crewmember, they are not available for use again until the start of that crewmember's next turn.\r\n\r\n### Starship Tier Features\r\nOnce players have upgraded a ship to tier 1 or higher, they unlock additional features, determined by the ship's size. \r\n\r\nTier features that grant modifications come at no cost and do not take up a modification slot or count against your ship's Suite Capacity unless otherwise stated.\r\n\r\n### Roles\r\nAt Tier 0, Tier 2, and Tier 4, you will have your choice of abilities to add to your ship by choosing a Role.  These choices allow your ship to become more specialized by gaining an ability exclusive to that Role. \r\n\r\nAt ship construction (Tier 0), your choice of Role grants one or more Ability Score Increases, a base Speed and Turning Speed (see **Chapter 7: Adventuring** for rules on Speed and Turning Speed), and stock equipment.  This stock equipment, like all equipment, may be removed and/or replaced using the rules found in **Chapter 5: Equipment**.\r\n\r\n> #### VARIANT: STARTING EQUIPMENT\r\n> In lieu of the equipment granted by your ship's chosen Role, with your Game Master's permission, you can elect to choose your starting equipment. If you do so, you may substitute equipment of the same category for that given by your Role at Tier 0.  For example, you may choose any one of each of the following for a new ship in lieu of that given by your chosen Tier 0 Role:\r\n> - (a) deflection armor (b) lightweight armor (c) or reinforced armor\r\n> - (a) fuel cell reactor (b) ionization reactor (c) or power core reactor\r\n> - (a) direct power coupling (b) distributed power coupling (c) or hub & spoke power coupling\r\n> Additionally, for Large or Larger ships you may also choose one of the following:\r\n> - (a) directional shield (b) fortress shield (c) or quick-charge shield\r\n\r\nAt each of these tiers you may choose a new Role.  For example, when your advance to Tier 2 with your small ship, you may choose to gain the Attack Fighter bonus (\"your ship gains a +1 bonus to the attack rolls and save DCs of its ship weapons.\") even though, at Tier 0, you had chosen the Shuttle role (granting a +1 to Constitution, various starting equipment, and a base speed/turning speed pair).\r\n\r\n> #### First Time on a Ship?\r\n> For your first time playing on a starship, it is recommended that you ignore Deployment abilities (characters new to ships typically have no Ranks in any Deployments).  This means you will, therefore, be ignoring Reactors and Power Couplings, since these are the parts of the ship responsible for generating and storing the Power Dice that fuel your Deployment abilities.\r\n> New players and GMs, even after adding Deployments (and therefore Power Dice) to their games, may still prefer to play on \"Easy Mode.\"  To keep things as simple as possible, choose a **Fuel Cell Reactor** (which automatically regenerates one Power Die per ship turn) and a **Direct Coupling** (which allows players to ignore which system their Deployment abilities draw Power Dice from, at the cost of fewer maximum dice to use). Additionally, you can leave shields off of your ship completely or, if you decide to include shields for survivability, choose **Directional Shields** for simplicity.\r\n\r\n### Hull Dice\r\nYour ship starts play with one or more Hull Dice, which are analogous to Hit Dice in the ground game.  Tiny ships start with one Hull Die, a d4, while all other sizes of ship start with more than one Hull Die.  For example, a Tier 0 Small ship starts play with 3 Hull Dice, each a d6.  This is analogous to a level 3 character in the ground game.  \r\n\r\nIn order to calculate the ship's starting Hull Points, you take the maximum of the first die (in this case 6) and add the ship's Constitution modifier, and then roll the two remaining Hull Dice (or take the average: 4) and add the ship's Constitution modifier to each roll. \r\n\r\n### Shield Dice\r\nNot all ships have shields, but if your ship has Shields, its Shield Dice are determined by its size and Tier.  For detailed information on Shields, see **Chapter 5: Equipment**.\r\n## Variant: Space Stations\r\nPlayers may decide they want to invest in a space station. Only size categories Large and larger are appropriate for space stations. If players elect to own a space station instead of—or in addition to—a starship, use the following rules. \r\n\r\n#### Armor Class\r\nWhen calculating a space station's armor class, space stations receive a -2 detriment to their AC.\r\n\r\n#### Stock Modifications\r\nYour space station comes with the Central Computer, Makeshift universal system in addition to the other stock modifications.\r\n\r\n#### Flying Speed and Turning Speed\r\nThe station's flying speed become 50 feet and it's turning speed becomes 100 feet, regardless of any bonuses or penalties. The station's flying speed and turning speed can never be increased or decreased.\r\n\r\n#### Hull Points Per Hull Die\r\nFor each Hull Die a space station has, it gains 2 additional hull points.\r\n\r\n#### Hyperspace Travel\r\nYour travel time in hyperspace is doubled.\r\n\r\n#### Modification Installation DC\r\nSpace Stations have a -10 adjustment to the DC to install a modification.\r\n\r\n#### Starship Size Maximum Suites\r\nThe maximum number of suites a station can have (based on their size and constitution modifier) doubles. For instance, a Large ship with a 17 constitution (+3) has a maximum of 9 suites, and a Large station with the same constitution score instead has a maximum of 18 suites.\r\n\r\n## Space Station Tier Features\r\nWhen players upgrade a space station to certain tier levels, they can choose from the following feature options, instead of those available only to starships.\r\n\r\n### Role Specialization\r\nAt 2nd tier, you adopt a particular style of design for your ship. Choose from the following.\r\n\r\n#### Space Station (Large) \r\nYour station gains the Central Computer, Makeshift modification at no cost. Additionally, when a crewmember on your station has to make an Intelligence (Technology) check, if their Intelligence modifier is less than that of the station's Intelligence modifier, they can instead use the station's Intelligence modifier to Technology checks.\r\n\r\n#### Space Station (Huge) \r\nYour station gains the Central Computer, Makeshift; Central Computer, Mark 1; and Comms Package, Premium modifications at no cost. Additionally, when a crewmember on your station has to make an Intelligence (Technology) check, if their Intelligence modifier is less than that of the station's Intelligence modifier, they can instead use the station's Intelligence modifier to Technology checks.\r\n\r\n#### Space Station (Gargantuan) \r\nYour station gains the Central Computer, Makeshift; Central Computer, Mark 1; and Comms Package, Prototype modifications at no cost. Additionally, when a crewmember on your station has to make an Intelligence (Technology) check, if their Intelligence modifier is less than that of the station's Intelligence modifier, they can instead use the station's Intelligence modifier to Technology checks.\r\n\r\n### Role Mastery\r\nAt 4th tier, you master a particular style of design for your ship. Choose from the following.\r\n\r\n#### Space Station (All Sizes)\r\nWhen a crewmember on your station is targeted by the Interfere action, they have advantage on the ship's Wisdom saving throw made to avoid it. If they already have advantage, they can instead reroll one of the dice once.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"3","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Step-By-Step Starships","chapterNumber":1,"contentMarkdown":"# Chapter 1: Step-By-Step Starships\r\n\r\nYour first step in transitioning to the space portion of your *Star Wars* 5th Edition campaign is imagining how having a starship impacts your character. When participating in the space portion of the game, your character is impacted by a number of features, including their chosen deployment, the size and style of ship on which they adventure, and the modification and equipment that ship has access to. These choices can enhance and enrich your avatar.\r\n\r\nBefore you dive into step 1 below, think about where your adventurer would be most likely to participate in a starship. You might be a dauntless ace pilot, or a crushing gunner. Perhaps you are a genius mechanic, an intricate operator, or a charming coordinator. Maybe you are interested in a mixture of these roles. \r\n\r\nAdditionally, what kind of ship, and your intended purpose, can impact these decisions. Do you want to be a soldier in the Imperial Navy, piloting a TIE fighter and leading a squadron? Or are you more inclined to travel as a mercenary aboard a light freighter, taking jobs as you see fit in order to keep your ship in space? Maybe you instead want to be a bounty hunter in an assault craft, tracking your quarry to the Outer Rim, and beyond?\r\n\r\nOnce you have an idea in mind, follow these steps in order, making decisions that reflect the character and ship you want. Your conception of your character and starship might evolve with each choice you make. What's important is that you come to the table with a character you're excited to play.\r\n\r\nThroughout this section, we use the term **deployment sheet** and **starship sheet** to mean whatever you use to track your character and starship, respectively, whether it's a formal sheet (like the ones at the end of these rules), some form of digital record, or a piece of notebook paper. The official SW5e sheets are a fine place to start until you know what information you need and how you use it during the game.\r\n\r\n> ##### Building the Millennium Falcon\r\n> Each step of ship/crew creation includes an example of that step, with a player building the iconic starship the Millennium Falcon, as it is portrayed during the events of Episode IV.\r\n\r\n### 1. Acquire a Starship\r\nA crew is nothing without its starship, and this chapter covers the acquisition and initial set up of starships. Like classes and deployments, starships have their own features that are driven by their size category. **Chapter 3: Starships** provides more information about acquiring a starship, [Starship Size Categories](#Starship%20Size%20Categories), and starship features.\r\n\r\nWhat starship you acquire is the second impactful decision you make when you adopt the space portion of your campaign. Each size category of starship has unique and tangible features, and determines what kind of crew your starship can support. A Small starship, for instance, can support 1-2 crew members at tier 0, while a Medium starship can support an entire adventuring party. At larger sizes, the crew shifts into the hundreds and thousands of crew members a ship can support.\r\n\r\n#### Tier\r\nOnce you've obtained your starship&mdash;through any number of ways&mdash;you gain the ability to upgrade your ship. Typically, like deployments, starships are obtained at tier 0. A tier 0 ship is typically newly constructed, or otherwise not yet battle-tested or broken in.\r\n\r\nStarting off at tier 0 marks the beginning of your starship's journey and evolution. Over time, with the use of resources and workers&mdash;and credits&mdash;a starship can be upgraded from tier 0 all the way up to tier 5, unlocking unique features&mdash;and choices&mdash;as it improves.\r\n\r\n#### Hull Points and Hull Dice\r\nYour starship's hull points define how tough your ship's hull is in combat and other dangerous situations. Your hull points are determined by your Hull Dice (short for Hull Point Dice).\r\n\r\nAt tier 0, your starship has a varying quantity and size of Hull Dice, depending on its size category. Your starship starts with hull points equal to the highest roll of that die, as well as the average roll for each additional Hull Die. You also add your Constitution modifier to each die. This is your **hull point maximum**.\r\n\r\nRecord your starship's hull points on your starship sheet. Also record the type of Hull Die your starship uses and the number of Hull Dice it has. After you conduct refitting&mdash;and at certain other points&mdash;you can spend Hull Dice to regain hull points (see  “RECHARGING AND REFITTING” in **Chapter 8: Adventuring**).\r\n\r\n#### Shield Points and Shield Dice\r\nMost starships also have shields, although they do not come standard, and their strength&mdash;your ship's **shield point maximum**&mdash;and the amount they can regenerate each round&mdash;your ship's **shield regeneration rate**&mdash;is determined partially by your Shield Dice, your ship's Strength modifier, and your choice of shields, detailed in **Chapter 5: Equipment**.  The number and type of shield dice normally parallels your Hull Dice.\r\n\r\n> ##### Building the Millennium Falcon, Step 1\r\n> The Millennium Falcon is a heavily modified YT-1300f light freighter, and falls under the Medium size category. The ship starts at tier 0.\r\n>As a tier 0 Medium ship, the Millennium Falcon chooses a role, granting a +1 ASI. We choose \"freighter,\" granting a +1 to the Falcon's Constitution score.\r\n>As a tier 0 Medium ship, the Millennium Falcon has 5 Hull Dice - which are d8s - and a Constitution modifier of +1. Consequently, the Millennium Falcon has 33 hull points: 8 + the average for the subsequent four dice (5) + the Constitution modifier for each Hull Die (5 x 1).\r\n>The Millennium Falcon has shields, so we turn to **Chapter 5: Equipment** and turn to the \"Shields\" section. We select fortress shields to represent the Falcon's very powerful shield systems. As a tier 0 Medium ship, the Falcon has 5 Shield Dice - which are d8s - and a Strength modifier of +2. Consequently, the Falcon has 38 Base Shield Points: 8 + the average for the subsequent four dice (5) + the Strength modifier for each Shield Die (5 x 2). Because fortress shields multiply your Base Shield Points by 3/2, the Falcon has a Shield Capacity of 57. The Falcon's Shield Regeneration rate is 5: the shield die maximum (8) multiplied by the fortress shield Shield Regeneration Rate Coefficient (2/3).\r\n>When the Millennium Falcon progresses to tier 1 it gains the following features: Starship Improvements and Evasive Maneuvers. We record Evasive Maneuvers on the starship sheet. Since the Millennium Falcon is fast, we increase its Strength by 2 with the Ability Score Improvement. This increases the Falcon's Strength Modifier by 1 to +3, adding 5 more to the ship's Base Shield Points. It gains an additional Hull Dice, and it’s current and maximum hull points increases by 6. It also gains an additional Shield Die, increasing its Base Shield Points by another 8 (5+3). Recalculating the Falcon's Shield Capacity gives us 76. \r\n>Additionally, at tier 0, a Medium ship gets a choice of two saving throw proficiencies. For the Falcon, we choose Strength and Dexterity.\r\n\r\n### 2. Determine Ability Scores\r\nMuch of what your ship does in the game depends on its six abilities: Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma. Each ability has a score, which is a number you record on your character sheet.\r\n\r\nThe six abilities and their use in the game are described in **Chapter 7: Using Ability Scores**. The **Ability Score Summary** table provides a quick reference for what qualities are measured by each ability.  Ships size categories decrease and/or increase the base ability scores, as can tier advancements and ship modifications.\r\n\r\nYou generate your shipís six ability scores using a standard array of ability scores that you assign to each ability as you wish (Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma): 15, 14, 13, 12, 10, 8. Afterward, make any changes to your ability scores as a result of your ship size.\r\n\r\nAfter assigning your ability scores, determine your ability modifiers using the **[Ability Scores and Modifiers](#Ability%20Scores%20and%20Modifiers)** table. To determine an ability modifier without consulting the table, subtract 10 from the ability score and then divide the result by 2 (round down). Write the modifier next to each of your scores.\r\n\r\n> ##### Building The Millennium Falcon, Step 2\r\n> We will use the standard set of scores (15, 14, 13, 12, 10, 8) for the Falconís abilities. The Falcon is fast nimble, so weíll put it's highest scores, 15 and 14, in Strength and Dexterity, respectively. We then apply the 13 to Intelligence, the 12 to Constitution, the 10 to Wisdom and the 8 to Charisma. Because Medium ships have no ability score adjustments, The Falcon's [Ability Scores and Modifiers](#Ability%20Scores%20and%20Modifiers) look like this: Strength 15 (+2), Dexterity 14 (+2), Constitution 12 (+1), Intelligence 13 (+1), Wisdom 10 (+0), Charisma 8 (-1).\r\n\r\n#### Variant: Customizing Ability Scores\r\nAt your Game Masterís option, you can use this variant for determining your ship's ability scores. The method described here allows you to build a ship with a set of ability scores you choose individually.\r\n\r\nYou have 27 points to spend on your ability scores. The cost of each score is shown on the **[Ability Score Point Cost](#Ability%20Score%20Point%20Cost)** table. For example, a score of 14 costs 7 points. Using this method, 15 is the highest ability score you can end up with, before applying special increases. You canít have a score lower than 8.\r\n\r\nThis method of determining ability scores enables you to create a set of three high numbers and three low ones (15, 15, 15, 8, 8, 8), a set of numbers that are above average and nearly equal (13, 13, 13, 12, 12, 12), or any set of numbers between those extremes.\r\n\r\n##### Ability Score Point Cost\r\n\r\n|Score|\tCost|\r\n|:--:|:--:|\r\n|8 |0|\r\n|9 |1|\r\n|10|2|\r\n|11|3|\r\n\r\n|Score|\tCost|\r\n|:--:|:--:|\r\n|12|\t4|\r\n|13|\t5|\r\n|14|\t7|\r\n|15|\t9|\r\n\r\n### 3. Installing Modifications\r\nYour starship includes a number of standard modifi-cations, and can include more modifications&mdash;at the expense of credits, workers, and time&mdash;enhancing and augmenting the ship's functionality. Modifications fall into five categories: engineering, operation, suite, universal, and weapon. **Chapter 4: Modifications** provides more information about these categories and installation costs.\r\n\r\n> ##### Building the Millennium Falcon, Step 3\r\n> At tier 0, the Millennium Falcon comes with one suite at no cost, so we add a Barracks. Additionally, we choose a Living Quarters to give the crew their own rooms. We also choose the Recreation and Storage Compartment suites, bringing the total modifications to 3.\r\n> The Millennium Falcon has dorsal and ventral cannons, so we choose two Fixed Hardpoints. Addi-tionally, these are turrets that can fire in a 360 degree arc, so we add two turret mountings, both with direct control mods. We're up to 9 modifications.\r\n> She has a Hyperdrive and Navcomputer, bringing the total modifications to 11.\r\n> Finally, the Falcon has exterior protection, so we take the Anti-Boarding System as our 12th mod.\r\n> As Han gains credits, he continues to upgrade the ship, eventually installing an Improved Navcomputer modification, two weapon slave arrays to allow firing the turrets from the cockpit, and another fixed hardpoint.\r\n\r\n### 4. Choose Equipment\r\nStarships have access to certain types of equipment. Every starship has access to armor and shields as well as a reactor and a power coupling system, and most have access to weapons. Many starships, especially larger ones, have access to hyperdrives and navcomputers. The **Equipment** chapter provides more information on these categories.\r\n\r\n#### Armor Class\r\nYour **Armor Class** (AC) represents how well your starship avoids being damaged in battle&mdash;either my avoiding being hit entirely or by remaining essentially unharmed from an attack. Your AC is determined by four major factors: your base AC, your starship's Dexterity modifier, your ship's Tier bonuses, and the type of armor your ship has installed (see **Chapter 5: Equipment** and **Chapter 4: Modifications**).\r\n\r\nYour ship has a base AC of 10. You then add (or subtract) the other factors above: Dexterity modifier, potentially limited by the type of armor you have installed; your ship's Tier bonus, if any; and any applicable modifications.\r\n\r\n#### Weapons\r\nYour ship can have a number of weapons no greater than the number of fixed hardpoints it has. For each fixed hardpoint, a single weapon can be attached. When making attack rolls, or setting the save DC for ship weapons, we use the starship's Wisdom modifier, and the crew's proficiency bonus. We also add the ship's Strength modifier to damage rolls.\r\n\r\n> ##### Building the Millennium Falcon, Step 4\r\n> The Millennium Falcon has a base AC of 10. The Falcon comes with deflection armor installed, which allows the ship to add up to a +2 Dexterity bonus.  With a Dexterity of 14, we add 2 to the Millennium Falcon's base armor class for a total of 12 at Tier 1. \r\n> The Falcon has two turreted hardpoints, and we choose traditional quad laser cannons to equip to them. When making an attack roll with either weapon, we use the ship's Wisdom modifier (+1) and the crew's proficiency bonus (+3, e.g.). When making a damage roll, we add the ship's Strength modifier (+3). The fixed hardpoint is equipped with a missile launcher and is loaded with concussion missiles.  The missile's saving throw has a DC equal to 8 plus the ship's Wisdom modifier (+1) and the crew's proficiency bonus (+3). We note that the quad laser cannons have an unlimited firing arc, do 2d4 + 3 energy damage, have a range of 800/3200, can fire in rapid mode, and overheat after shooting 8 shots.  The concussion missiles have a limited firing arc, do 2d8 + 3 energy damage, have a range of 600/2400 and must fire in either burst 1 or rapid mode.  These Falcon can fire 8 missiles before needing to be reloaded, and these missiles have the \"explosive\" feature, which will force concentration checks by characters on affected ships.\r\n\r\n### 5. Come Together\r\nMost Star Wars characters don't work alone, and while some starships can be operated by a single crew member, it is more dynamic&mdash;and engaging&mdash;to crew a starship with a *party*&mdash;each member of the party fulfilling a needed role on the ship. Teamwork and cooperation greatly improve your party's chance to survive the unapologetic lethality of spacefaring.\r\n\r\n#### Deployments\r\nThere are six major roles directly tied to the control of a starship: coordinator, gunner, mechanic, operator, pilot, and technician.  Any character can have ranks in any one or more deployments and any character can fulfill any one or more roles on a ship at any given time, but because there are only some functions a pilot can access, one character must be at the helm, whether or not the character has any ranks in Pilot. How your character interacts with your ship&mdash;or enemy ships&mdash;is determined by what they decide to do on any particular turn, but characters will usually begin to focus on one or two particular roles. **Chapter 2: Deployments** provides more information about each deployment.\r\n\r\nThe deployment you choose may be the first impactful decision you make when you adopt the space portion of your campaign. Each of the six deployments has a unique and tangible function, and many of them interact&mdash;and synergize&mdash;with your character's species and class features. As you progress through the ranks of your chosen deployment, you unlock unique features that augment and enhance your interaction with that deployment, potentially granting you new actions, or simply improving the actions already available to your deployment.\r\n\r\n#### Rank\r\nTypically, a character starts their space journey at deployment rank 0, and advances through the ranks (up to 5th) over time. A rank 0 character is typically inexperienced in the ways of their starship, although he or she might have been on a starship previously.\r\n\r\nStarting off at rank 0 marks your character's entry in the spacefarer life. If you're already familiar with the game, or if you are joining an existing SW5e campaign, your DM might decide to have you begin at a higher rank, on assumption that your character has already survived a few harrowing adventures. Record your rank on your deployment sheet. If you're starting at a higher rank, record the additional elements your deployment specialization grants you.\r\n\r\n> ##### Building the Millennium Falcon, Step 5\r\n> A ship is no good without a crew, especially her pilot: Han Solo in this case. Han is a versatile character aboard a ship, but he is strongest in the piloting role (best in the galaxy). \r\n> When Han achieves his first rank, we spend that rank in the pilot deployment specialization, unlocking the Piloting Procedure and Venture deployment features. For his Piloting Procedure, we mark that Han's power dice are d4s. Additionally, Han knows two tactics: for these we choose Koiogran Turn and Snap Roll. For his Venture, we choose Precision Gunner.\r\n\r\n#### Beyond the Basics\r\nAs your characters&mdash;and their starship&mdash;go on adventures and overcome challenges, they can increase in their ranks and tiers, respectively. While tiers are driven by the amount of effort&mdash;and credits&mdash;directly applied to the starship, ranks are earned separately. \r\n\r\nTypically, characters start at deployment rank 0, achieving rank 1 after completing their first successful encounter and earning prestige. The GM may decide, however, that characters start at 1st rank or higher, depending on choices in a character's background or during an adventure. Higher ranks are achieved by successfully completing more encounters and earning more prestige, as shown below in the **[Deployment Rank Prestige](#Deployment%20Rank%20Prestige)** table.\r\n\r\n##### Deployment Rank Prestige\r\n|DeploymentRank|TotalPrestige|\r\n|:--:|:--:|\r\n|1st|1|\r\n|2nd|4|\r\n|3rd|8|\r\n|4th|12|\r\n|5th|16|\r\n\r\nAnything that requires the characters to exercise their skills yields prestige. Defeating, routing, or escaping an encounter are the most common methods, but other actions might yield prestige at the discretion of the GM; completing a training simulation or successfully talking your way out of a situation might earn you prestige, for instance.\r\n\r\n#### Beyond 5th Rank\r\nCharacters who reach 5th rank across their deployments may want to continue progressing in their starship skills. Additional prestige earned can yield additional ranks, though no character can gain higher than 5th rank in any deployment. For each rank beyond 5th, the amount of required prestige increases by 4; achieving 6th rank would require an additional 8 prestige (24 total), while achieving 7th rank would require an additional 12 prestige (36 total).\r\n\r\n> The expectation is to tie ranks&mdash;and hopefully tiers&mdash;to proficiency bonuses. When characters reach 5th-level, their proficiency bonus increases to 3, and again at 9th (4), 13th (5), and 17th (6). Ranks 2-4 are designed to be awarded at or around those same improvements.\r\n\r\n#### Features and Hull/Shield Dice\r\nWhen your starship gains a tier, it unlocks additional features, depending on its size, as detailed in the description. Some of these features allow you to increase your starship's ability scores. You can't increase an ability score above 20 unless otherwise noted. \r\n\r\nEach time your starship gains a tier, it gains gain 1 additional Hull Die and 1 additional Shield Die. Roll the Hull Die, add your ship's Constitution modifier to the roll, and add the total to your hull point maximum. Next, roll the Shield Die, add your ship's Stength modifier to the roll, and add the total to your base shield points which is then multiplied by the appropriate factor depending on which shields your ship has.  Alternatively, for both hull and shields, you can use the fixed value shown in your class entry, which is the average result of the die roll (rounded up).\r\n\r\nWhen your ship's Constitution modifier increases by 1, its hull point maximum increases by 1 for each Hull Die it has. For example, if your tier 0 Medium ship has a Constitution score of 14, when it reaches tier 1, you increases its Constitution score from 14 to 16, thus increasing its Constitution modifier from +2 to +3. At tier 0, your Medium starship has a total of 6 Hull Dice, so its hull point maximum then increases by 6. The same rules apply to your base shield points and your Strength score.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"1","timestamp":"0001-01-01T00:00:00+00:00","eTag":null},{"chapterName":"Using Ability Scores","chapterNumber":7,"contentMarkdown":"# Chapter 7: Using Ability Scores\r\n\r\nSix abilities provide a quick description of every ship's, physical and electronic characteristics:\r\n\r\n___\r\n\r\n- **Strength**, measuring reactor output\r\n- **Dexterity**, measuring maneuverability\r\n- **Constitution**, measuring durability\r\n- **Intelligence**, measuring processing and data storage \r\n- **Wisdom**, measuring targeting, sensors, and awareness\r\n- **Charisma**, measuring presence and electronic communications power and ability\r\n\r\n___\r\n\r\nIs a ship tough, and her crew well-trained? Fast and frightening? Nimble and notorious? Ability scores de-fine these traits&mdash;a ship's strengths and weaknesses.\r\n\r\nThe three main rolls of the game-the ability check, the saving throw, and the attack roll-rely on the six ability scores. The book's introduction describes the basic rule behind these rolls: roll a d20, add an ability modifier derived from one of the six ability scores, and compare the total to a target number.\r\n\r\nThis chapter focuses on how to use ability checks and saving throws, covering the fundamental activities that creatures attempt in the game. Rules for attack rolls appear in chapter 9.\r\n\r\n## Ability Scores and Modifiers\r\nEach of a ship's abilities has a score, a number that defines the magnitude of that ability. An ability score is not just a measure of innate capabilities, but also encompasses a ship's modification, in activities related to that ability.\r\n\r\nA score of 10 or 11 is the normal average, but many ships are a cut above average in most abilities. A score of 18 is the highest that a ship usually reaches. Some can have scores as high as 20, and monsters and capital ships can have scores as high as 30.\r\n\r\nEach ability also has a modifier, derived from the score and ranging from -5 (for an ability score of 1) to +10 (for a score of 30). The [Ability Scores and Modifiers](#Ability%20Scores%20and%20Modifiers) table notes the ability modifiers for the range of possible ability scores, from 1 to 30.\r\n\r\nTo determine an ability modifier without consulting the table, subtract 10 from the ability score and then divide the total by 2 (round down).\r\n\r\nBecause ability modifiers affect almost every attack roll, ability check, and saving throw, ability modifiers come up in play more often than their associated scores.\r\n\r\n##### Ability Scores and Modifiers\r\n\r\n|Score|Modifier|\r\n|:--:|:--:|\r\n|1|-5|\r\n|2-3|-4|\r\n|4-5|-3|\r\n|6-7|-2|\r\n|8-9|-1|\r\n|10-11|+0|\r\n|12-13|+1|\r\n|14-15|+2|\r\n\r\n|Score|Modifier|\r\n|:--:|:--:|\r\n|16-17|+3|\r\n|18-19|+4|\r\n|20-21|+5|\r\n|22-23|+6|\r\n|24-25|+7|\r\n|26-27|+8|\r\n|28-29|+9|\r\n|30|+10|\r\n\r\n## Advantage and Disadvantage\r\nSometimes a special ability or power tells you that you have advantage or disadvantage on an ability check, a saving throw, or an attack roll. When that happens, you roll a second d20 when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage and roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17.\r\n\r\nIf multiple situations affect a roll and each one grants advantage or imposes disadvantage on it, you don't roll more than one additional d20. If two favorable situations grant advantage, for example, you still roll only one additional d20.\r\n\r\nIf circumstances cause a roll to have both advantage and disadvantage, you are considered to have neither of them, and you roll one d20. This is true even if multiple circumstances impose disadvantage and only one grants advantage or vice versa. In such a situation, you have neither advantage nor disadvantage.\r\n\r\nWhen you make a roll with advantage or disadvantage, only the d20 is rolled twice. Any additional dice, such as the d4 granted by the *guidance* force power, are only rolled once.\r\n\r\nWhen you have advantage or disadvantage and something in the game, such as the iktotchi's Precognition trait, lets you reroll the d20, you can reroll only one of the dice. You choose which one. For example, if an iktotchi has advantage on an ability check and rolls a 1 and a 13, the iktotchi could use the Precognition trait to reroll the 1.\r\n\r\nYou usually gain advantage or disadvantage through the use of special abilities, actions, or powers. Inspiration (see chapter 4) can also give a character advantage on checks related to the character's personality, ideals, or bonds. The GM can also decide that circumstances influence a roll in one direction or the other and grant advantage or impose disadvantage as a result.\r\n\r\n### Advantage on Other Rolls\r\nThough less common, advantage and disadvantage can occur on other types of rolls as well. When you have advantage or disadvantage on a roll, as with a d20, you roll the dice twice, using the higher of the two results with advantage, and using the lower of the two results if you have disadvantage. If a roll has multiple dice, you roll the dice together and treat the results separately.\r\n\r\nFor instance, the Boost Weapons action potentially grants advantage on a ship damage roll once per turn. If any additional dice would be added to the damage roll, those additional dice are only rolled once.\r\n\r\n## Proficiently Equipped\r\nShips can be proficiently equipped for particular tasks, allowing her crew to add their proficiency bonus to the roll or save, as long as the crewmember has at least one deployment rank. Enemy ships also have this bonus, which is incorporated in their stat blocks. The bonus is used in the rules on ability checks, saving throws, and attack rolls.\r\n\r\nYour proficiency equipped bonus can't be added to a single die roll or other number more than once. For example, if two different rules say you can add your proficiency bonus to a Wisdom saving throw, you nevertheless add the bonus only once when you make the save.\r\n\r\nOccasionally, your proficiency bonus might be multiplied or divided (doubled or halved, for example) before you apply it. If a circumstance suggests that your proficiency bonus applies more than once to the same roll, you still add it only once and multiply or divide it only once.\r\n\r\nBy the same token, if a feature or effect allows you to multiply your proficiency bonus when making an ability check that wouldn't normally benefit from your proficiency bonus, you still don't add the bonus to the check. For that check your proficiency bonus is 0, given the fact that multiplying 0 by any number is still 0. For instance, if you are not proficiently equipped in the Data skill, you gain no benefit from a feature that lets you double your proficiency bonus when you make Intelligence (Data) checks.\r\n\r\nIn general, you don't multiply your proficiency bonus for attack rolls or saving throws. If a feature or effect allows you to do so, these same rules apply.\r\n\r\n### Expertly Equipped\r\nCertain features, such as Active Camouflage or a Boarding Harpoon, let your ship double its proficiency bonus with a given skill or modification, granting your ship the status of expertly equipped in that skill or modification. As usual, you can only gain expertly equipped status in a skill or modification once.\r\n\r\n##### Proficiently Equipping a Ship\r\n|  Skill | Modification(s) that Proficiently Equip | Modification(s) that Expertly Equip | Skill Description|\r\n|:----|:---|:---|:---|\r\n|\t_Str_\t    ||||\r\n|  Boost| Cryogenic Capacitor, Mk I| Cryogenic Capacitor, Mk II|push your ship to or beyond its limits|\r\n|  Ram| Hardened Prow| Boarding Harpoon| slam into an object to deal damage.|\r\n|\t_Dex_\t    ||||\r\n|  Hide| Sensor Dampener; Stealth Device| Sensor Dampener; Stealth Device; Stealth Device, Active Camouflage|allows the ship to remain undetected|\r\n|  Maneuvering| (Piloting proficiency)| (Piloting expertise)|perform tricky maneuvers|\r\n|\t_Con_\t    ||||\r\n|  Patch| Damage Control System| Automated Protocols|attempt to regain hull points|\r\n|  Regulation| Power Converter, Mk I| Power Converter, Mk II| pushed a ship beyond its natural limits\r\n|\t_Int_\t    ||||\r\n|  Astrogation| Navcomputer| Navcomputer, Mark II| calculate hyperspace jumps|\r\n|  Data| Comms Package, Mk I| Comms Package, Mk II|access data banks or process data|\r\n|  Probe| Scanner, Premium| Scanner, Prototype|focused sensing and probing|\r\n|\t_Wis_\t    ||||\r\n|  Scan| Scanner, Mk I| Scanner, Mk II|notice and locate the presence of objects|\r\n|\t_Cha_\t    ||||\r\n|  Impress| Impressive Interior; Impressive Exterior|  Impressive Interior; Impressive Exterior|a general measurement of your ship's beauty and soundness|\r\n|  Interfere| Comms Suppressor, Mk I| Comms Suppressor, Mk II|interfere with another ship's systems|\r\n|  Menace| Threatening Design| Threatening Hardware| threaten via ship's appearance or abilities|\r\n|  Swindle| Disguised Features; Secondary Transponder Code| Disguised Features; Secondary Transponder Code|pass your ship off as something it's not|\r\n\r\n## Ability Checks\r\nAn ability check represents a ship's ability to overcome a challenge. The GM calls for an ability check when a ship, or a crewmember, attempts an action (other than an attack) that has a chance of failure. When the outcome is uncertain, the dice determine the results.\r\n\r\nFor every ability check, the GM decides which of the 6 abilities is relevant to the task at hand and the difficulty of the task, represented by Difficulty Class. The more difficult a task, the higher its DC. The Typical Difficulty Classes table shows the most common DCs.\r\n\r\nTo make an ability check, roll a d20 and add the relevant ability modifier. As with other d20 rolls, apply bonuses and penalties, and compare the total to the DC. If the total equals or exceeds the DC, the ability check is a success-the ship, or crewmember, overcomes the challenge at hand. Otherwise, it's a failure, which means the ship or crewmember makes no progress toward the objective or makes progress combined with a setback determined by the GM.\r\n\r\nWhen making an ability check that involves your ship's abilities, you use the ship's score instead of your own, as dictated by logic.\r\n\r\n### Contests\r\nSometimes one ship's or crewmember's efforts are directly opposed to another's. This can occur when both of them are trying to do the same thing and only one can succeed, such as attempting to pass through a narrow gap simultaneously. This situation also applies when one of them is trying to prevent the other one from accomplishing a goal—for example, when a ship's gravity projector tries to prevent another ship from jumping to hyperspace. In situations like these, the outcome is determined by a special form of ability check, called a contest.\r\n\r\nBoth participants in a contest make ability checks appropriate to their efforts. They apply all appropriate bonuses and penalties, but instead of comparing the total to a DC, they compare the totals of their two checks. The participant with the higher check total wins the contest. That ship or crewmember either succeeds at the action or prevents the other one from succeeding.\r\n\r\nIf the contest results in a tie, the situation remains the same as it was before the contest. Thus, one contestant might win the contest by default. If two ships tie in a contest to pass through a narrow gap, neither ship makes it. In a contest between a ship's gravity generator trying to prevent another ship from jumping to hyperspace, a tie means that the second ship fails to jump.\r\n\r\n|Task Difficulty|DC|\r\n|:--|:--:|\r\n|Very easy|\t5|\r\n|Easy|\t10|\r\n|Medium|\t15|\r\n|Hard\t|20|\r\n|Very hard\t|25|\r\n|Nearly impossible|\t30|\r\n\r\n### Passive Checks\r\nA passive check is a special kind of ability check that doesn't involve any die rolls. Such a check can represent the average result for a task done repeatedly, such as probing meteors over and over, or can be used when the GM wants to secretly determine whether the characters succeed at something without rolling dice, such as noticing a hidden ship.\r\n\r\nHere's how to determine a ship's total for a passive check:\r\n\r\n10 + all modifiers that normally apply to the check. If the ship has advantage on the check, add 5. For disadvantage, subtract 5. The game refers to a passive check total as a score.\r\n\r\nFor example. if a 1st-tier ship has a Wisdom of 15 and is proficiently equipped in Scan, it has a passive Wisdom (Scan) score of 13.\r\n\r\n## Using Each Ability\r\nEvery task that a ship or character might attempt in the game is covered by one of the six abilities. This section explains in more detail what those abilities mean and the ways they are used in the game.\r\n\r\n### Strength\r\nStrength measures the power of a ship's reactor.\r\n\r\n#### Strength Checks\r\nYour GM may call for Strength checks when you undergo interactions not covered by skills, such as trying to push through a malleable obstruction like a Conner net.\r\n\r\n***Ram.*** Use the Ram skill when you want to slam into another object to deal damage.\r\n\r\n***Boost.*** Use the Boost skill when you attempt to push your ship to or beyond its limits.  A successful Boost check can break ties in straight-line speed contests or to determine how fast your ship can accelerate to top speed.  You also make boost checks in response to taking the boost engines, boost shields, and boost weapons actions.  \r\n\r\n#### Strength Saving Throws\r\nCertain features, such as a Tractor Beam, call for a Strength saving throw. When you make a Strength saving throw, you roll a d20 and add your ship's Strength modifier to the roll. If your ship is proficiently equipped for the saving throw, you also add the proficiency bonus of the crewmember at the helm to the result of the roll.\r\n\r\n#### Damage Rolls\r\nYou add your ship's Strength modifier to ship weapon damage rolls.\r\n\r\n#### Weapon Hardpoints\r\nWhile a ship can have any number of hardpoints, it can only Fire a number of times each round equal to the ship's Strength modifier (minimum of +1) times its ship hardpoint size modifier (round up), as shown in the Ship Hardpoint Size modifier table below.  Normally each weapon can only be Fired once per round.\r\n\r\n##### Ship Hardpoint Size Modifier\r\n\r\n|Ship Size|Hardpoint Size Modifier|\r\n|:--:|:--:|\r\n|Tiny|\t1|\r\n|Small|\t1|\r\n|Medium|\t1.5|\r\n\r\n|Ship Size|Hardpoint Size Modifier|\r\n|:--:|:--:|\r\n|Large\t|2.5|\r\n|Huge\t|2|\r\n|Gargantuan|\t3|\r\n\r\n### Dexterity\r\nDexterity measures the nimbleness of a ship, as determined by its thrusters and pilot.\r\n\r\n#### Dexterity Checks\r\nYour GM may call for Dexterity checks when you undertake actions not covered by skills.\r\n\r\n***Hide.*** The Hide skill allows the ship to remain undetected by sensors from other ships and stations.  Use the Hide skill when you want to approach a ship or station along a known blind spot, or slink through a debris field, or hide amongst asteroids.  \r\n\r\nThe Hide skill is generally contested by a passive Wisdom (Scan) score if the ship's presence is unknown, a Wisdom (Scan) check if the presence is suspected or known but the general location is unknown, and an Intelligence (Probe) check if the approximate location of a ship is known or suspected.\r\n\r\n***Maneuvering.*** Use the Maneuvering skill to perform tricky maneuvers in combat, to deftly fly through an asteroid field, and to impress others with flying skills.  \r\n\r\nWhen you would make a Dexterity (Maneuvering) check, you may instead make an Intelligence (Piloting) check at disadvantage.\r\n\r\nYour ship is considered proficiently equipped in this skill if the crewmember at the helm is proficient in Piloting. \r\n\r\nYour ship is considered expertly equipped in this skill if the crewmember at the helm has expertise in Piloting.\r\n\r\n> ##### Hiding\r\n> When you try to hide your ship, make a Dexterity (Hide) check. Until you are discovered or stop hiding, that check is contested by the Wisdom (Scan) check of any ship or station that actively searches for signs of your presence.\r\n> You can't hide from a ship that can perceive you, and if your ship does something to make your ship noticed, you give away your position. \r\n> In combat, most ships stay alert for danger, so if you come out of hiding and approach a ship, it usually per-ceives you. However, under certain circumstances, the GM might allow you to stay hidden as you approach a ship that is distracted or has some blind spot or de-fect, allowing you to gain advantage on an attack before you are perceived.\r\n> ***Passive Scan.*** When you hide, there's a chance some-one will notice you even if they aren't searching. To determine whether such a ship notices you, the GM compares your Dexterity (Hide) check with that ship's passive Wisdom (Scan) score, which equals 10 + the ship's Wisdom (Scan) modifier. If the ship has advantage, add 5. For disadvantage, subtract 5.\r\n> For example, if a 1st-tier ship has a Wisdom of 15 and is proficiently equipped for Scan, it has a passive Wisdom (Scan) of 14.\r\n\r\n#### Dexterity Saving Throws\r\nCertain features, such as burst weapons, call for a Dexterity saving throw. When you make a Dexterity saving throw, you roll a d20 and add your ship's Dexterity modifier to the roll. If your ship is proficiently equipped for the saving throw, you also add the proficiency bonus of the crewmember at the helm to the result of the roll.\r\n\r\n> #### Alternative INITIATIVE\r\n> At the beginning of every combat, instead of rolling initiative, GMs can quickly use passive initiatives to determine order based on a ship's Dexterity and it's ship size base initiative as shown below in the Starship Size Base Initiative table below.\r\n>##### Starship Size Base Initiative\r\n>|Ship Size|Ship Size Base Initiative|\r\n>|:--:|:--:|\r\n>|Tiny|\t10|\r\n>|Small|\t9|\r\n>|Medium|8|\r\n>|Ship Size|Ship Size Base Initiative|\r\n>|:--:|:--:|\r\n>|Large\t|7|\r\n>|Huge\t|6|\r\n>|Gargantuan|5|\r\n>To calculate a ship's passive initiative, use the following formula:\r\n>___\r\n>**initiative = \"ship size base initiative\" + \"Dexterity modifier\"**\r\n>___\r\n\r\n### Constitution\r\nConstitution represents the durability of a ship's hull.\r\n\r\n#### Constitution Checks\r\nYour GM may call for a Constitution check when you undergo interactions not covered by skills, such as overcoming the debilitating nature of an ion storm.\r\n\r\n***Patch.*** You can attempt to have the ship patch up damage it has taken, using one of its Hull Dice. When you take the Patch action, you make a Constitution (Patch) check (DC = 10 or half the ship's missing hull points, whichever number is higher). On a failure, you have disadvantage on the Hull Dice roll. On a success you roll the Hull Die normally.  \r\n\r\nWhen you would make a Constitution (Patch) check, you may instead make an Intelligence (Mechanic's Kit) check at disadvantage using your own Intelligence modifier.\r\n\r\n***Regulation.*** Your GM may require a Regulation check when your ship is pushed beyond its natural limits.  Situations which might call for a Regulation check include:\r\n- Trying to reach safety on low fuel\r\n- In response to a mechanic straining the reactor\r\n- Attempting to run at top speed for long periods of time\r\n- Keeping life support running when out of fuel.\r\n\r\nWhen you would make a Constitution (Regulation) check, you may instead make an Intelligence (Mechanic's Kit) check at disadvantage using your own Intelligence modifier.\r\n\r\n#### Constitution Saving Throws\r\nCertain features, such as a Heavy Ion Cannon, call for a Constitution saving throw. When you make a Constitution saving throw, you roll a d20 and add your ship's Constitution modifier to the roll. If your ship is proficiently equipped in the saving throw, you also add the proficiency bonus of the crewmember at the helm to the result of the roll.\r\n\r\n#### Hull Points\r\nYour ship's Constitution modifier contributes to its hull points. Typically, your ship adds its Constitution modifier to each Hull Die it rolls for its hull points.\r\n\r\nIf your ship's Constitution modifier changes, its hull point maximum changes as well, as though it had the new modifier from tier 0. For instance, if your Small ship's Constitution modifier increases from +1 to +2 when it reaches 1st tier, you adjust its hull point maximum as though the modifier had always been +2. So you add 3 hull points for tier 0, and then roll your hull points for tier 1 using your new modifier. Additionally, if some effect lowers your ship's Constitution score so as to reduce its Constitution modifier by 1, its hull point maximum is reduced as well.\r\n\r\n#### Suites\r\nA ship's maximum number of suites is based on its size and Constitution modifier.\r\n\r\n### Intelligence\r\nIntelligence represents the capability of the ship's computers, determines its minimum crew size, and affects its discrimination, calculation, and memory functions.\r\n\r\n#### Intelligence Checks\r\nAn Intelligence check comes into play when you need to draw on the ship's ability to process large amounts of data and sensory input, to access esoteric data, calculate complex mathematical problems or to deal with computer slicing. The Astrogation, Data, and Probe skills reflect aptitude in certain kinds of Intelligence checks.\r\n\r\n***Astrogation.*** Make an Astrogation check to calculate hyperspace jumps.  For more details on making Astrogation checks, see the \"Travel in Hyperspace\" section of Chapter 8.  \r\n\r\nWhen you would make an Intelligence (Astrogation) check, you may instead make an Intelligence (Technology) check at disadvantage using your own Intelligence modifier.\r\n\r\n***Data.*** Use the Data skill when you want to access your ship's data banks to learn information about appropriate information.  Ships often have standard information about hyperlanes, systems, planets, and other astronomical information.  Ships can also be upgraded to include more detailed information or information on other subjects.  The more obscure the information or the more off-topic, the higher the DC should be.  \r\n\r\n***Probe.*** When you focus your ship's sensor suite on an area or ship and investigate in detail, you make an Intelligence (Probe) check.  A successful check may reveal the location of a hidden ship, may indicate the presence of physical damage in a construct or of minerals in an asteroid, or may provide technical details about a ship you have probed or the presence of lifeforms on board.\r\n\r\nWhen you would make an Intelligence (Probe) check, you may instead make an Intelligence (Investigation) check at disadvantage using your own Intelligence modifier.\r\n\r\n#### Intelligence Saving Throws\r\nCertain features call for an Intelligence saving throw. When you make an Intelligence saving throw, you roll a d20 and add your ship's Intelligence modifier to the roll. If your ship is proficiently equipped in the saving throw, you also add the proficiency bonus of the crewmember at the helm to the result of the roll.\r\n\r\n### Wisdom\r\nWisdom represents the capability of the ship's targeting, sensors, and awareness of its surroundings.\r\n\r\n#### Wisdom Checks\r\nA Wisdom check comes into play when you need to draw on the ship's ability to sense its surroundings, perceive threats, and filter electromagnetic fields. The Scan skill reflects aptitude in certain kinds of Wisdom checks.\r\n\r\n***Scan.*** Your Wisdom (Scan) check lets you notice and locate the presence of something near your ship. It measures your general awareness of the ship's surroundings and the keenness of your ship's detection algorithms. \r\n\r\nWhen you would make a Wisdom (Scan) check, you may instead make a Wisdom (Perception) check at disadvantage using your own Wisdom modifier.\r\n\r\n#### Wisdom Saving Throws\r\nCertain features call for a Wisdom saving throw. When you make a Wisdom saving throw, you roll a d20 and add your ship's Wisdom modifier to the roll. If your ship is proficiently equipped in the saving throw, you also add the proficiency bonus of the crewmember at the helm to the result of the roll.\r\n\r\n#### Attack Rolls and Weapon Saves\r\nYou add your ship's Wisdom modifier to ship weapon attack rolls and to the DC of saves called for by ship weapons.\r\n\r\n### Charisma\r\nCharisma represents the presence of the ship, including its prestige and the clarity, sophistication, and power of the ship's communications and interference equipment.\r\n\r\n#### Charisma Checks\r\nA Charisma check comes into play when you need to command and influence others characters and ships with your own ship. The Impress, Interfere, Menace, and Swindle skills reflect aptitude in certain kinds of Charisma checks.\r\n\r\n***Impress.*** The Impress skill is a general measurement of your ship's beauty and soundness.  Whether or not your ship *is* impressively outfitted and well maintained, does it *look* impressively outfitted and well maintained?  Does your on-board cantina *look* opulent?  \r\n\r\nWhen you would make a Charisma (Impress) check, you may instead choose to make a Charisma (Persuasion) check at disadvantage using your own Charisma modifier.\r\n\r\n***Interfere.*** When you attempt to interfere with another ship or creature you use the Interfere skill.  When you would make a Charisma (Interfere) check, you may instead choose to make an Intelligence (Slicer's Kit) check at disadvantage using your own Intelligence modifier.\r\n\r\n***Menace.*** When you attempt to influence someone through the threat of your ship's abilities, whether speed, firepower, or toughness, the GM might ask you to make a Charisma (Menace) check.  Alternatively, you may make a Charisma (Intimidate) check at disadvantage using your own Charisma modifier.\r\n\r\n***Swindle.*** Use the Swindle skill when you want to pass your ship off as something it's not.  Examples of using the Swindle skill include:\r\n- passing off a heavily armed ship as a simple freighter\r\n- concealing the presence of lifeforms on your ship\r\n- concealing the presence of hidden cargo.\r\n\r\nWhen you would make a Charisma (Swindle) check, you may instead choose to make a Charisma (Deception) check at disadvantage using your own Charisma modifier.\r\n\r\n#### Charisma Saving Throws\r\nCertain features call for a Charisma saving throw. When you make a Charisma saving throw, you roll a d20 and add your ship's Charisma modifier to the roll. If your ship is proficiently equipped in the saving throw, you also add the proficiency bonus of the crewmember at the helm to the result of the roll.","contentTypeEnum":0,"contentType":"None","contentSourceEnum":0,"contentSource":"None","partitionKey":"Core","rowKey":"7","timestamp":"0001-01-01T00:00:00+00:00","eTag":null}]